{"posts":[{"title":"2023：一周速览，1","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 一周速览为每周日晚固定栏目，将会回顾本周的热点事件。 本周发布回顾 生活：中超，成都主场火爆收官 省馆之宝：宁夏，西夏 逛知乎：为什么中国实现不了免费医疗？ MLIR：新建一个Dialect（九），CMakeLists.txt 荐歌：明智之举（许嵩） 胡辣汤，你喜欢吗？ 热点事件 辉瑞新冠药未能纳入医保目录 数千人抗议内塔尼亚胡新政府 成都涉不雅聊天女副区长简历被撤 中国阳后出现肺炎人群约为8% 十问十答胡鑫宇失踪事件 麦卡锡当选美第118届国会众议长 超20亿人次大迁徙 2023春运开启 [马科斯首访华 开创新”黄金时代”](https://world.gmw.cn/2023-01/06/content_36282680.htm “马科斯首访华 开创新”黄金时代””) 朝韩领导人言称“战争准备” 李铁案据传有20人被抓或协查 欧盟:建议要求中国旅客提供核酸 裁员潮继续 亚马逊将裁1.7万人 住建部：买首套住房的要大力支持 乌总统拒绝普京停火协议:没必要 都看到这儿了，不如关注每日推送的“科文路”、互动起来~~ 至少，点个赞再走吧~","link":"/kewenlu2023/posts/f6ecff31/"},{"title":"2023：一周速览，10","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 一周速览为每周日晚固定栏目，将会回顾本周的热点事件。文末“阅读原文”可以直接跳转到相应新闻。 本周发布回顾 又是个税申报时，复习一下扣税规则 体育：WCBA总决赛，内蒙古主场力克四川 逛知乎：我在体制内（六） 生物：熊猫界顶流女明星“花花” 荐歌：照花台（郭德纲） 春夏之间的午后 热点事件 文末“阅读原文”可以直接跳转到相应新闻。 马斯克购地数千英亩建乌托邦 泽连斯基申请在奥斯卡露面再被拒 比亚迪、宝马中国回应“价格战” 网红阿秋单车被偷 香港警方回应 2023年研考国家线发布 伊朗和沙特在北京对话：恢复外交 标价8.8亿港元，许家印香港豪宅被挂牌出售 校友未兑现1100万捐赠被母校起诉 丁俊晖夺冠 打破39个月冠军荒 山西泽州二三孩中考将加10分？媒体：教育公平不是催生道具 潘石屹：从未在硅谷银行开过户 U20国足不敌韩国无缘亚洲杯四强 WCBA总决赛四川2-1内蒙古夺队史首冠 ~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~~ 至少，点个赞再走吧~","link":"/kewenlu2023/posts/d9ff511f/"},{"title":"2023：一周速览，11","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 一周速览为每周日晚固定栏目，将会回顾本周的热点事件。文末“阅读原文”可以直接跳转到相应新闻。 本周发布回顾 生活：2023奥斯卡颁奖，杨紫琼最佳女主 图灵奖：艾伦·佩利（1966） 逛知乎：我在体制内（七） 消费降级 荐歌：如果云知道（齐秦） 生活：又离职了 热点事件 文末“阅读原文”可以直接跳转到相应新闻。选自搜狐。 香港健康码系统删除全部用户资料 洪都拉斯总统:寻求与中国建交 世界杯新赛制出炉 48支球队参赛 脸书母公司Meta宣布再裁10000人 英德战机联合拦截一架俄罗斯飞机 中国正推动解决巴以问题 穿梭外交重启 尹锡悦开启访日行 杭州亚运会取消《炉石传说》项目 《党和国家机构改革方案》印发 国内2名专家已前往美国照料丫丫 新疆男篮回应复赛:重返CBA很不易 英国将取消中国赴英旅客核检要求 前女篮领队被曝出轨国手李梦 抗击美国 朝鲜1天80万人报名参军 苏州大学”造黄谣”男生被开除学籍 ~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~~ 至少，点个赞再走吧~","link":"/kewenlu2023/posts/aef86189/"},{"title":"2023：一周速览，12","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 一周速览为每周日晚固定栏目，将会回顾本周的热点事件。文末“阅读原文”可以直接跳转到相应新闻。 本周发布回顾 生活：剑门关游玩攻略 图灵奖：莫里斯·威尔克斯（1967） 逛知乎：我在体制内（八） 生活：又入职了 荐歌：年轮说（杨丞琳） 普普通通大马路，画条线就可以收费了 热点事件 文末“阅读原文”可以直接跳转到相应新闻。选自搜狐。 英官员称将向乌提供贫铀弹 日本首相抵达基辅会见泽连斯基 哈尔滨开展编外用人清理 5年完毕 赖清德正式代表民进党参选2024 近期，多人因造黄谣被处理 美国白宫5月将解散新冠应对团队 美军又拿下菲律宾4个军事基地 颜宁受聘担任深圳湾实验室主任 夫妻相约自杀 妻子未如约被判刑 前CBA球员孟祥宇实名举报不属实 去年全国幼儿园数量减少5000多所 足协纪律委员会主任王小平被查 拜登授权 美军在叙利亚发动空袭 “孙女炫富”涉事前局长或被立案 乌方：俄方失去攻势乌军将反攻 中国和洪都拉斯建立外交关系 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~~ 至少，点个赞再走吧~","link":"/kewenlu2023/posts/37f13033/"},{"title":"2023：一周速览，13","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 一周速览为每周日晚固定栏目，将会回顾本周的热点事件。文末“阅读原文”可以直接跳转到相应新闻。 本周发布回顾 科技：杀疯了的OpenAI 图灵奖：理查德·汉明（1968） 逛知乎：我在体制内（九） AI：图神经网络（GNN）系列文章预告 荐歌：1812序曲（柴可夫斯基） 中国女性发型的百年变迁 热点事件 文末“阅读原文”可以直接跳转到相应新闻。选自搜狐。 著名音乐家坂本龙一去世 媒体评张继科涉赌泄露隐私事件 22岁中国女学生在泰国遭绑架虐杀 平台收益减少 B站UP主发起停更潮 纽约计划在特朗普出庭时关闭主街 跪地求水林场主与矿方未达成一致 7名调查毒火车事故人员身体不适 多地家长赴中缅边境寻找孩子 六大行业绩出炉:日赚约37.2亿元 国家体育总局副局长杜兆才被查 王伟牺牲22周年：英雄从未远去 意大利：即日起禁止使用ChatGPT 英国宣布加入CPTPP 江西豫章书院案重审 将择期宣判 海南已全面启动全岛封关运作准备 中巴达成协议：贸易结算不用美元 朝鲜首次公开实战化核弹头 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~~ 至少，点个赞再走吧~","link":"/kewenlu2023/posts/40f600a5/"},{"title":"2023：一周速览，14","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 一周速览为每周日晚固定栏目，将会回顾本周的热点事件。文末“阅读原文”可以直接跳转到相应新闻。 本周发布回顾 转：一图看懂海南全岛封关 图灵奖：马文·闵斯基（1969） 逛知乎：我在体制内（十），加班 科技：分割一切！AI视觉领域奋起直追 荐歌：船长（赵雷） 闲聊：IC国家队，中国电科与中国电子 热点事件 文末“阅读原文”可以直接跳转到相应新闻。选自搜狐。 大熊猫丫丫正式移交中方 环台岛战备演习最新画面曝光！ “丰县生育八孩女子”丈夫被判九年 重庆姐弟坠亡案二审：被告翻供 “台独”顽固分子萧美琴被制裁 马克龙访华 巩俐夫妇同机随行 菲律宾公布新增4个美军基地位置 冯德莱恩和马克龙为何同时访华 以色列6天内对叙发动4次袭击 世卫：全球六分之一人患不孕不育 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~~ 至少，点个赞再走吧~","link":"/kewenlu2023/posts/de929506/"},{"title":"2023：一周速览，15","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 一周速览为每周日晚固定栏目，将会回顾本周的热点事件。文末“阅读原文”可以直接跳转到相应新闻。 本周发布回顾 科技：Megapack，特斯拉落地上海的新项目 图灵奖：詹姆斯·哈迪·威尔金森（1970） 逛Quora：不可思议的李小龙 荐歌：再见我的爱人（王晰，邓丽君） 国足新赛季进行时 热点事件 文末“阅读原文”可以直接跳转到相应新闻。选自搜狐。 拜登表示将在2024年再次竞选总统 美菲开启最大规模军事演习 解放军与台舰相遇 对峙录音曝光 印度将成为人口第一大国 特朗普：不会因被定罪而退出大选 高校回应副书记拟录取为本校博士 法国阻止欧盟出资20亿援乌弹药 假球？篮协要求调查上海江苏比赛 梅德韦杰夫：北约参战波兰将消失 法退休改革法案获批 将于9月生效 卢拉称对访华成果感到满意 岸田强烈谴责演讲现场爆炸事件 苏丹武装冲突已致56死 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~~ 至少，点个赞再走吧~","link":"/kewenlu2023/posts/a995a590/"},{"title":"2023：一周速览，16","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 一周速览为每周日晚固定栏目，将会回顾本周的热点事件。文末“阅读原文”可以直接跳转到相应新闻。 本周发布回顾 玩大了！篮协公布对“上海久事队”“苏州肯帝亚队”的处罚决定 图灵奖：约翰·麦卡锡（1971） 逛Quora：传奇毒枭刘招华 SpaceX星舰发射失败 荐歌：日落大道（梁博） 体育：中超主场，燃情回归 热点事件 文末“阅读原文”可以直接跳转到相应新闻。选自搜狐。 广州驾车撞人致5死司机被判死刑 旅泰大熊猫林惠死亡 曾鼻部出血 今年年中 印度将成人口第一大国 山科大北门发生伤人事件致1死6伤 郑渊洁：过去21年维权像”吃苍蝇” 宝马mini就冰淇淋事件道歉 SpaceX：星舰系工作人员主动引爆 德将结束在北约两国部署”爱国者” 武契奇：我们永远不会加入北约 常熟市用数字人民币发公务员工资 长峰医院火灾事故：在院治疗39人 蔚来员工曝加班500小时进急诊3次 拜登：美政府人员已撤出苏丹首都 福建舰动向公布 三航母时代将近 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~~ 至少，点个赞再走吧~","link":"/kewenlu2023/posts/309cf42a/"},{"title":"2023：一周速览，17","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 一周速览为每周日晚固定栏目，将会回顾本周的热点事件。2023：一周速览，17 本周发布回顾 航天：中国首次火星探测火星全球影像图发布 图灵奖：艾兹赫尔·韦伯·迪杰斯特拉（1971） 逛知乎：公司来了一位“卷王”后 生活：政通人和——淄博烧烤的必杀技 荐歌：未接来电（杨乃文） 闲聊：什么是内卷？ 热点事件 文末“阅读原文”可以直接跳转到相应新闻。选自搜狐。 首例单身女性冻卵案二审将开庭! 前交通局长孙女炫富事件最新进展 400亿杉杉夺权战:继母儿子或和解 中方将派特别代表赴乌等国访问 27日起三天北方地区多沙尘天气 杭州市委原书记周江勇受审 25家美军火商将于5月初窜访台湾 俄杜马最富有议员之一突然去世 知情人否认王思聪打人赔偿209万 上海久事男篮：解除李春江职务 中国足协原副主席李毓毅被查；再添2人!足坛反腐已集齐首发11人 中疾控:全国超8成人口感染过新冠 酒泉车祸致7死 两涉事司机被控制 美国”华盛顿”号航母将部署到日本 淄博烧烤1对1速成学艺收费3500元 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~~ 至少，点个赞再走吧~","link":"/kewenlu2023/posts/479bc4bc/"},{"title":"2023：一周速览，18","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 一周速览为每周日晚固定栏目，将会回顾本周的热点事件。 本周发布回顾 体育：机会是留给有准备的人的，丁立人终加冕国际象棋男子世界冠军！ 图灵奖：查尔斯·巴赫曼（1973） 逛知乎：第一代移民的烦恼 GNN：抽象数据类型，图（1） 荐歌：蜀道难（张杰） 闲聊：公司组织出省游 热点事件 文末“阅读原文”可以直接跳转到相应新闻。选自搜狐。 IBM将用AI取代7800个工作岗位 曝美要求中赴美航班不得过俄领空 聊城化工厂爆炸已致9死1伤1失联 西安一景区直升机坠落 3人死亡 韩日首脑将在首尔会面 中国驻南联盟大使馆被炸24周年 泽连斯基：乌克兰将很快发动反攻 张文宏：新冠大流行已经过去 苏丹冲突方首次在沙特讨论停火 男子在火车上被陌生人持刀杀害 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~~ 至少，点个赞再走吧~","link":"/kewenlu2023/posts/d724d92d/"},{"title":"2023：一周速览，2","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 一周速览为每周日晚固定栏目，将会回顾本周的热点事件。文末“阅读原文”可以直接跳转到相应新闻。 本周发布回顾 Python：map，reduce，filter 省馆之宝：内蒙古，草原宝藏 逛知乎：是不是腾讯内部的贪腐比国企还严重？ MLIR：新建一个Dialect（十），CMakeLists.txt 荐歌：富婆KTV（小何何） 热点事件 文末“阅读原文”可以直接跳转到相应新闻。 河南四家村镇银行新进展：启动50万元以上客户预约办理！ 济南：新生二孩三孩3岁前，每月补贴600元 新冠口服药莫诺拉韦今天上市销售，首发报价1500元/瓶 李铁案最新进展！中超深圳队总经理丁勇被带走，已有3人被查 美媒：美国所有航班都已停飞 缅北频发涉中国公民绑架和杀人案 媒体证实上海打人者王某某系王思聪，因有人拍照，引争执围殴至伤 江歌案”被告刘鑫已成被执行人 家乐福被传将破产，购物卡结算受限，引发多地消费者紧急扫货，最新回应来了 扬州副局长戴璐事件后续，淮安副市长韦峰因生活作风问题被免职 22岁女生从学校宿舍上铺坠亡，家属质疑是这个原因…当地教育厅回应 突发！乌克兰一公寓楼遭袭已12人死亡，乌媒称该国多地遭大规模导弹袭击 近期在院新冠相关死亡病例59938例？解读一下数据，你就懂了 致5死13伤！广州天河“1·11”驾车撞人案犯罪嫌疑人被批捕 突发！尼泊尔一架载有72人的ATR72客机在博卡拉地区附近坠毁 全球首架C919国产大飞机首达青岛 都看到这儿了，不如关注每日推送的“科文路”、互动起来~~ 至少，点个赞再走吧~","link":"/kewenlu2023/posts/6fe5ae8b/"},{"title":"2023：一周速览，20","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 一周速览为每周日晚固定栏目，将会回顾本周的热点事件。 本周发布回顾 辽宁队成功卫冕CBA总冠军 图灵奖：艾伦·纽厄尔（1975） 逛知乎：关于杰青的几则八卦 2026年美加墨世界杯会徽发布 荐歌：晚安（麻园诗人） 中超：走进球场看场球吧！ 热点事件 选自搜狐。 结束连续减持 中国3月增持美债 今日起，中亚四国总统访华 青年失业问题仍严峻 统计局回应 英前首相特拉斯窜台 外交部回应 俄空袭乌弹药库引发3.4级地震 脱口秀演员李昊石被立案调查 杭州女童坠亡案宣判:保姆获刑1年 美国国会众议员将弹劾拜登 俄罗斯总理米舒斯京将访华 官方：全国足球领域开展教育整顿 厦航通报飞行员女厕偷拍：开除 男生继承5亿房产 结婚2小时坠亡 南海发现古代沉船 文物超十万件 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~~ 至少，点个赞再走吧~","link":"/kewenlu2023/posts/f2d202dc/"},{"title":"2023：一周速览，19","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 一周速览为每周日晚固定栏目，将会回顾本周的热点事件 本周发布回顾 科技：哪些工作可能被 AI 取代？ 图灵奖：唐纳德·尔文·克努斯（高德纳，1974） 荐歌：稻香（周杰伦），缅怀512 闲聊：AI讲笑话 热点事件 选自搜狐。 东京一车站爆炸 中国男子被捕 曝李铁将被转送看守所 联合国1.7万吨粮食在苏丹遭抢劫 法国总统23年来首次国事访问德国 英国历史上任期最短首相将窜台 承重墙被砸 有住户暂停还房贷 杨澜晒护照否认移民 波兰称重新命名俄飞地加里宁格勒 中国与厄瓜多尔签署自由贸易协定 汶川地震15周年 致敬重生的力量 霍华德为“台独”言论道歉 德国将向乌克兰提供最大规模援助 英媒曝美欧将在多领域针对中国 大学生掏鸟被判十年半 即将出狱 男子无证酒驾撞人抛尸 获刑6年半 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~~ 至少，点个赞再走吧~","link":"/kewenlu2023/posts/a023e9bb/"},{"title":"2023：一周速览，21","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 一周速览为每周日晚固定栏目，将会回顾本周的热点事件。 【国产大飞机C919商业首航成功】今天坐在国产大飞机C919第一排的，从左到右分别是中国民用航空局局长宋志勇、中国商飞董事长贺东风、东方航空集团有限公司总经理李养民以及工业和信息化部党组书记、部长金壮龙。坐在第二排中部的是两位为国产大飞机C919倾注了心力的院士：C919总设计师、中国商飞首席科学家吴光辉院士和航空系统工程及信号处理专家张彦仲院士。 本周发布回顾 科技：微信“刷掌支付”来了！ 看球去了！ 逛Quora：从特斯拉建厂看为什么埃隆·马斯克对中国如此友好？ AI基础（1）：Gradient, Jacobian matrix and Hessian matrix 荐歌：Letting go（汪苏泷，吉克隽逸） 幽默：“你要爪子”，四川球市流行语教学 热点事件 选自搜狐。 今年退休人员基本养老金上调3.8% 世卫拒绝“邀台湾参会”提案 “北溪”爆炸新线索指向乌克兰军方 乌军一侦查小组攻入俄罗斯境内 TikTok对美国蒙大拿州提起诉讼 男孩失联后死亡:嫌犯系生母和继父 白宫：将重新安排布林肯访华 四川中学生打架致1死 多部门介入 大学生掏鸟案当事人已出狱回家 表兄妹结婚10年 法院判婚姻无效 巴西总统：已拒绝普京的访俄邀请 武契奇辞任后 武切维奇当选！ 丫丫离开上海动物园 启程回京 波音空客发文祝C919首次成功商飞 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~~ 至少，点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu2023/posts/85d5324a/"},{"title":"2023：一周速览，22","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 一周速览为每周日晚固定栏目，将会回顾本周的热点事件。 本周发布回顾 Hi：一图认识C919 图灵奖：赫伯特·西蒙（司马贺，1975） 逛知乎：程序员再就业，书法老师 六一儿童节快乐，愿爱无忧！ 荐歌：邻家的龙猫（久石让，《龙猫》） 多一点爱吧 热点事件 选自搜狐。 中方:日方不得擅自启动核污水排海 俄外交部就莫斯科遭袭发表声明 吴谢宇弑母案二审公开宣判：维持死刑 航天员”会师”!神舟十六入驻”天宫” 朝鲜卫星发射失败 金与正发声 马斯克结束访华 特斯拉股价持续走高 两高校就”学术妲己”事件启动调查 孕妇泰国坠崖案：丈夫被判33年 洪都拉斯总统宣布任命首任驻华大使 加媒声称中国军舰横切逼美舰改道 神舟十五号航天员乘组平安抵京 四川乐山山体塌方 14人遇难5人失联 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~~ 至少，点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu2023/posts/1cdc63f0/"},{"title":"2023：一周速览，23","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 一周速览为每周日晚固定栏目，将会回顾本周的热点事件。 本周发布回顾 暌违大半年，苹果又要开发布会 图灵奖：迈克尔·奥瑟·拉宾（1976） 2023全国各地高考作文汇总 明天，你好 武夷山玉女峰 3:00，欧冠决赛 热点事件 选自搜狐。 中美外交官员在北京举行会谈 福岛核污染水排海隧道开始注入海水 首艘国产大邮轮成功出坞 丫丫最新视频曝光:抓起竹子就开啃 高考开启!1291万考生奔赴考场 一箭26星！力箭一号刷新纪录 复旦一学生嫖娼被开除后起诉学校 定期存款利率告别“3时代” “领导牵手门”同款裙一夜销量4000+ 篮协：恢复新疆队注册新运动员资格 翟欣欣涉嫌敲诈勒索已被逮捕 彻查”鼠头鸭脖” 江西成立调查组 美官员：乌军在反攻中遭遇重大伤亡 洪都拉斯总统抵达北京 珠峰被救女子所雇公司发文感谢救援者 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~~ 至少，点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu2023/posts/6bdb5366/"},{"title":"2023：一周速览，26","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。2023：一周速览，26 一周速览为每周日晚固定栏目，将会回顾本周的热点事件。 中国女篮时隔12年再夺亚洲杯冠军！！！ 本周发布回顾 图说：2023 各省高考本科录取分数线 图灵奖：罗伯特·弗洛伊德（1978） 尬聊：看了香港明星队的球赛 尬聊：记录，成都蓉城队中超跨赛季连续27场不败 荐歌：一生何求（陈百强） 尬聊：飒！吴艳妮百米跨栏强势夺冠 热点事件 选自搜狐。 德计划在立陶宛永久驻扎4000名士兵 律所称不再招聘川大毕业生 川大回应 俄罗斯军舰深夜现身台东部海域 曝李铁被正式逮捕 移送看守所 网民称被民警强奸 扬州成立调查组 美将重返教科文组织 中方投反对票 “北极鲶鱼”炫富事件核查近百日仍无结果 解放军回呛台军”驱离”：别瞎吵吵 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~~ 至少，点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu2023/posts/1bb1a7e9/"},{"title":"2023：一周速览，27","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。2023：一周速览，27 一周速览为每周日晚固定栏目，将会回顾本周的热点事件。 中国女篮时隔12年再夺亚洲杯冠军！！！ 本周发布回顾 27场中超不败金身被迫，雄起成都队！ 图灵奖：肯尼斯·艾佛森（1979） 突发：歌手李玟轻生离世 尬聊：快递到了都不用通知了？ 足球：成都蓉城两连败 荐歌：想你的365天（李玟） 热点事件 选自搜狐。 “七七事变”86周年！勿忘国耻 巴以双方激烈交火致8死80伤 上半年A股人均赚3.9万 你赚了吗 伊朗正式加入上合组织 牵手门涉事领导被双开 女子被解聘 官方:被逼吃粪男孩家属已接受道歉 重庆万州洪涝致17人死亡 2人失踪 驻日美军承认东京地下水受污染 俄乌冲突500天 泽连斯基突访蛇岛 拜登：美国完全销毁化学武器库存 乌国防部承认袭击克里米亚大桥 私搭浮桥案审判长疑顶替他人上大学 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~~ 至少，点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu2023/posts/6cb6977f/"},{"title":"2023：一周速览，25","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 一周速览为每周日晚固定栏目，将会回顾本周的热点事件。 本周发布回顾 尬聊：局促的英文站牌 图灵奖：约翰·巴克斯（1977） 尬聊：近期足球场上的趣事 尬聊：端午节，到底快乐还是安康？ 尬聊：足球流氓几时休 图说：637分，北大！ 热点事件 选自搜狐。 学生花30万拍短片 因获奖低拒领奖 巴、蒙、新、越四国总理将访华 “房门被封堵”事件堵门邻居被指已离世 印度总理莫迪启程访美 “冲入球场拥抱梅西小伙”已获释 偷拍事件女生被”双留” 仍有两事待明确 第28届上海电视节白玉兰奖 瓦格纳领导人因号召武装叛乱被立案 乌克兰宣布从多方向发起反攻 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~~ 至少，点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu2023/posts/82b8f653/"},{"title":"2023：一周速览，28","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。2023：一周速览，28 一周速览为每周日晚固定栏目，将会回顾本周的热点事件。 本周发布回顾 尬聊：成都大运会买票 看球去了：成都蓉城乐山主场第一战 米兰·昆德拉去世：他不需要诺奖承认，他自己就是一部传奇 尬聊：苹果开启暑期教育优惠活动 荐歌：园游会（周杰伦） 看球去了：四川队流浪遂宁第一战 热点事件 选自搜狐。 将台湾列为国家？宝格丽中国致歉 男子杜撰”悬赏千万寻狗”被拘15日 黄子佼涉多罪被立案调查 苏丹冲突已致超315万人流离失所 G7将宣布对乌克兰的长期安全承诺 69平公寓公摊37平 住建局回应 南宁”停车贵”事件多名官员被免职 多地烟草局：直系三代血脉不得应聘 尹锡悦突然造访乌克兰 银行副行长月收入几百 外出打工被辞 蔡徐坤新加坡演唱会粉丝应援 高校师生赴台交流 马英九设宴款待 男子找前妻复合未果打死对方 被刑拘 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~~ 至少，点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu2023/posts/fc098aee/"},{"title":"2023：一周速览，31","text":"一周速览为每周日晚固定栏目，将会回顾本周的热点事件。 文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。2023：一周速览，31 本周发布回顾 尬聊：每次和朋友说起过去的旅行 图灵奖：埃德加·弗兰克·科德（1981） 逛知乎：计算机专业就业谈 内马尔正式签约沙特，本人发声，一天工资300万！ 荐歌：出卖（那英，李荣浩） 看球去了：格局打开了的球迷 热点事件 选自搜狐。 中国男篮热身赛不敌塞尔维亚 恒大地产被证监会立案调查 碧桂园:公司债券兑付存在不确定性 美总统参选人：保卫台湾到2028年 女足队员质疑国家队选人标准 好声音节目组：与李玟误会已消除 白宫：拜登愿无条件会晤金正恩 国台办：支持中止ECFA对台关税优惠 朝鲜紧急出动战机应对美侦察机侵犯 征兵难?乌敦促适龄公民”克服恐惧” 张伟丽卫冕UFC女子草量级金腰带 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~~ 至少，点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu2023/posts/9cce030b/"},{"title":"2023：一周速览，29","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。2023：一周速览，29 一周速览为每周日晚固定栏目，将会回顾本周的热点事件。 本周发布回顾 尬聊：尊重别人的成就感 大运会：明天下午新一轮售票 逛知乎：科研的本质就是一堆人炒概念？ 女足世界杯：赛程表 荐歌：曾经的你（许巍） 足球：女足世界杯首战 热点事件 选自搜狐。 中国恒大披露年报:总负债超2.4万亿 14家武汉球迷会发布致体总公开信 上访者儿子杀害矿企综治人员被判死刑 俄退出黑海协议 农产品价格飙升 北京广告协会删除蔡徐坤风险提示 普京将以视频方式参加金砖峰会 15省份上半年GDP出炉 伊拉克宣布驱逐瑞典驻伊大使 乌1/3地区布满地雷和集束炸弹 克里米亚大桥的汽车通行已恢复 首秀失利 中国女足遭丹麦绝杀 华人第一神探李昌钰被指伪造证据 日本今起实施尖端半导体出口管制 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~~ 至少，点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu2023/posts/8b0eba78/"},{"title":"2023：一周速览，36","text":"一周速览为每周日晚固定栏目，将会回顾本周的热点事件。 文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。2023：一周速览，36 本周发布回顾 看球去了：带大家沉浸式体验女足谢场 逛知乎：研究生导师讨厌什么样的学生？ 贝叶斯：起步（1） 荐歌：河流（川川） 看球去了：输球是什么感觉 热点事件 选自搜狐。 中超公司董事长刘军被带走调查 东莞派出工作组调查”趴桌睡”收费 官方：降低存量首套住房贷款利率 多家商业银行再度下调存款挂牌利率 美首度对台军事融资 提供8千万美元 男篮世界杯中国首胜 王哲林遭雪藏 多家卫视官博删除宋祖儿相关内容 鲁山牛郎织女雕塑被拆？官方辟谣 苏丹官员:冲突已致约1.5万平民死伤 时隔十年 高校学费迎来普涨 俄顶尖火箭科学家中毒身亡 四川路桥2名高管被采取强制措施 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~~ 至少，点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu2023/posts/2aa96a8/"},{"title":"2023：一周速览，37","text":"一周速览为每周日晚固定栏目，将会回顾本周的热点事件。 文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。2023：一周速览，37 本周发布回顾 看球去了：国足比赛，真的很无聊 图灵奖：丹尼斯·里奇（1983） 看球去了：母亲，球员的第一个球迷 贝叶斯：起步（3） 荐歌：后会无期（邓紫棋） 尬聊：出差去了趟上海 热点事件 选自搜狐。 白宫：拜登儿子若被定罪不会赦免他 袁冰妍偷逃税被追缴并罚款297万 社交账号已被禁言 克里米亚拟出售泽连斯基夫妇住宅 医院院长自曝贪腐细节：买8车7房 英国正式将瓦格纳集团列为恐怖组织 盒饭标15元高铁卖35 餐服员被停职 俄外交部宣布驱逐两名美国外交官 天津公交拖欠工资 刚补发两个月 男童撑伞从26楼跳下后生还 央行宣布降准0.25个百分点 中科院博士讲述缅甸遭遇:因高薪被骗 摩洛哥地震遇难人数升至2862人 中央:鼓励台胞申领台湾居民居住证 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~~ 至少，点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu2023/posts/75ada63e/"},{"title":"2023：一周速览，38","text":"一周速览为每周日晚固定栏目，将会回顾本周的热点事件。 文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。2023：一周速览，38 本周发布回顾 图灵奖：肯·汤普逊（1983） 逛知乎：同样人口众多，为什么中国比印度发达？ 贝叶斯：起步（4/4），三人成虎吗？（附代码） 荐歌：星空（五月天） 尬聊：杭州亚运会开幕 热点事件 选自搜狐。 事业编考生举报第一名后被取消成绩 电子院辟谣国产光刻机厂落地雄安 中国好声音制作方起诉李玟经纪公司 广东茂名71条出逃鳄鱼已全部捕获 金正恩归来 朝鲜卡脖子难题破解了? 亚运会中国男足5-1大胜印度 利比亚洪灾已致3351人遇难 谭修义蒙冤29年获787万国家赔偿 花西子母公司高薪招公关又下架岗位 李昌钰被控伪造证据案达成和解 四川山洪致4死48失联 多人被查 拜登会见泽连斯基 宣布新军援 贪官8年间向女儿转移现金近2000万 台军宣称监控福建地面部队 万亿预制菜 暂缓进校园 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~~ 至少，点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu2023/posts/e512bbaf/"},{"title":"2023：一周速览，39","text":"一周速览为每周日晚固定栏目，将会回顾本周的热点事件。 文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。2023：一周速览，39 本周发布回顾 吃瓜：翻墙访问国际互联网打工，收入被没收 图灵奖：尼克劳斯·维尔特（1984） 逛Quora：如何识别房间里真正左右局面的人？ 尬聊：都在赶路吧！ 荐歌：但愿人长久（邓丽君、王菲） 尬聊：惊闻亚运乒乓女双止步4强 热点事件 选自搜狐。 中国足协原主席陈戌源被提起公诉 俄防长：9月共消灭超1.7万乌军 拜登成美首位站到罢工前线的总统 国足1-0卡塔尔 17年后再进亚运八强 刚刚输给韩国，止步八强 朝鲜将核武力政策写入宪法 C919单笔最大订单落地 再卖100架 柯洁不敌许皓鋐 获亚运会围棋银牌 恒大：许家印被依法采取强制措施 普京：乌公民可免签证出入俄罗斯 爆冷！孙颖莎王曼昱不敌日本组合 伊拉克婚礼火灾致114死 新郎新娘幸存 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~~ 至少，点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu2023/posts/92158b39/"},{"title":"2023：一周速览，42","text":"一周速览为每周日晚固定栏目，将会回顾本周的热点事件。 文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。2023：一周速览，42 本周发布回顾 尬聊：开锁 看球去了：WCBA，韩旭李梦王思雨 看球去了：川足复兴 荐歌：干杯（五月天） 看球去了：四川小胜，离夺冠更近一步 热点事件 选自搜狐。 以色列首都爆发集会要求总理下台 宋凯当选新一届中国足协主席 美国：能同时支持以色列和乌克兰 俄罗斯总统普京抵达北京 朝鲜：不会放弃或改变拥核立场 前三季度中国GDP同比增长5.2% 威马汽车：公司创始人没有跑路 上海实行公积金认房不认贷 拉夫罗夫与朝鲜外务相举行会晤 碧桂园辟谣创始人父女已离境 学历歧视调查:第一学历成”污点” 韩国政府：愿无条件与朝鲜对话 猫肉充当猪羊肉 警方截获千余只猫 中国足协去年总负债12亿 被咬女童获捐200万:金额系家属自估 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~~ 至少，点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu2023/posts/4a86c476/"},{"title":"2023：一周速览，43","text":"一周速览为每周日晚固定栏目，将会回顾本周的热点事件。 文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。2023：一周速览，43 本周发布回顾 看球去了：四川真的夺冠了 图灵奖：理查德·卡普（1985） 尬聊：球友也会在赛季结束分别 太空会师，神舟十七号三名航天员进入中国空间站 中共中央 全国人大常委会 国务院 全国政协讣告 李克强同志逝世 尬聊：吐槽下有的城市设计师 热点事件 选自搜狐。 神十六神十七乘组完成在轨交接 李克强同志逝世 美国总统拜登会见王毅 日本:9月对华水产品出口额减少99% 乌飞行员在美接受F-16战机训练 知名疾控专家吴尊友因胰腺癌去世 日本GDP将跌至全球第四 埃尔多安签署瑞典加入北约议定书 居民医保一年减少2500万人 2023胡润百富榜：钟睒睒再成首富 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~~ 至少，点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu2023/posts/3d81f4e0/"},{"title":"2023：一周速览，45","text":"一周速览为每周日晚固定栏目，将会回顾本周的热点事件。 文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。2023：一周速览，45 本周发布回顾 沉浸式体验四川九牛散客看台 2023 赛季最后一分钟 图灵奖：约翰·霍普克洛夫特（1986） 看球去了：四川九牛看台上的协会们 LLM：大语言模型简介 荐歌：Yellow（Coldplay） 尬聊：消费降级了吗？ 热点事件 选自搜狐。 泽连斯基邀特朗普访乌 寻求更多援助 医院院长倒卖出生证明每张赚6万 与女主播发生关系寺庙住持被停职 美国室温超导论文被《Nature》撤稿 林瑞阳、张庭夫妇复出直播被封 中信银行原行长孙德顺受贿9亿获死缓 坍塌体育馆系干部开发 弟弟疑涉黑 习近平将赴美国举行中美元首会晤 菲律宾发现6具遗体 疑为被绑中国公民 受缅北冲突影响 云南边境学校仍停课 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~~ 至少，点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu2023/posts/d4e251d5/"},{"title":"2023：一周速览，46","text":"一周速览为每周日晚固定栏目，将会回顾本周的热点事件。 文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。2023：一周速览，46 本周发布回顾 尬聊：四川入冬的速度 图灵奖：罗伯特·塔扬（1986） 图说：当黑人学生第一次走进大学课堂 世界杯：开门红，中国男足拿下亚预赛首胜 荐歌：你要跳舞吗（新裤子乐队） 看球去了：四川省业余足球联赛 热点事件 选自搜狐。 胡润:中国千万净资产家庭达211万户 叶剑英元帅夫人吴博去世 享年106岁 研三学生留遗书控诉导师后轻生 马航MH370事件11月27日开庭 国足2-1逆转泰国 世预赛迎开门红 高管遭自媒体侮辱诽谤 格力报案 泽连斯基:乌方已夺取黑海主动权 APEC会议结束时 拜登总统与习主席话别 马斯克SpaceX星舰发射失败 青岛官宣：租房即可落户 人口第一大县50所幼儿园终止办学 马尔代夫正式要求印度撤军 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~~ 至少，点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu2023/posts/4deb006f/"},{"title":"2023：一周速览，47","text":"一周速览为每周日晚固定栏目，将会回顾本周的热点事件。 文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。2023：一周速览，47 本周发布回顾 尬聊：洁牙 图灵奖：约翰·科克（1987） 图说：关于上一个时代的一些照片印记 LLM：拥抱新技术 荐歌：你不要担心（《请回答1988》主题曲，全仁权） 他山之石：我是如何成为一名机器学习从业者的（OpenAI 联合创始人，Greg Brockman） 热点事件 选自搜狐。 台湾选举开始候选人登记 郭台铭退出台湾地区领导人选举 中国男足0比3不敌韩国队 假僧人以“双修”为名诱奸14名女性 泽连斯基称经历过至少五六次暗杀 张小泉刷好评应对”拍蒜断刀”被罚 英国回应阿当选总统誓言夺回马岛 考研报名人数自2015年来首次下降 李思思离开央视后40天主持3场商演 广东一企业用水枪驱赶讨薪工人 31省10月CPI出炉：20地物价下降 曼谷现多名中国乞讨者 或涉人口买卖 吴亦凡被驱逐之日起十年内不准入境 斗鱼陈少杰被捕后多位大主播已停播 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~~ 至少，点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu2023/posts/3aec30f9/"},{"title":"2023：一周速览，48","text":"一周速览为每周日晚固定栏目，将会回顾本周的热点事件。 文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。2023：一周速览，48 本周发布回顾 注意防护，大流感来啦！ 图灵奖：伊凡·苏泽兰（1988） 图说：有哪些“命运不公”的例子？ 美国前国务卿基辛格去世 荐歌：如果可以（韦礼安） 看球去了：四川女足降级 热点事件 选自搜狐。 乌克兰情报总局局长夫人遭投毒 王思聪一身休闲装与泰安市委书记座谈 雷军个人向武汉大学捐赠13亿元现金 北约承认：乌克兰对俄反攻失败 基辛格去世 享年100岁 普京：德国没有主权 柬埔寨华人蛇头夫妻在中国落网 辽篮前主帅杨鸣婚变 医生男友下药致女友流产 被行拘停职 国家卫健委：目前未发现新发传染病 美国航母赴日本海域搜寻坠海人员 美国已向以色列提供100枚钻地弹 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~~ 至少，点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu2023/posts/aa532d68/"},{"title":"2023：一周速览，49","text":"一周速览为每周日晚固定栏目，将会回顾本周的热点事件。 文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 本周发布回顾 图灵奖：威廉·卡韩（1989） 尬聊：89岁女司机中国游 Gemini：我们规模最大、能力最强的 AI 模型 荐歌：纯真（五月天） 电影：长安三万里 热点事件 选自搜狐。 成都警方：咬伤女童恶犬主人将被起诉 美国宣布制裁一批以色列人 俄外长被曝将苹果手机换成华为 足协大改革 职能部门精简至13个 反对泽连斯基的乌前议员被杀 俄罗斯2024年3月17日举行总统选举 多名俄官员支持普京竞选连任 五月天巴黎演唱会被指走调破音 东航接收第三架C919大型客机 委内瑞拉与圭亚那争端升级 军队戒备 10名缅北电诈头目被公开通缉 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~~ 至少，点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu2023/posts/dd541dfe/"},{"title":"2023：一周速览，50","text":"一周速览为每周日晚固定栏目，将会回顾本周的热点事件。 文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。2023：一周速览，50 本周发布回顾 国家疾控局：这些场景下应该戴口罩 图灵奖：费南多·柯巴托（1990） 趣闻：小国寡民，列支敦士登 尬聊：微软开搞核反应堆 荐歌：MC來了（MCHotDog热狗） 痛悼！中国AI领军人物、商汤科技创始人汤晓鸥睡梦中离世，享年55岁 热点事件 选自搜狐。 中越双方宣布两党两国关系新定位 碧桂园董事降薪：从300万降到12万 阿根廷官方汇率一次性贬值54% 南京大屠杀死难者国家公祭日 缅甸取代阿富汗成最大鸦片生产国 美众议院决定对拜登展开弹劾调查 遭董明珠怒斥 孟羽童回应 鼠头鸭脖涉事方及责任人被罚706万 C919进入维多利亚港上空进行飞行演示 普京将以独立候选人身份竞选总统 日本2024年度防卫费预算再创新高 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~~ 至少，点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu2023/posts/bd93941b/"},{"title":"2023：一周速览，51","text":"一周速览为每周日晚固定栏目，将会回顾本周的热点事件。 文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。2023：一周速览，51 本周发布回顾 看球去了：四川九牛大动荡 图灵奖：罗宾·米尔纳（1991） 图说：早期照片（二） 再见，2023：豆瓣年度读书榜单 荐歌：冬天快乐（李宇春） 尬聊：不怎么热闹的冬至 热点事件 选自搜狐。 俄防长：已消灭5800多名外国雇佣兵 三大指数均下跌 2900点保卫战打响 王毅:中菲关系已站在十字路口 沉寂半年 笑果脱口秀演员线下开演 官方中止对台部分产品关税减让 北大天才柳智宇还俗后宣布结婚 海关总署:恢复台湾地区石斑鱼输入 多家银行存款挂牌利率正式下调 孙杨或彻底无缘巴黎奥运会 确诊超2万 马来西亚重启新冠隔离 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~~ 至少，点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu2023/posts/ca94a48d/"},{"title":"2023：一周速览，6","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 一周速览为每周日晚固定栏目，将会回顾本周的热点事件。文末“阅读原文”可以直接跳转到相应新闻。 本周发布回顾 荐影：看了《流浪地球2》，震撼 省馆之宝：西藏，世界屋脊 逛知乎：我在体制内（二） C++：traits，分类型处理 荐歌：泪桥（伍佰） 生活：开学啦！ 热点事件 文末“阅读原文”可以直接跳转到相应新闻。 重磅！俄方最新发声：准备好与乌克兰无条件谈判！谈及“结束军事行动”… 女犯获刑十年却未入狱 黑幕曝光 人民热评：吸毒毁所有！《狂飙》演员曾涉毒给人警示 国际晚报丨20名叙囚犯趁强震越狱 男孩考18分被父亲刺死 获刑12年 土耳其震后难民洗劫超市 抗议养老金改革 法国再掀大罢工 蔡英文:愿和大陆对话 国台办回应 武汉官方将房地产归为困难行业 现场画面！朝鲜夜间阅兵纪念建军75周年，多种新型武器亮相 中方不接受美方中美防长通话提议 王沪宁会见国民党副主席夏立言 利率倒挂 经营贷置换房贷暗涌 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~~ 至少，点个赞再走吧~","link":"/kewenlu2023/posts/68886a92/"},{"title":"2023：一周速览，7","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 一周速览为每周日晚固定栏目，将会回顾本周的热点事件。文末“阅读原文”可以直接跳转到相应新闻。 本周发布回顾 老外：美国春晚——超级碗 省馆之宝：广东，不辞长作岭南人 逛知乎：我在体制内（三） LLVM：测试基础（一），llvm-lit、FileCheck 荐歌：又到天黑（告五人） 闲聊：少不读水浒？看看浙江省教育厅教研室怎么说 热点事件 文末“阅读原文”可以直接跳转到相应新闻。 “酿酒大师”岳国君院士被查 江西2民警1辅警查酒驾被刺伤致死 乌克兰延长战时状态至5月 朝鲜宣布发射洲际弹道导弹 大理12岁失联双胞胎兄弟身亡 “百岁贷”出圈引质疑：真利好还是玩“噱头”？ 波兰防长：波兰无法向乌克兰提供战机 中朝边境已开放卡车货物运输 韩国公民赴华短期签证恢复签发 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~~ 至少，点个赞再走吧~","link":"/kewenlu2023/posts/1f8f5a04/"},{"title":"2023：一周速览，8","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 一周速览为每周日晚固定栏目，将会回顾本周的热点事件。文末“阅读原文”可以直接跳转到相应新闻。 本周发布回顾 生活：见证历史，股票“注册制”正式实施 省馆之宝：合集 逛知乎：我在体制内（四） 闲聊：画一个“五彩斑斓的黑” 荐歌：情人（李荣浩，Beyond） 生活：看了《交换人生》，还行 热点事件 文末“阅读原文”可以直接跳转到相应新闻。 [多地参加婚检可获额外婚假”奖励”](https://finance.sina.com.cn/jjxw/2023-02-21/doc-imyhmnux5068831.shtml “多地参加婚检可获额外婚假”奖励””) 意总理访乌 将与泽连斯基会谈 俄罗斯要求美国从乌克兰撤军 普京：美国若核试验，我们也跟进 武契奇：坚持不制裁俄 中国足球协会召开中层干部会议 2022年防疫账本首披露:广东711亿 梁万年：我国本轮疫情已基本结束 但不是完全结束 俄乌冲突1周年 伤亡人数或超28万 扬科维奇任中国男足国家队主教练 香港名媛蔡天凤遭谋杀碎尸烹煮 伊拉克允许用人民币结算中国商品 朝鲜：若美继续挑衅或被视为宣战 [委员称大学生不要满脑子”央国政”](https://news.china.com/socialgd/10000169/20230225/44536752.html “委员称大学生不要满脑子”央国政””) ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~~ 至少，点个赞再走吧~","link":"/kewenlu2023/posts/5fbd0b5b/"},{"title":"2023：一周速览，9","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 一周速览为每周日晚固定栏目，将会回顾本周的热点事件。文末“阅读原文”可以直接跳转到相应新闻。 本周发布回顾 中共中央 国务院印发《数字中国建设整体布局规划》 图灵奖：简介 逛知乎：我在体制内（五） 生活：选专业？择业？这份名单很重要 荐歌：Love yourself（Justin Bieber） “央广”感动中国 2022 年度人物 热点事件 文末“阅读原文”可以直接跳转到相应新闻。 姚明回应新疆男篮退出CBA 武文赏当选新一任越南国家主席 网传镇江市税务局拖欠员工工资：404 盖茨：美无法阻止中国有强大芯片 成都一小区生活污水毒品浓度超标 美又对台军售 国防部:强烈不满 美国向乌再提供4亿美元军事援助 反对退休改革 法大规模罢工来袭 阿根廷重申和平解决马岛主权问题 今年政府工作报告有哪些特殊之处 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~~ 至少，点个赞再走吧~","link":"/kewenlu2023/posts/28ba3bcd/"},{"title":"AI基础（1）：Gradient,-Jacobian-matrix-and-Hessian-matrix","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转载须注明出处。 Gradient, Jacobian matrix and Hessian matrix这两周，扮演了几场面试官。最大的感触是，应届生在基础数学知识的储备上存在很大的问题。所以我决定把我认为重要的 AI 基础知识拿出来过一下。 用英文写的（水平一般），帮助各位了解下术语。 1 GradientThe gradient of $f$ is defined as the unique vector field whose dot product with any unit vector $\\mathbf{v}$at each point $x$ is the directional derivative of f$f$ along $\\mathbf{v}$. That is, $$\\big (\\nabla f(x){\\big )}\\cdot \\mathbf {v} =D_{\\mathbf {v} }f(x)$$ e.g. in coordinate system, 沿着 $i$ 方向的导数，就是 $i$ 轴方向的分量 $$\\nabla f = \\frac { \\partial f } { \\partial x _ { 1 } } e _ { 1 } + \\cdots + \\frac { \\partial f } { \\partial x _ { n } } e _ { n }$$ Attention: the relationship to derivation 2 Jacobian matrix 雅可比矩阵的重要性在于它体现了一个可微方程与给出点的最优线性逼近。 因此，雅可比矩阵类似于多元函数的导数。 The Jacobian of a vector-valued function in several variables generalizes the gradient of a scalar-valued function in several variables, which in turn generalizes the derivative of a scalar-valued function of a single variable. If $f$ is differentiable at a point $p$ in $\\mathbb{R}^n$, then its differential is represented by $J_f(p)$. In this case, the linear transformation represented by $J_f(p)$ is the best linear approximation of f near the point p, in the sense that $$f ( x ) - f ( p ) = J _ { f } ( p ) ( x - p ) + o ( | x - p | ) \\quad ( \\text { as } x \\rightarrow p )$$ This approximation specializes to the approximation of a scalar function of a single variable by its Taylor polynomial of degree one, namely $$f(x)-f(p)=f’(p)(x-p)+o(x-p)\\quad ({\\text{as }}x\\to p)$$ The Jacobian matrix represents the differential of $f$ at every point where $f$ is differentiable. $$\\mathbf {J} ={\\begin{bmatrix}{\\dfrac {\\partial \\mathbf {f} }{\\partial x_{1}}}&amp;\\cdots &amp;{\\dfrac {\\partial \\mathbf {f} }{\\partial x_{n}}}\\end{bmatrix}}={\\begin{bmatrix}{\\dfrac {\\partial f_{1}}{\\partial x_{1}}}&amp;\\cdots&amp;{\\dfrac {\\partial f_{1}}{\\partial x_{n}}}\\\\vdots &amp;\\ddots &amp;\\vdots \\ {\\dfrac {\\partial f_{m}}{\\partial x_{1}}}&amp;\\cdots &amp;{\\dfrac {\\partial f_{m}}{\\partial x_{n}}}\\end{bmatrix}}$$ 3 Hessian$$\\mathbf {H}(f(\\mathbf {x}))= \\mathbf {J}(\\nabla f(\\mathbf {x}))^T$$ $$\\mathbf {H} ={\\begin{bmatrix}{\\dfrac {\\partial ^{2}f}{\\partial x_{1}^{2}}}&amp;{\\dfrac {\\partial ^{2}f}{\\partial x_{1},\\partial x_{2}}}&amp;\\cdots &amp;{\\dfrac {\\partial ^{2}f}{\\partial x_{1},\\partial x_{n}}}\\{\\dfrac {\\partial ^{2}f}{\\partial x_{2},\\partial x_{1}}}&amp;{\\dfrac {\\partial ^{2}f}{\\partial x_{2}^{2}}}&amp;\\cdots&amp;{\\dfrac {\\partial ^{2}f}{\\partial x_{2},\\partial x_{n}}}\\\\vdots &amp;\\vdots &amp;\\ddots &amp;\\vdots \\{\\dfrac {\\partial ^{2}f}{\\partial x_{n},\\partial x_{1}}}&amp;{\\dfrac {\\partial ^{2}f}{\\partial x_{n},\\partial x_{2}}}&amp;\\cdots &amp;{\\dfrac {\\partial ^{2}f}{\\partial x_{n}^{2}}}\\end{bmatrix}}$$ 即在每一个变化方向（$\\nabla$）上做线性逼近（Jacobian），这可能可以体现变化程度？ ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 赞赏请前往公众号菜单栏~~ 至少点个赞再走吧~","link":"/kewenlu2023/posts/1a64cb5/"},{"title":"AI：图神经网络（GNN）系列文章预告","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 最近切换工作和业务中，有很多东西需要复习和学习，比较忙乱。这里说明一下周四的 AI 栏目有些拖更的地方： MLIR系列文章拖更 加紧抽空调代码中，预计还剩最后 2 期左右就可以更完 会在结束的时候重新整理整个系列文章，让读者无痛上手 MLIR 有读者反馈有的代码可能跑不通了 准备看了；主要是换了新公司，原来的电脑上交了，新环境的 LLVM 这些东西还没就绪 非常抱歉！ 好消息是 research 的工作占比又上来了。新公司对 AI 落地表示出了比较强烈的期望，所以会有更多的时间去做一些一直想做的方向。其中就包括我很看好的图神经网络（GNN）这一块儿。 所以应该在下下次的周四开始，“科文路”将会以手把手实践的方式、开启很有用但又有一点儿复杂的新领域的学习——GNN。 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~","link":"/kewenlu2023/posts/12aa6687/"},{"title":"GNN：抽象数据类型，图（1）","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转载须注明出处。 图神经网络（GNN）是用于处理可以表示为图的数据的一类人工神经网络。本文为图神经网络系列文章第 1 期，介绍作为抽象数据类型的图，怎么去“抽象”。 相信学过数据结构或者离散数学相关课程的朋友不会陌生“图”这个概念，今天一起来复习一下。 为了消除歧义，最好熟练记下英文术语。 图，基本概念 在计算机科学中，图是一种抽象数据类型（ADT，abstract data type），旨在实现数学里的图论领域中无向图和有向图的概念。 上面就是一个“抽象”的图，其中， 蓝色圆圈为 vertex（node，节点/顶点），简记为 $V$ 这里注意 vertex 的复数形式是 vertices 黑色连线为 edge（link，边） 如果带箭头，则为 directed（有向），如图，简记为 $E$ 不带箭头，则为 undirected（无向） 整幅图，简记为 $U$ 为 GNN 引入的概念，表示这幅图的整体信息 也就是说，图数据结构就是一组有限的顶点和边的集合。那 GNN 中的研究对象，一个图，就可以记作 $G(V,E,U)$。 怎么理解“抽象”这里注意，既然是抽象数据类型，那么图的组成部分携带的信息应该也是抽象出来的。也就是说，要从任务出发，用 $(V,E,U)$ 三个变量/集合，携带所有需要的信息。 简单举个建模的例子——用上面那张图来构建一次旅行规划的基础。 1. 任务我现在人在成都，正在考虑一个一日游，有两个方案可选， 去重庆玩一天返回 上午去宜宾，然后下午经重庆返回 2. 根据地图构建图打开地图，根据列车信息，构建了这样一个图， 三个节点分别表示地点 宜宾/重庆/成都 三条有向边，带信息 宜宾-&gt;重庆，车程 1 h 重庆-&gt;成都，车程 1 h 成都-&gt;重庆，车程 1 h 成都-&gt;宜宾，车程 1 h 整个图表示一个“一日游方案” 抽象成 $G(V,E,U)$，其中， $V={宜宾,重庆,成都}$ $E={E_1,E_2,E_3,E_4}$ $E_1 = 宜宾重庆:1$ … $U=”一日游方案”$ 3. 哪里抽象了?由于我的目的是根据在途时长信息制定行程，于是图上只有我想去的城市以及行程耗时。 这个地方有什么风景、中间会经过哪些站、谁将和我一起去、我在哪一天去等等这些与目的无关的信息通通都被去掉了。 最终剩下了一个只包含必要信息的数据结构，这即是“抽象”。 当然，这个“必要信息”就是“抽象”的过程。 4. 收益看这张图，平平无奇，却抽象出了我两个方案的所有信息以及其他一些可以直接推导的信息（由于这是我拍脑袋想出来的例子,有些信息有些无厘头）， 方案 1 总耗时 2h 方案 2 总耗时 3h 去了宜宾就得去重庆，因为没有回来的车 去了重庆就没有回宜宾的车 5. permutation invariant最重要的是，假定这张图已包含了所有的与旅程规划相关的信息，那么对这个图翻转/旋转/拉伸等等，都不会改变这些所包含的信息以及推出的信息。 抽象点讲就是，只要 $G(V,E,U)$ 的内容没有变，那他包含的那些信息不会因为图被画出来的样子改变。 这些信息通过“图”体现出一个非常重要的特性，permutation invariant，也叫置换不变性/排列不变性。这就是后面 GNN 的应用里，需要重点寻找的特征。 总结本期作为 GNN 系列文章的开篇，介绍了图抽象数据类型的概念，并且使用一个简单的例子说明了如何去抽象一个现实问题。 下一期将介绍如何使用代码表示这些信息。 参考 https://en.wikipedia.org/wiki/Graph_(abstract_data_type) ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~","link":"/kewenlu2023/posts/797d9d82/"},{"title":"C++：traits，分类型处理","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 traits 在 MLIR 体系中被大量使用。它的本意很晦涩，“萃取信息”，有点像是隐含的重要信息。 简单讲，C++ 中的 traits 概念指代一种编程方法，它抽象一种接口，使得这个接口针对不同类型的输入作分别处理。 技术本质上，traits 总被实现为一个类，插入接口和实现之间。 更多的，像 STL 中，就是用这些方法来实现了算法的类型无关的抽象。 下面一步步走近 traits。 1. template，推导参数类型先看代码， 12345678910111213template &lt;class I, class T&gt; void func_impl(I iter, T t) { T tmp; // 这里就是迭代器所指物的类型新建的对象 // ... 功能实现}template &lt;class I&gt; inline void func(I iter) { func_impl(iter, *iter); // 传入iter和iter所指的值，class自动推导}int main() { int i; func(&amp;i);} 这是一段迭代器相关的代码。 在上述代码中，func(&amp;i) 通过中间层 func_imp 自动推导出了 &amp;i 所指向的数据类型，也就是 T。 2. 偏特化，调整匹配顺序偏特化其实就是在 （全）特化 啥都能传进去的模板类上，加了一些限制。例如下面的 &lt;T *&gt; 就使得这个类比上面的那个更 “特别”，这么做就能在遇到相应参数时得到优先的匹配权。 1234567891011121314151617#include &lt;iostream&gt;template &lt;class T&gt; struct iterator_traits { typedef typename T::value_type value_type;};template &lt;class T&gt; struct iterator_traits&lt;T *&gt; { typedef T value_type; };template &lt;class I&gt; typename iterator_traits&lt;I&gt;::value_type func(I ite) { return *ite;}int main() { int a = 1; std::cout &lt;&lt; func(&amp;a) &lt;&lt; std::endl; return 0;} 从下往上看。 在 func 使用 I 时，I 将去匹配一个 iterator_traits。在这里，它将直接匹配到中间那个 &lt;T *&gt;，也就是偏特化的版本。 那么，当使用 func 函数的时候，传入的参数就得是 T *，否则报错。 所以最终得到的 value_type 是 T 而不是 I::value_type，这也就实现了文章开头所说的同样的接口，不同的处理。 3. 回过头来，一个例子下面这个例子体现了 traits 的作用。 1234567891011121314151617181920212223242526#include &lt;iostream&gt;#include &lt;vector&gt;template &lt;class T&gt; struct iterator_traits { typedef typename T::value_type value_type;};template &lt;class T&gt; struct iterator_traits&lt;T *&gt; { typedef T value_type; };void func(int a) { std::cout &lt;&lt; &quot;func(int) is called&quot; &lt;&lt; std::endl; }void func(double a) { std::cout &lt;&lt; &quot;func(double) is called&quot; &lt;&lt; std::endl; }void func(char a) { std::cout &lt;&lt; &quot;func(char) is called&quot; &lt;&lt; std::endl; }int main() { iterator_traits&lt;std::vector&lt;int&gt;::iterator&gt;::value_type a; func(a); // 输出 func(int) is called iterator_traits&lt;std::vector&lt;double&gt;::iterator&gt;::value_type b; func(b); // 输出 func(double) is called iterator_traits&lt;char *&gt;::value_type c; func(c); // 输出 func(char) is called return 0;} 好了，就是这样，虽然看似复杂，其实实现的逻辑也没有那么难，对吧？ 参考 C++ traits技术浅谈 - mangoyuan - 博客园 (cnblogs.com) 细说 C++ Traits Classes_haozlee的博客-CSDN博客 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~","link":"/kewenlu2023/posts/2b82b3c4/"},{"title":"LLVM：测试基础（一），llvm-lit、FileCheck","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 前期的 MLIR 系列文章中，没有介入测试工作。测试本身也是一个比较大的主题，这里希望用几篇文章讲明白如何利用 LLVM 的基础设施完成所编写代码的测试工作。 本文为第 1 期，将使用一个例子介绍如何使用 llvm-lit 和 FileCheck 这两个最常用的工具完成测试工作。 llvm-lit，LLVM Integrated Tester，通过 Python 语法编写配置文件，完成对某个项目的测试工作 FileCheck，一个比 grep 功能更多的文本查找与匹配验证工具，可以帮助程序员确认代码是否正确生成 这两个工具都可以通过 pip 安装，分别叫 lit 和 filecheck。如果使用了 pip 安装，下面的相关工具名请自行更改替换。 关于两个工具的更多使用细节请自行前往相关网站。 下面用一个小例子说明如何使用这两个工具， 文件结构123.|-- lit.cfg`-- main.c main.c首先编写一个待测试的文件， 12345678// RUN: cc %s -o %t &amp;&amp; %t | FileCheck %s// CHECK: Hello world#include &lt;stdio.h&gt;int main() { printf(&quot;Hello world\\n&quot;); return 0;} 在测试文件的顶部加入了待 llvm-lit 去驱动执行的标记以及待执行代码。 很简单，通过 cc 编译当前文件 %s 为一个临时文件 %t，然后执行这个 %t，最后通过 FileCheck 去和原文件中的 CHECK 标记的语句对比，看是否符合预期。 lit.cfg接下来编写配置文件， 123456import lit.formatsconfig.name = &quot;My example&quot;config.test_format = lit.formats.ShTest(True)config.suffixes = [&quot;.c&quot;] 这里也比较简单，就说明了测试项目的名称、类型、对应文件类型。 运行在这两个文件的所在目录，执行 123456❯ llvm-lit main.c-- Testing: 1 tests, 1 workers --PASS: My example :: main.c (1 of 1)Testing Time: 0.11s Passed: 1 可以看到，这一个测试用例通过了。 结语当然，这只是一个很简单的例子。但在更复杂的工程中，他们同样能发挥很好的作用。下期继续介绍如何在一个 cmake 项目中引入 LLVM 测试套件完成测试。 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~","link":"/kewenlu2023/posts/65410c85/"},{"title":"MLIR：新建一个Dialect（九），CMakeLists.txt","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 Multi-Level Intermediate Representation（MLIR）是创建可重用、可扩展编译器基础设施的新途径。本文为第 15 期，介绍 mlir-hello 是如何利用 cmake 来组织项目的。 转载请注明出处！ 关于如何编写新的 Dialect 的编码部分前期已经介绍完毕。 今天介绍一下mlir-hello项目的工程配置部分，本质上也就是文件结构和 cmake 项目文件的编写。 关于文件结构，在之前的文章MLIR：新建一个Dialect（一）已经介绍过了。 这里从编译指令出发，开始 cmake 项目构建之旅。完整的根目录 CMakeLists.txt 文件内容见最后一小节。 利用 LLVM 项目这里，mlir-hello 的编译指令为， 12345cmake -G Ninja .. \\ -DLLVM_DIR=${LLVM_BUILD_DIR}/lib/cmake/llvm \\ -DMLIR_DIR=${MLIR_BUILD_DIR}/lib/cmake/mlir \\ -DCMAKE_C_COMPILER=${CLANG} \\ -DCMAKE_CXX_COMPILER=${CLANGXX} 从之前编写的 C++ 头文件可以看出，MLIR 相关项目将不可避免的用到 LLVM(MLIR) 基础设施，也就会引入相关 .cmake 文件。 由于这个项目会用到编译 LLVM(MLIR) 项目产出的 1234include(TableGen) # TableGen.cmakeinclude(AddLLVM) # AddLLVM.cmakeinclude(AddMLIR) # AddMLIR.cmakeinclude(HandleLLVMOptions) # HandleLLVMOptions.cmake 可以看到，有两项关键的参数指向目录，这两个目录要分别包含 MLIRConfig.cmake 和 LLVMConfig.cmake 文件， 1find_package(MLIR REQUIRED CONFIG) # MLIRConfig.cmake 在MLIRConfig.cmake中又要用到， 1find_package(LLVM REQUIRED CONFIG) # LLVMConfig.cmake 另外，要符合这个项目的需要， LLVM_BUILD_DIR，它对应编译 LLVM build 目录下的 lib/cmake/llvm TableGen.cmake AddLLVM.cmake HandleLLVMOptions.cmake MLIR_BUILD_DIR，它对应编译 LLVM build 目录下的 lib/cmake/mlir AddMLIR.cmake 文件组织接下来，将引入本项目编译时需要使用的头文件、库文件等等。 12345678include_directories(${LLVM_INCLUDE_DIRS})include_directories(${MLIR_INCLUDE_DIRS})include_directories(${PROJECT_SOURCE_DIR}/include)include_directories(${PROJECT_BINARY_DIR}/include)link_directories(${LLVM_BUILD_LIBRARY_DIR})add_definitions(${LLVM_DEFINITIONS}) 首先 include_directories 引入了 LLVM 基础设施中的头文件。 然后引入了 2 个本地 include 目录中的头文件， PROJECT_SOURCE_DIR 对应 cmake .. 后面的 .. 这个目录，在这里就是根目录 PROJECT_BINARY_DIR 对应使用 cmake 的这个目录，这里是 mlir-hello/build link_directories 引入第三方库所在路径。这里是通过前面的 find 操作下的 .cmake 引入的。 最后通过 add_definitions 引入 LLVM 预设的一些配置项。 引入已分解的子项目组成项目文件的最后，引入了 4 个子目录，这 4 个目录下又都用一个 CMakeLists.txt 重新组织。 1234add_subdirectory(include)add_subdirectory(lib)add_subdirectory(test)add_subdirectory(hello-opt) 这么做是为了更好的分层组织项目，实现解耦。 小结mlir-hello 通过 cmake 组织项目。本文介绍了根目录下的 CMakeLists.txt，以及它如何串联 LLVM 基础设施和本地项目文件。下期将进一步介绍这些子目录的组织。 根目录 CMakeLists.txt12345678910111213141516171819202122232425262728293031323334353637383940414243444546cmake_minimum_required(VERSION 3.13.4)if(POLICY CMP0068) cmake_policy(SET CMP0068 NEW) set(CMAKE_BUILD_WITH_INSTALL_NAME_DIR ON)endif()if(POLICY CMP0075) cmake_policy(SET CMP0075 NEW)endif()if(POLICY CMP0077) cmake_policy(SET CMP0077 NEW)endif()project(mlir-hello LANGUAGES CXX C)set(CMAKE_CXX_STANDARD 17 CACHE STRING &quot;C++ standard to conform to&quot;)find_package(MLIR REQUIRED CONFIG)message(STATUS &quot;Using MLIRConfig.cmake in: ${MLIR_DIR}&quot;)message(STATUS &quot;Using LLVMConfig.cmake in: ${LLVM_DIR}&quot;)set(LLVM_RUNTIME_OUTPUT_INTDIR ${CMAKE_BINARY_DIR}/bin)set(LLVM_LIBRARY_OUTPUT_INTDIR ${CMAKE_BINARY_DIR}/lib)set(MLIR_BINARY_DIR ${CMAKE_BINARY_DIR})list(APPEND CMAKE_MODULE_PATH &quot;${MLIR_CMAKE_DIR}&quot;)list(APPEND CMAKE_MODULE_PATH &quot;${LLVM_CMAKE_DIR}&quot;)include(TableGen)include(AddLLVM)include(AddMLIR)include(HandleLLVMOptions)include_directories(${LLVM_INCLUDE_DIRS})include_directories(${MLIR_INCLUDE_DIRS})include_directories(${PROJECT_SOURCE_DIR}/include)include_directories(${PROJECT_BINARY_DIR}/include)link_directories(${LLVM_BUILD_LIBRARY_DIR})add_definitions(${LLVM_DEFINITIONS})add_subdirectory(include)add_subdirectory(lib)add_subdirectory(test)add_subdirectory(hello-opt) 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~","link":"/kewenlu2023/posts/4b8ef040/"},{"title":"MLIR：新建一个Dialect（十），CMakeLists.txt","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 Multi-Level Intermediate Representation（MLIR）是创建可重用、可扩展编译器基础设施的新途径。本文为第 16 期，继续介绍 mlir-hello 是如何利用 cmake 来组织项目的。 转载请注明出处！ 关于文件结构，在之前的文章MLIR：新建一个Dialect（一）已经介绍过了。 上一篇文章已经介绍了mlir-hello项目根目录下，也就是总的的工程配置部分，本质上也就是文件结构和 cmake 项目文件的编写。 本文继续讲下各个子目录的 CMakeLists.txt 文件。 子项目组成在根目录的项目文件最后，引入了 4 个子目录，这 4 个目录下又都用一个 CMakeLists.txt 重新组织，分别是 1234add_subdirectory(include)add_subdirectory(lib)add_subdirectory(test)add_subdirectory(hello-opt) 这么做是为了更好的分层组织项目，实现解耦。 include，通过ODS生成代码文件中引入仅有的 Hello 这一个子项目， 123add_mlir_dialect(HelloOps hello)add_mlir_doc(HelloDialect HelloDialect Hello/ -gen-dialect-doc)add_mlir_doc(HelloOps HelloOps Hello/ -gen-op-doc) 根据 MLIR：新建一个Dialect（四），通过.td定义新Dialect，MLIR：新建一个Dialect（五），通过.td定义新Op 先回想一下，include 目录下 Hello 的主要内容是为了使用 ODS 定义新 Op。 于是，这里有几条 MLIR 基础设施提供的命令，add_mlir_dialect 和 add_mlir_doc 对应 HelloOps.td 和 HelloDialect.td，调用 mlir-tblgen 生成相应代码和帮助信息。 lib，利用库生成库文件中引入仅有的 Hello 这一个子项目， 123456789101112131415add_mlir_dialect_library(MLIRHello HelloDialect.cpp HelloOps.cpp LowerToAffine.cpp LowerToLLVM.cpp ADDITIONAL_HEADER_DIRS ${PROJECT_SOURCE_DIR}/include/Hello DEPENDS MLIRHelloOpsIncGen LINK_LIBS PUBLIC MLIRIR ) 可以看出，这里都是 MLIR：新建一个Dialect（七），lowering 相关的代码。它们要被生成一个库文件 libMLIRHello.a 使用。add_mlir_dialect_library 的语法同样参考 MLIR 基础设施提供的命令。 test晕，忘了说这一部分了，下一篇文章先补这个再总结所有吧。 先看看它的项目文件怎么写的，总之是利用 lit 和 FileCheck 对自己编写的一些测试 .mlir 文件在后期结合生成的工具进行测试。 1234567891011121314151617181920configure_lit_site_cfg( ${CMAKE_CURRENT_SOURCE_DIR}/lit.site.cfg.py.in ${CMAKE_CURRENT_BINARY_DIR}/lit.site.cfg.py MAIN_CONFIG ${CMAKE_CURRENT_SOURCE_DIR}/lit.cfg.py)set(HELLO_TEST_DEPENDS FileCheck count not mlir-opt hello-opt )add_lit_testsuite(check-hello &quot;Running the hello regression tests&quot; ${CMAKE_CURRENT_BINARY_DIR} DEPENDS ${HELLO_TEST_DEPENDS} )set_target_properties(check-hello PROPERTIES FOLDER &quot;Tests&quot;)add_lit_testsuites(HELLO ${CMAKE_CURRENT_SOURCE_DIR} DEPENDS ${HELLO_TEST_DEPENDS}) hello-opt这个子项目被放在最后，因为它需要前面的事情都做完。 1234567891011121314151617181920212223242526272829get_property(dialect_libs GLOBAL PROPERTY MLIR_DIALECT_LIBS)get_property(conversion_libs GLOBAL PROPERTY MLIR_CONVERSION_LIBS)set(LIBS ${dialect_libs} ${conversion_libs} MLIRHello MLIRAnalysis MLIRCallInterfaces MLIRCastInterfaces MLIRExecutionEngine MLIRIR MLIRLLVMCommonConversion MLIRLLVMToLLVMIRTranslation MLIRMemRefDialect MLIRLLVMDialect MLIRParser MLIRPass MLIRSideEffectInterfaces MLIRSupport MLIRTargetLLVMIRExport MLIRTransforms MLIROptLib )add_llvm_executable(hello-opt hello-opt.cpp)llvm_update_compile_flags(hello-opt)target_link_libraries(hello-opt PRIVATE ${LIBS})mlir_check_all_link_libraries(hello-opt) get_property， 用于获取属性，得到 MLIR_DIALECT_LIBS 和 MLIR_CONVERSION_LIBS 目录，从而在编译 hello-opt 时使用 set， 组织所有库文件，主要是新添了 MLIRHello 这个由 lib 目录新生成的 add_mlir_dialect_library add_llvm_executable，AddLLVM.cmake 里的函数，根据一些附加关联生成可执行文件 hello-opt llvm_update_compile_flags，AddLLVM.cmake 的一个函数，引入 llvm 需要的编译标记 target_link_libraries，引入刚刚组织好的库文件 mlir_check_all_link_libraries，AddMLIR.cmake 中的一个函数，调用同文件下定义的 mlir_check_link_libraries 检查所有 lib 小结mlir-hello 通过 cmake 组织项目。本文继续介绍了各子目录下的 CMakeLists.txt，以及它如何组织串联本地项目文件。 至此，关于如何新建一个 Dialect 的系列文章基本上已经更新完毕。本来下一篇文章将会进行总结，但可能要补一下忘了写的测试部分。 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~","link":"/kewenlu2023/posts/d1db4e37/"},{"title":"Python：map，reduce，filter","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 今天通过几个程序温习这三个 Python 内置函数的用法。 小结map, reduce, filter 是 Python 内置的 3 个 generator，它们都接受 2 个参数，并将 参数1（functor） 应用到 参数2（iterator） 上。不同的是， map 依次将 iterator 产生的每个值代入 functor，对位生成新值； reduce 递归式的每次作用于 iterator 产生的最前面两个值，并将结果作为第一个值代入下一次计算，最终结果一个值； filter 依次将 iterator 产生的每个值代入返回 bool 值的 functor，并保留为 True 的那些结果。 map 廖雪峰：map map(functor, iterator) 是一个 generator，它依次将 iterator 产生的每个值代入 functor，对位生成新值。 例如， 1234# 一个对输入列表里的值求平方的 generatorsquared = map(lambda x: x ** 2, [3, 4, 5])print(next(squared)) # 9print(next(squared)) # 16 reduce 廖雪峰：reduce reduce(functor, iterator) 是一个 generator，它递归式的每次作用于 iterator 产生的最前面两个值，并将结果作为第一个值代入下一次计算，最终结果一个值。 例如， 1234# sum()from functools import reduceprint(reduce(lambda x, y: x+y, [1, 2, 3, 4, 5, 6, 7, 8, 9, 10])) # 55 filter 廖雪峰：filter filter(functor, iterator) 是一个 generator，它依次将 iterator 产生的每个值代入返回 bool 值的 functor，并保留为 True 的那些结果。 例如， 123x = filter(lambda x: x % 2 == 0, [1, 2, 4, 5, 6, 9, 10, 15])print(next(x)) # 2print(next(x)) # 4 下面这段代码作一个简单筛选，筛出质数。 12345678910111213141516171819202122232425262728293031323334353637# %%# 这段程序先定义两个 functor：\\# 生成奇数/判断是否能被整除# 然后，通过 filter 函数使用前面 \\# 两个 functor 完成质数的筛出def _odd_iter():''' 一个返回奇数序列的 generator'''n = 1while True: n = n + 2 yield ndef _not_divisible(n):''' 判断是否能被 n 整除的 functor'''return lambda x: x % n &gt; 0def primes():''' 一个质数序列的 generator'''yield 2it = _odd_iter() # 初始序列while True: n = next(it) # 返回序列的第一个数 yield n it = filter(_not_divisible(n), it) # 构造新序列prime = primes()for _ in range(10):print(next(prime))# 2 3 5 7 11 13 17 19 23 29 都看到这儿了，不如关注每日推送的“科文路”、互动起来~~ 至少，点个赞再走吧~","link":"/kewenlu2023/posts/f83e72d1/"},{"title":"人文：亚西尔·阿拉法特","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转载须注明出处。人文：亚西尔·阿拉法特 是的，就是你记忆中经常在新闻上听到的那个“阿拉法特” 巴以冲突最近的新闻大家也都看了，巴（巴勒斯坦）以（以色列）冲突愈演愈烈。在全球范围内拥有强大势力的犹太人集团也让这个事件好像失去了真实的面貌。 关于巴以冲突的历史经历各位可以在抖音上搜搜看看。今天，想带着大家回看、或者认识一下跟这个源源不断的“巴以冲突”相关的人物——亚西尔·阿拉法特，顺带解释一些名词。 他是一个具有极大争议的人物。巴勒斯坦人普遍将他视为民族烈士，而以色列人则认为他是恐怖分子。 亚西尔·阿拉法特拉赫曼·阿卜杜勒·拉乌夫·阿拉法特·古德瓦·侯赛尼（1929年8月4日（或24日）－2004年11月11日），通称亚西尔·阿拉法特，是巴勒斯坦解放运动领袖，巴勒斯坦领导人，巴勒斯坦解放组织主席及巴解组织最大派别法塔赫的领导人，1994年巴勒斯坦民族权力机构成立后任主席。 生平阿拉法特出生于埃及开罗，小时候大多住在开罗，除丧母初期（5岁—9岁）时住在耶路撒冷。 他毕业于开罗大学，专业为土木工程。在1944年，他进入弗阿德一世大学（University of King Fuad I）学习，并于1950年毕业。在大学期间，他组织犹太教学生加入讨论，并大量阅读西奥多·赫茨尔等著名犹太复国主义者著作。 1946年，他成为了一名阿拉伯民族主义者，并开始收购武器，这些武器将要被偷偷运送至前巴勒斯坦托管地。 1950年代，阿拉法特加入埃及军队，1956年苏伊士运河危机时为埃及作战。 建立了活跃的法塔赫组织之后，1969年2月3日，他被选为巴解组织领导人，他主张把犹太人从阿拉伯土地上连根拔起，并于1970年代至1980年代策划多次恐怖袭击，巴解组织备受国际谴责，谴责逼使阿拉法特放弃恐怖袭击手段，改为以和平手段和以色列谈判。 1989年，阿拉法特当选为巴勒斯坦国总统。 1994年7月，阿拉法特结束27年的流亡生活，回加沙定居。 1994年，成为诺贝尔和平奖的获得者之一。 2003年9月11日，以色列安全内阁以阿拉法特是“和平绊脚石”为由，决定“原则上”将阿拉法特驱逐出巴勒斯坦。 2004年11月11日，阿拉法特因病医治无效（一说是被投毒放射性元素），在法国贝尔西军医院病逝，享年75岁。 181号决议、以色列、巴勒斯坦 巴勒斯坦国（通称巴勒斯坦）位于西亚西部的巴勒斯坦地区，目前由约旦河西岸和加沙地带这两块阿拉伯人聚居地所组成，是一个主权争端地区及有限承认国家，首都为东耶路撒冷。 二战后，英国于1947年2月18日将巴勒斯坦问题提交联合国，联合国大会于1947年11月29日通过联合国大会181号决议。该决议提出在原英国巴勒斯坦托管地建立两个国家，一个是犹太国，另一个是阿拉伯国。犹太人接受此决议而阿拉伯国家拒绝接受。 1948年5月14日，英国结束巴勒斯坦委任统治。犹太人依照联合国181号决议宣布以色列建国。随即阿拉伯联盟国家埃及、伊拉克、黎巴嫩、叙利亚以及外约旦（1950年改称约旦）的军队相继进入巴勒斯坦，同时，阿拉伯联盟发表声明对以色列宣战，第一次中东战争由此爆发。 1988年11月15日，巴勒斯坦方发表独立宣言后，已获138个联合国国家承认建国，该国由巴勒斯坦解放组织（即“法塔赫”）为首组建的民族政府宣称全部主权，但其领土自赎罪日战争后仍受以色列不同程度上的军事占领和控制，尤其加沙地带则有哈马斯势力，至今双方仍常有冲突。 哈马斯、法塔赫2007年6月因内部两大势力严重不和而形成分裂局面，其中巴勒斯坦伊斯兰抵抗运动（即“哈马斯”）占有加沙地带（地图左下角），而巴勒斯坦民族解放运动（即“法塔赫”）主导的巴勒斯坦自治政府则管治约旦河西岸（地图右上角），受巴勒斯坦民族权力机构监督。 法塔赫，是一个巴勒斯坦阿拉伯人的政治及准军事组织，阿拉法特2004年逝世前一直是主要领导人。他们专注于以约旦河至地中海一带土地组成建立一个独立的巴勒斯坦国。 1963年，叙利亚雇佣法塔赫组织做它的第一次军事行动，计划在1964年12月炸毁一个以色列的水泵。这个行动虽然失败，但引起了以色列官方的注意。1967年六日战争结束后，以色列开始留心防备各种巴解组织，包括法塔赫。 由于法塔赫坚持巴勒斯坦必须拥有整个耶路撒冷（以色列拒绝放弃其主权），导致跟以色列的谈判十多年来长期陷入僵局，但因为哈马斯的关系，以色列始终视之为谈判对象，但维持强硬态度。 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 赞赏请前往公众号菜单栏~~ 至少点个赞再走吧~","link":"/kewenlu2023/posts/759f3597/"},{"title":"他山之石：我是如何成为一名机器学习从业者的（OpenAI，Greg_Brockman）","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 Greg Brockman，OpenAI 联合创始人之一，2019 年 7 月 30 日，《How I became a machine learning practitioner》 在 OpenAI 的前三年，虽然我也梦想成为一名机器学习专家，但在实现这一目标方面进展甚微。在过去的九个月里，我终于转变为一名机器学习从业者。这很困难，但并非不可能，我认为大多数优秀程序员并且知道（或愿意学习）数学的人也可以做到。尽管可以通过很多在线课程自学那些技术，但事实证明，我最大的障碍是心理障碍——重新适应初学者的生活。 早些年OpenAI 的创立原则是我们同等重视研究和工程——我们的目标是构建能够解决以前不可能完成的任务的工作系统，因此我们两者都需要。 （事实上，我们的团队中有 25% 的人主要使用软件技能，25% 的人主要使用机器学习技能，50% 的人混合使用这两种技能）因此，从 OpenAI 的第一天起，我的软件技能就一直很受欢迎，但我却一直在拖延学习我想要的机器学习技能。 在帮助构建 OpenAI Gym 后，我被邀请去 Universe 工作。随着 Universe 逐渐走向尾声，我们决定开始开发 Dote ——在任何机器学习工作开始之前，需要有人将游戏转变为强化学习环境。 Dota将如此复杂的游戏转变为无需访问源代码的研究环境是一项了不起的工作。每次我克服一个新障碍时，团队的兴奋都深深打动我。我想出了如何突破游戏的 Lua 沙箱，在 Go GRPC 服务器中使用 LD_PRELOAD 以编程方式控制游戏，逐步将整个游戏状态转储到 Protobuf 中，并构建一个 Python 库和抽象，以便将来兼容许多不同的多代理（agent）我们可能想要使用的配置。 但我感觉自己一叶障目了。在 Stripe，虽然我更倾向于基础设施解决方案，但我可以在堆栈中的任何位置进行更改，因为我非常了解产品代码。在 Dota 中，我只能通过软件视角来看待所有问题，这有时意味着我试图解决一些难题，而这些难题可以通过稍微不同地进行机器学习来避免。 我想像我的队友 Jakub Pachocki 和 Szymon Sidor 一样，他们取得了为我们的 Dota 机器人提供动力的核心突破。他们质疑OpenAI内部的共识，即强化算法无法扩展。他们编写了一个名为 Rapid 的分布式强化学习框架，并每两周左右以指数方式扩展它，从未遇到过任何困难。我希望能够做出关键的贡献，比如将软件和机器学习技能结合起来。 2017 年 7 月，看起来我可能有机会了。软件基础设施很稳定，于是我开始从事机器学习项目。我的目标是使用行为克隆（Behavior Cloning) 根据人类训练数据来训练神经网络。但我并没有完全准备好去做一个初学者。 我一直对工作流程的小细节感到沮丧，这让我不确定自己是否取得了进展：例如不确定给定的实验使用了哪些代码，或者意识到我需要与上周未正确存档的结果进行比较。更糟糕的是，我不断发现一些小错误，这些错误一直在破坏我的结果。 我对自己的工作没有信心，但糟糕的是，其他人对我有信心。人们会提到从人类数据中克隆行为是多么困难。我总是通过指出我是新手来纠正他们，这可能更多地说明了是我个人能力的问题。 当我的代码进入机器人（bot）时，这一切都短暂地感觉值得，因为 Jie Tang 将其用作蠕变阻止（creep blocking）的起点，然后他通过强化学习进行了微调。但很快，Jie 就想出了如何在不使用我的代码的情况下获得更好的结果，而我的努力却没有什么可展示的。 我再也没有在 Dota 项目上尝试过机器学习。 暂停2018 年我们在国际邀请赛上输掉两场比赛后，大多数观察家认为我们的方法已经达到了顶峰。但从我们的指标来看，我们知道我们正处于成功的边缘，而且最需要更多的训练。这意味着对我时间的要求有所缓和，2018 年 11 月，我觉得我有机会用三个月的时间搏一搏（注：停下来去学习）。 当我有具体的想法要构建时，我学习效果最好。我决定尝试构建一个聊天机器人。我开始自学我们为研究员计划开发的课程，只选择与 NLP 相关的模块。例如，我编写并训练了一个 LSTM 语言模型，然后又编写了一个基于 Transformer 的模型。我还阅读了信息论等主题，并阅读了许多论文，仔细研究每一行内容，直到完全吸收为止。 虽然进展缓慢，但这次我很有把握。我没有经历心流状态（注：一种精神状态，其特征在于完全沉浸在活动中并专心致志，使相应过程令人满足且令人愉悦）。我想起了我刚开始编程时的感受，我一直在想我花了多少年才达到一种精通的感觉。老实说，我并不相信自己能够擅长于机器学习。但我一直在努力，因为……好吧，老实说，因为我不想仅限于理解项目的一部分。我想清楚地看到整个画面。 我的个人生活也是让我继续前进的一个重要因素。我开始与一个让我觉得失败也没关系的人建立关系。我们一起度过了第一个假期，我一直在机器学习上碰壁，但她一直和我在一起，不管这意味着要跳过多少计划好的活动。 有重要的象征意义的一步是克服我在 Dota 中胆怯而不敢做的一个障碍：对别人的机器学习代码进行实质性更改。我在找到的聊天数据集上对 GPT-1 进行了微调，并做了一些小更改以添加我自己的简单采样代码。但当我试图生成更长的消息时，它变得非常缓慢，我的沮丧压倒了我的恐惧，我实现了 GPU 缓存——这一改变影响了整个模型。 我不得不尝试几次后放弃了我的更改，因为它们超出了我头脑中可以容纳的复杂性。几天后，当我让它开始工作时，我意识到我学到了一些我以前认为不可能的东西：我现在了解了整个模型是如何组合在一起的，甚至是小的风格细节，例如代码库如何优雅地处理 TensorFlow 变量范围。 重整旗鼓经过三个月的自学，我觉得自己已经准备好从事实际的项目了。这也是我第一次觉得我可以从 OpenAI 的众多专家中受益，当 Jakub 和我的联合创始人 Ilya Sutskever 同意为我提供建议时，我感到很高兴。 我们开始获得非常令人兴奋的结果，Jakub 和 Szymon 全职加入了该项目。每当我在我启动的机器学习代码库中看到他们的提交时，我都会感到自豪。 我开始感到自己有能力，尽管我还没有达到精通的程度。我发现这反映在我可以激励自己专注于机器学习工作的时间上——我现在的编码时间约为以往的 75%。 但我第一次觉得自己走上了正轨。起初，我被看似无穷无尽的新机器学习概念所淹没。在前六个月内，我意识到我可以取得进步，而无需不断学习全新的原语。我仍然需要在许多技能方面获得更多经验，例如初始化网络或设置学习率计划，但现在这项工作感觉是渐进的，而不是可能不可能的。 从我们的研究员和学者项目中，我知道具有扎实的线性代数和概率基础的软件工程师只需几个月的自学就可以成为机器学习工程师。但不知何故，我说服自己我是个例外，我学不会。但我错了——但我错了——即使身处OpenAI的中心，我也无法完成过渡，因为我不愿意再次成为初学者。 你可能也不例外。如果你想成为一名深度学习从业者，可以的。你需要给自己失败的空间和时间。如果你从足够多的失败中吸取教训，你就会成功——而且所需的时间可能比你预期的要少得多。 在某些时候，让现有的专家包围自己确实变得很重要。这是我非常幸运的地方。如果您是一名优秀的软件工程师，达到了这一点，请记住，有一种方法可以让您周围都是像我一样的人 - 应聘 OpenAI！ ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~","link":"/kewenlu2023/posts/cc9b96fc/"},{"title":"体育：WCBA总决赛，内蒙古主场力克四川","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 今晚是 2022-2023 赛季的 WCBA，也就是中国女子篮球联赛的总决赛第一场对决的比赛日。在三局两胜的赛制下，内蒙古以 105-94 取得大比分 1-0 领先。 这场比赛也是 WCBA 恢复主客场制后的第一场比赛，由内蒙古队坐镇呼和浩特主场迎战四川女篮。值得一提的是，本次总决赛的对阵双方内蒙古和四川分别是去年的冠、亚军得主。 高水平的比赛自然也是群星荟萃，两队中的明星球员、国手不在少数。内蒙古这边，李月汝、杨力维、黄思静大家耳熟能详；四川队也同样拥有李梦、韩旭、王思雨这样的顶级球手力撑牌面。加上其他国手，不夸张的说，这次的总决赛更像是中国国家队的“内战”。 从转播画面看来，全场座无虚席。内蒙古队同样也是受到主场球迷的鼓舞，从首节开始便掌控比赛。全场比赛较为精彩，但总的来说，内蒙古并没有留给四川多少机会，直到最终以 105-94 取胜。 下一场比赛将于 3 月 10 日晚在四川举行（我也可能现场支持我的主队），希望四川能拿下比赛，继续冲击首个总冠军。如果内蒙古再次赢下比赛，则内蒙古将实现“三连冠”伟业。 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~","link":"/kewenlu2023/posts/49022daa/"},{"title":"体育：中超主场，燃情回归（多图）","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 第 3 轮战罢，所有队伍悉数登上主场。按赛程，它们分别是大连人、武汉三镇、浙江队、北京国安、河南队、天津津门虎、上海申花、深圳队、梅州客家、山东泰山、成都蓉城、上海海港、长春亚泰、青岛海牛、沧州雄狮、南通支云。 官方微博@​CSL中超联赛 联动中超参赛俱乐部的“回归”告示让人动容。 主场球迷普遍激情澎湃，毕竟距离上一次有球迷的参与的主场比赛大多已经 3 年。 中国足球，会越来越好的！ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~","link":"/kewenlu2023/posts/6ec02fe4/"},{"title":"体育：机会留给有准备的人，丁立人终加冕国际象棋男子世界冠军！","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 摘选自 通讯 | 丁立人勇夺国象男子世界冠军之路 新华社北京5月1日电（记者郑直、王镜宇、王恒志）4月30日晚，哈萨克斯坦阿斯塔纳冬季花园的玻璃穹顶下，中国棋手丁立人在四盘快棋加赛的最后一盘力克俄罗斯棋手涅波姆尼亚奇，成为国际象棋历史上第17位男子世界冠军。这是中国男棋手第一次登顶国象世界之巅，中国国际象棋三十年前提出的“四步走”战略，最后一步就此落地。 首次冲击2017年，丁立人在男子世界杯个人赛中获得亚军，创造当时中国男子棋手世界个人大赛历史最佳战绩。更重要的是，凭借这个亚军，他拿到了2018世界冠军候选人赛的入场券，将与其他棋手争夺挑战棋王的资格。 首次亮相候选人赛，丁立人交出了1胜13平不败战绩排名第四的成绩单。赛前“隐约期待”进入前三名的他，自我评价目标“完成了一大半”。 二战，意外递补候选人赛2019年，丁立人再次夺得世界杯亚军，进入2020年候选人赛。但由于疫情原因，这届比赛一度中断，丁立人也未发挥出最佳水平。 疫情也打乱了其他比赛节奏。此后，他错过多个世界冠军赛资格赛，也几乎无缘新一届候选人赛。但这时，世界杯亚军卡尔亚金由于不当言论被禁赛，丁立人凭借等级分递补参加。 一负七和，奋起夺亚军疫情仍在继续，丁立人独自一人前往马德里，团队只能远程支持。但他豁达地表示：“至少输了棋大家不用一起难受。” 首轮输给涅波之后，他经历了七连和。但他顶住压力，最后六轮赢下四轮，还包括一次三连胜，最终获得亚军，创造个人与中国棋手的候选人赛最佳成绩。期间，由于涅波倒数第二轮就已夺冠，最后一轮意义已经不大。但当时排名第三的丁立人依然全力以赴，力克原本排名第二的美国棋手中村光，提升了自己的排名。“亚军也是很好的成绩。”他说。 再次递补，机会是留给有准备的人的只是当时，包括他自己在内的许多人都没想到，这个“很好”将要包含的意义。 2022年，当世界各地正庆祝7月20日世界国象日之际，时任世界冠军卡尔森宣布他将不再争取卫冕，这意味着2023年世界冠军赛的双方将是候选人赛的冠军涅波与亚军丁立人。 这是中国男子国象棋手第一次有机会争夺世界冠军：两个人，14盘慢棋，先得7.5分者胜。 鏖战创记录比赛开始，双方首轮以和棋告终；第二轮，涅波亮出獠牙，执黑获胜。第三轮和棋后，丁立人在第四轮取得漂亮的首胜。涅波第五轮再度领先，丁立人再度扳平。上半程最后一轮，涅波获胜，双方在7轮比赛中罕见地有5轮分出胜负。 第八盘、第九盘、第十盘、第11盘……连续四盘和棋，涅波固守1分优势，14轮慢棋所剩无多。第12轮，丁立人制造复杂局面，逼迫涅波犯下致命失误，随后发起总攻，涅波摇头、沉默……丁立人绝处逢生，第三次追平比分。 第13轮，双方和棋。第14轮，90回合与6小时33分创下开赛以来回合数与时长之最……丁立人顽强守和，十几个小时后，比赛就将进入快棋加赛，这是对心理与身体的双重考验。 顶住压力，拿下棋王快棋加赛，双方更加谨慎，焦灼的气氛随着和局次数的增加在房间累积。三战三和，快棋进入最后一盘。 双方在压力下争夺主动权。当棋局又要朝和棋发展时，丁立人毅然挑起战斗。尽管一度耗时过长，但他以精确的行棋赢回时间，反让对手陷入时间恐慌；涅波连续失误，无力回天，丁立人加冕世界棋王！ ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~~ 至少，点个赞再走吧~","link":"/kewenlu2023/posts/74553134/"},{"title":"体育：玩大了！篮协公布对“上海久事队”“苏州肯帝亚队”的处罚决定","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 今日，中国篮协公布了对前几日“上海久事队”和“苏州肯帝亚队”相关比赛情况的处罚决定， 都看到这儿了，不如关注每日推送的“科文路”、互动起来~","link":"/kewenlu2023/posts/c1c6b51e/"},{"title":"再见，2023：科文路的年终简报","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 今天是 2023 年的最后一天，照惯例，跟我的读者们分享一下今年“科文路”微信公众号的一些数据。 内容内容方面，今年延续去年的方向继续编写科学、技术、文艺、生活相关的文章，全年 共发表文章 360 篇左右（由于使用了图片文章功能，所以博客网站没有备份） 总阅读约 18.5 万次 共收获 616 位新的关注者 从数据看，相比去年来说有了很大的提升，潜在的影响了一部分人，也感受到了自己身上的责任。 感谢大家的关注，明年我将会在今年的内容基础上重新思考一下，在有限的业余时间里，开展更加持续、有深度文艺火技术的探索与分享，让内容更立体。 也希望读者们留言或者直接和我对话，我很乐意答复。 收入与捐赠平衡读者的阅读体验和收入预期，今年在微信公众号的尾部增加了广告展示，从而获取广告分成。所以，今年“科文路”的收入主要由微信和头条的广告分成组成。 延续去年的做法，今年的所有收入还是捐赠给了我仍在参与捐赠的的公益项目“授渔计划乡村助学”。 共计 159.36 元，其中微信公众号 123.81 元，头条 35.55 元。 在这里，我也继续保证，“科文路”是非盈利性质的，所有的收入（广告分成、捐赠、赞赏等）都将用于公益事业。我个人倾向于的项目以助学为主。 2023-&gt;2024写“科文路”公众号已经两年了，一切的发展中规中矩。由于本身也没有过多的投入，所以这样的数据和收入都令我很满意。 年龄越大，从社会拿到的东西越多，也越深知自己的社会责任重大。自己也仍在慢慢的平衡工作和生活的时间分配。只能说，明年继续加油，让写“科文路”的旅途继续和谐的延续下去！ 再一次，谢谢各位读者的关注！也请能不吝赐教。我们 2024 见！ ===== 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~","link":"/kewenlu2023/posts/9abf0f12/"},{"title":"再见，2023：豆瓣年度读书榜单","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。再见，2023：豆瓣年度读书榜单 豆瓣2023年度读书榜单 1. 我在北京送快递 作者: 胡安焉 ISBN: 9787572609268 豆瓣评分: 8.2, 23089 人评价 2. 明亮的夜晚 作者: [韩]崔恩荣 ISBN: 9787516835265 豆瓣评分: 9.0, 4594 人评价 3. 一百年，许多人，许多事 作者: 杨苡/口述 / 余斌/撰写 ISBN: 9787544792745 豆瓣评分: 8.7, 5118 人评价 4. 同意 作者: [法] 瓦内莎·斯普林格拉 ISBN: 9787549637300 豆瓣评分: 8.7, 6840 人评价 5. 我还能看到多少次满月升起 作者: [日] 坂本龙一 ISBN: 9787521755756 豆瓣评分: 9.2， 1901 人评价 6. 为了活下去的思想 作者: [日]上野千鹤子 ISBN: 9787559660497 豆瓣评分: 9.0，1900 人评价 7. 凯列班与女巫 作者: [意]西尔维娅·费代里奇 ISBN: 9787542680525 豆瓣评分: 9.1，1336 人评价 8. 赶时间的人 作者: 王计兵 ISBN: 9787516834114 豆瓣评分: 8.6，3511 人评价 9. 多谈谈问题 作者: 吴琦 / 吕晓宇 / 柏琳 ISBN: 9787532186754 豆瓣评分: 8.7，2962 人评价 10. 疼痛部 作者: [荷] 杜布拉夫卡·乌格雷西奇 ISBN: 9787547744482 豆瓣评分: 8.9，1949 人评价 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~","link":"/kewenlu2023/posts/ddc3fcd1/"},{"title":"又是个税申报时，复习一下扣税规则","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 “2022 综合所得年度汇算”，也叫个税申报，开始了！ 庆幸的是，2022 年的个税扣税规则依然可以选择年终奖单独计税。年终奖单独计税再加上其他几项常见的减税项目（租房/房贷，小孩，赡养老人等等），下来应该多少会有一点点退税的。 但，换过工作的多半要补税了，我就是补税大军一员🤣 工资和年终奖的个税是怎么扣的？多少收入该扣多少？想搞清楚这些问题的话，这里有两篇去年写的文章，今年同样适用， 2022，年终奖怎么扣个税？ 2022，工资怎么扣个税？ 各位有疑虑的可以自己算一算扣对了没有~ ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~~ 至少，点个赞再走吧~","link":"/kewenlu2023/posts/7cfbeda7/"},{"title":"国家疾控局：这些场景下应该戴口罩","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。国家疾控局：这些场景下应该戴口罩 12月8日，国务院联防联控机制疫情防控组制定了《预防呼吸道传染病公众佩戴口罩指引（2023年版）》，对公众戴口罩行为进行了指导。 其中，我觉得比较重要的内容有： 一、应佩戴口罩的情形或场景 编者注：自己已经有呼吸道疾病症状时、去医院时、接触脆弱人群时、公共服务人员 新冠病毒感染、流感、肺炎支原体感染、呼吸道合胞病毒感染等呼吸道传染病感染者前往室内公共场所或与他人近距离接触（距离小于1 米，下同）时。 出现发热、咳嗽、流涕、咽痛、肌肉酸痛、乏力等呼吸道传染病症状者前往室内公共场所或与他人近距离接触时。 前往医疗机构就诊、陪诊、陪护、探视时。 呼吸道传染病高发期间，外来人员进入养老机构、社会福利机构、托幼机构等脆弱人群集中场所时。 呼吸道传染病高发期间，养老机构、社会福利机构、 托幼机构、学校等重点机构的医护、餐饮、保洁、保安等公共服务人员工作期间。 二、建议佩戴口罩的情形或场景 编者注：乘坐公共交通工具、进入密闭的人员密集场所、与有病症的人一起共事时 呼吸道传染病高发期间，乘坐飞机、火车、长途车、轮船、地铁、公交车等公共交通工具时。 呼吸道传染病高发期间，进入超市、影剧院、客运场站、厢式电梯等环境密闭、人员密集场所时。 呼吸道传染病高发期间，老年人、慢性基础疾病患者、孕妇等前往室内公共场所时。 与出现呼吸道传染病症状者共同学习、生活或工作期间。 三、建议不佩戴口罩的常见情形或场景 运动、小孩 进行体育锻炼时。 处于露天广场、公园等室外场所时。 3岁及以下婴幼儿。 最重要的就是这些。当然还有些别的内容，这里就不赘叙了，感兴趣的可以搜全文看看。 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~~ 至少，点个赞再走吧~","link":"/kewenlu2023/posts/f7ad1885/"},{"title":"图灵奖：丹尼斯·里奇（1983）","text":"图灵奖是计算机界最负盛名的奖项，有“计算机界诺贝尔奖”之称。”图灵奖”系列将介绍历届获奖者。每周二更新，本文为第 21 期。图灵奖：丹尼斯·里奇（1983） 文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 本文来自 wiki:Dennis Ritchie，翻译基于 谷歌翻译. 所有程序员都知道的 K&amp;R 丹尼斯·里奇（Dennis MacAlistair Ritchie，1941 年 9 月 9 日 – 2011 年 10 月 12 日）是一位美国计算机科学家。 他因创建 C 编程语言（名著《K&amp;R》的R）而闻名，并与同事 Ken Thompson 一起创建了 Unix 操作系统和 B 编程语言。 他于 1983 年获得图灵奖。 其图灵奖颁奖词为“与 Ken Thompson 一起开发了通用操作系统理论并专门用于 UNIX 操作系统的实现。”。（With Ken Thompson, for their development of generic operating systems theory and specifically for the implementation of the UNIX operating system.） 生平丹尼斯·里奇出生于纽约州 Bronxville。 他的父亲是阿利斯泰尔·E·里奇 (Alistair E. Ritchie)，是贝尔实验室的长期科学家，也是开关电路理论书籍《开关电路设计》的合著者。 丹尼斯小时候随家人搬到了新泽西州的 Summit，并在那里从 Summit 高中毕业。后来从哈佛大学毕业，获得物理学和应用数学学位。 1967年，Ritchie开始在贝尔实验室计算科学研究中心工作，1968年，他在 Patrick C. Fischer 的指导下在哈佛大学答辩了关于“计算复杂性和程序结构”（Computational Complexity and Program Structure）的博士论文。 然而，里奇从未正式获得博士学位，因为他没有向哈佛大学图书馆提交论文的装订副本，而这是该学位的要求。 UNIX20 世纪 60 年代，Ritchie 和 Ken Thompson 在贝尔实验室研究 Multics 操作系统。 随后，汤普森找到了一台旧的 PDP-7 机器，并在里奇和其他人的帮助下从头开始开发了自己的应用程序和操作系统。 1970 年，Brian Kernighan 建议使用“Unix”这个名称，这是“Multics”这个名称的双关语。 C语言为了用系统级编程语言来补充汇编语言，Thompson 创建了 B 语言。后来，B 被 Ritchie 创建的 C 所取代，Ritchie 多年来继续为 Unix 和 C 的发展做出贡献。 Ritchie 还参与了 Plan 9 和 Inferno 操作系统以及编程语言 Limbo 的开发。 作为 20 世纪 90 年代中期 AT&amp;T 重组的一部分，Ritchie 被调到朗讯科技公司，并于 2007 年以系统软件研究部主管的身份退休。 贡献 ALTRAN B BCPL C Multics Unix ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu2023/posts/d8f173c6/"},{"title":"图灵奖：伊凡·苏泽兰（1988）","text":"图灵奖是计算机界最负盛名的奖项，有“计算机界诺贝尔奖”之称。”图灵奖”系列将介绍历届获奖者。每周二更新，本文为第 28 期。图灵奖：伊凡·苏泽兰（1988） 文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 本文来自 wiki:Ivan Sutherland，翻译基于 谷歌翻译. 计算机图形学之父 伊凡·爱德华·苏泽兰（Ivan Edward Sutherland，1938 年 5 月 16 日出生），美国计算机科学家和互联网先驱，美国国家工程院和美国国家科学院院士，并获得过许多其他重大奖项。 他早期在计算机图形学方面的工作以及 20 世纪 70 年代在犹他大学与 David C. Evans 一起教授该学科的工作使其被广泛认为是计算机图形学的先驱。苏泽兰、埃文斯和他们那个时代的学生奠定了现代计算机图形学的几个基础。 1988 年，他因发明画板（Sketchpad）而获得图灵奖，画板是个人计算机中普遍存在的图形用户界面的早期前身。 他于 1988 年获得图灵奖。 其图灵奖颁奖词为“表彰他对计算机图形学的开创性和富有远见的贡献，从画板开始、一直到后来”。（For his pioneering and visionary contributions to computer graphics, starting with Sketchpad, and continuing after.） 生平苏泽兰 1938 年 5 月 16 日出生于美国内布拉斯加州黑斯廷斯，他的血统来自苏格兰和新西兰。 他于 1959 年在卡内基理工学院获得电气工程学士学位，1960 年在加州理工学院获得硕士学位，1963 年获得麻省理工学院电气工程博士学位。 苏泽兰于 1962 年在麻省理工学院发明了画板（Sketchpad），并基于此撰写了博士论文。他的论文导师是克劳德·香农。是的，就那个信息论之父。他的论文委员会成员包括马文·明斯基（Marvin Minsky，AI领域大佬，1969年图灵奖）和史蒂文·库恩斯。 1963 年至 1965 年，获得博士学位后，他在美国陆军服役。 1965 年至 1968 年，苏泽兰担任哈佛大学电气工程系副教授。 1968年至1974年，苏泽兰担任犹他大学教授。其中，1968 年，他与朋友兼同事 David C. Evans 共同创立了 Evans &amp; Sutherland。Evans &amp; Sutherland 的前雇员包括 Adobe (John Warnock) 和 Silicon Graphics (Jim Clark) 未来的创始人。 1974 年至 1978 年，他担任加州理工学院计算机科学系 Fletcher Jones 教授，并担任该学院计算机科学系的创始系主任。 SketchpadSketchpad 是一个创新程序，影响了与计算机交互的其他形式。 画板可以接受线段和圆弧之间的约束和指定关系，包括圆弧的直径。它可以绘制水平线和垂直线，并将它们组合成图形和形状。可以复制、移动、旋转图形或调整图形大小，同时保留其基本属性。画板还拥有第一个窗口绘制程序和剪切算法，允许缩放。 苏泽兰的名言 “It’s not an idea until you write it down.” 想法在写下来之前，不是一个想法 “I just need to figure out how things work.” 我只需要弄清楚事情是如何运作的 “It’s very satisfying to take a problem we thought difficult and find a simple solution. The best solutions are always simple.” 解决我们认为困难的问题并找到一个简单的解决方案是非常令人感到满足的。最好的解决方案总是简单的。 “Never underestimate the power of the professorial windbag;” 不要低估教授们空谈的威力 “Interesting colleagues are essential.” 有趣的同事是必不可少的 “If it isn’t fun, you’re doing the wrong technology.” 如果它不有趣，那么你就使用了错误的技术 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu2023/posts/51db16f7/"},{"title":"图灵奖：史蒂芬·库克（1982）","text":"图灵奖是计算机界最负盛名的奖项，有“计算机界诺贝尔奖”之称。”图灵奖”系列将介绍历届获奖者。每周二更新，本文为第 20 期。图灵奖：史蒂芬·库克（1982） 文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 本文来自 wiki:Stephen Cook，翻译基于 谷歌翻译. P=NP？ 史蒂芬·库克（生于 1939 年 12 月 14 日）是一位美籍加拿大计算机科学家和数学家，在复杂性理论（complexity theory）和证明复杂性（proof complexity）领域做出了重大贡献。他现在是多伦多大学计算机科学系和数学系的大学教授。 他于 1982 年获得图灵奖。 其图灵奖颁奖词为“表彰他以重大而深刻的方式增进了我们对计算复杂性的理解。他在 1971 年 ACM SIGACT 计算理论研讨会上发表的开创性论文“定理证明过程的复杂性”为 NP 完备性理论奠定了基础。随后对 NP 完全类问题的边界和性质的探索是过去十年中计算机科学中最活跃和最重要的研究活动之一”。（For his advancement of our understanding of the complexity of computation in a significant and profound way. His seminal paper, “The Complexity of Theorem Proving Procedures,” presented at the 1971 ACM SIGACT Symposium on the Theory of Computing, laid the foundations for the theory of NP-Completeness. The ensuing exploration of the boundaries and nature of NP-complete class of problems has been one of the most active and important research activities in computer science for the last decade.） 生平库克于 1961 年在密歇根大学获得学士学位，并分别于 1962 年和 1966 年在哈佛大学数学系获得硕士和博士学位。 他于 1966 年加入加州大学伯克利分校数学系，担任助理教授，直到 1970 年他拒绝了续聘。 在庆祝伯克利电气工程和计算机科学系成立 30 周年的演讲中，图灵奖得主、伯克利教授理查德·卡普 (Richard Karp) 表示：“我们无法说服数学系给予他终身教职，这是我们永远的耻辱。 ” 库克于 1970 年加入多伦多大学计算机科学和数学系，担任副教授，并于 1975 年晋升为教授，于 1985 年晋升为杰出教授。 P/NP 问题在攻读博士学位期间，库克研究了函数的复杂性，尤其是乘法。 在他 1971 年的开创性论文“定理证明程序的复杂性”（The Complexity of Theorem Proving Procedures）中，库克形式化了多项式时间归约（也称为库克归约）和 NP 完备性的概念，并通过证明布尔可满足性问题（通常称为 SAT）是 NP 完全的来证明了 NP 完全问题的存在性。该定理同时由苏联的列昂尼德·莱文（Leonid Levin）独立证明，因此被命名为库克-莱文定理。 这篇论文还阐述了计算机科学中最著名的问题，即 P/NP 问题（P versus NP problem）。通俗地说，P/NP 问题询问每个优化问题的答案是否可以通过有效的算法验证正确性/最优性。鉴于日常生活中存在大量此类优化问题，对P/NP问题的积极回答可能会产生深远的实践、哲学结论。 库克猜想，存在优化问题（具有易于检查的解决方案）无法通过有效的算法解决，即 P 不等于 NP。 这一猜想引发了计算复杂性理论的大量研究，极大地提高了我们对计算问题的固有难度以及可以有效计算的内容的理解。然而，这个猜想仍然存在，并且是七个著名的千禧年问题之一。 贡献 NP-completeness Propositional proof complexity complexity theory ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu2023/posts/230bdb3b/"},{"title":"图灵奖：唐纳德·尔文·克努斯（高德纳，1974）","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 图灵奖是计算机界最负盛名的奖项，有“计算机界诺贝尔奖”之称，”图灵奖”系列将介绍历届获奖者。每周二更新，本文为第 10 期。 本文来自 wiki: Donald_Knuth，翻译基于 腾讯交互翻译. 如果你没听过 TAOCP，那么说明你的计算机知识水平还有很大的进步空间。 唐纳德·尔文·克努斯（中文名“高德纳”，Donald Ervin Knuth）出生于 1938 年 1 月 10 日，是美国计算机科学家、数学家，斯坦福大学名誉教授。他被称为“算法分析之父”，是 1974 年 ACM 图灵奖的获得者。 其图灵奖颁奖词为“表彰他对算法分析和编程语言设计的突出贡献，特别是他通过著作对“计算机程序设计艺术”的贡献，。”（For his major contributions to the analysis of algorithms and the design of programming languages, and in particular for his contributions to the “art of computer programming” through his well-known books in a continuous series by this title）。 他是多卷本著作《计算机程序设计艺术》（TAOCP）的作者，借其推动了算法计算复杂性的严格分析和系统化形式数学技术的发展。此书仍在创作！在著书过程中，他还推广了大 O 符号（渐进符号，asymptotic notation）。 高德纳还是 TeX 计算机排版系统，METAFONT 字体定义语言和渲染系统，以及计算机现代字体簇的创建者。另外，他还创建了 WEB 和 CWEB 计算机编程系统，旨在鼓励和促进文学编程（literate programming），并设计了 MIX/MMIX 指令集架构。 生平Knuth 于 1938 年出生于威斯康星州密尔沃基。 1956 年获得了位于俄亥俄州克利夫兰的凯斯理工学院（现为凯斯西储大学的一部分）的物理学奖学金，并入学。在校学习物理学时，Knuth 接触到了早期的商用计算机 IBM 650。阅读计算机手册后，Knuth 决定为他学校使用的机器重写汇编和编译代码。 随后他从物理学转向数学，并于 1960 年毕业时，由于他的杰出表现，同时获得学士与硕士学位。 1963 年，在数学家 Marshall Hall 的指导下，Knuth 以论文《有限半场与射影平面》（Finite Semifields and Projective Planes）获得加州理工学院数学博士学位。 获得博士学位后，Knuth 以助理教授的身份加入了加州理工学院。 1969 年，Knuth 离开并加入斯坦福大学。 贡献 The Art of Computer Programming 《计算机程序设计艺术》 TeX, METAFONT, Computer Modern 排版系统，字体 Knuth’s up-arrow notation Knuth 的向上箭头表示法，非常大的整数 Knuth–Morris–Pratt algorithm 字符串搜索算法 Knuth–Bendix completion algorithm 一种半决策算法 MMIX RISC 指令集 Robinson–Schensted–Knuth correspondence LR parser Literate programming ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~","link":"/kewenlu2023/posts/cad6d486/"},{"title":"图灵奖：埃德加·弗兰克·科德（1981）","text":"图灵奖是计算机界最负盛名的奖项，有“计算机界诺贝尔奖”之称。”图灵奖”系列将介绍历届获奖者。每周二更新，本文为第 19 期。图灵奖：埃德加·弗兰克·科德（1981） 文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 本文来自 wiki:Edgar F. Codd，翻译基于 谷歌翻译. 埃德加·弗兰克·科德生于 1923 年 8 月 19 日，是一位英国计算机科学家。在为 IBM 工作期间，科德发明了数据库管理的关系模型，这是关系数据库和关系数据库管理系统的理论基础。 他于 1981 年获得图灵奖。 其图灵奖颁奖词为“表彰他对数据库管理系统的理论和实践做出的基础性和持续性贡献”。（For his fundamental and continuing contributions to the theory and practice of database management systems.） 生平科德出生于英格兰多塞特郡。 在第二次世界大战期间担任英国皇家空军海岸司令部的飞行员。 1948 年，他搬到纽约，在 IBM 担任数学程序员。 1953 年，在参议员约瑟夫·麦卡锡的激怒下，科德搬到了加拿大安大略省渥太华。 1957 年，他回到美国，在 IBM 工作，并于 1961 年至 1965 年在安娜堡的密歇根大学攻读计算机科学博士学位 两年后，他搬到加利福尼亚州圣何塞，在 IBM 的圣何塞研究实验室工作，并一直工作到 80 年代。 2003年4月18日，科德在佛罗里达州威廉姆斯岛的家中因心力衰竭去世，享年79岁。 贡献 Alpha language Database normalization OLAP Relational model ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu2023/posts/ebdab122/"},{"title":"图灵奖：威廉·卡韩（1989）","text":"图灵奖是计算机界最负盛名的奖项，有“计算机界诺贝尔奖”之称。”图灵奖”系列将介绍历届获奖者。每周二更新，本文为第 29 期。图灵奖：威廉·卡韩（1989） 文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 本文来自 wiki:William Kahan，翻译基于 谷歌翻译. 浮点数之父 威廉·莫顿·卡韩（William Morton Kahan，1933 年 6 月 5 日出生）是一位加拿大数学家和计算机科学家。 他于 1989 年获得图灵奖。 其图灵奖颁奖词为“表彰他对数值分析的基本贡献。浮点计算领域最重要的专家之一。卡韩致力于‘让数值计算的世界变得安全！’”。（For his fundamental contributions to numerical analysis. One of the foremost experts on floating-point computations. Kahan has dedicated himself to “making the world safe for numerical computations!”） 生平卡韩出生于加拿大，就读于多伦多大学，于 1954 年获得学士学位，1956 年获得硕士学位，1956 年获得博士学位，且专业方向全部为数学。 他现在是加州大学伯克利分校数学、电气工程和计算机科学 (EECS) 名誉教授。 浮点数卡韩是浮点计算 IEEE 754-1985 标准，以及与基数无关的后续标准 IEEE 854，背后的主要架构师。 他被称为“浮点之父”，因为他在创建原始 IEEE 754 规范方面发挥了重要作用。 而后继续对 IEEE 754 修订版做出贡献，最终形成了当前的 IEEE 754 标准。 他还开发了卡韩求和算法，这是一种在将有限精度浮点数相加时引入的误差最小化的重要算法。 贡献 IEEE 754 Kahan summation algorithm the term “Table-maker’s dilemma” ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu2023/posts/6c602883/"},{"title":"图灵奖：尤里斯·哈特马尼斯（1993）","text":"图灵奖是计算机界最负盛名的奖项，有“计算机界诺贝尔奖”之称。”图灵奖”系列将介绍历届获奖者。每周二更新，本文为第 32 期。图灵奖：尤里斯·哈特马尼斯（1993） 文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 本文来自 wiki:Juris_Hartmanis，翻译基于 谷歌翻译. 计算复杂性理论（Computational complexity theory） 尤里斯·哈特马尼斯，（Juris Hartmanis，1928 年 7 月 5 日~ 2022 年 7 月 29 日），是一位出生于拉脱维亚的美国计算机科学家和计算理论家。 他与 Richard E. Stearns 一起获得了 1993 年 ACM 图灵奖。 其图灵奖颁奖词为“与理查德·E·斯特恩斯 (Richard E. Stearns) 合作，表彰他们为计算复杂性理论领域奠定基础的开创性论文”。（*With Richard E. Stearns, in recognition of their seminal paper which established the foundations for the field of computational complexity theory.*） 生平哈特马尼斯于 1928 年 7 月 5 日出生于拉脱维亚。他是拉脱维亚陆军将军马蒂斯·哈特马尼斯的儿子。他是诗人阿斯特丽德·伊瓦斯克的弟弟。 1940 年苏联占领拉脱维亚后，马蒂斯·哈特马尼斯被苏联逮捕并死在监狱中。 第二次世界大战后期，他的遗孀和孩子于 1944 年作为难民离开拉脱维亚。 他们首先搬到了德国，Juris Hartmanis 在那里获得了马尔堡大学物理学硕士学位的同等学位。 随后，他移居美国，于 1951 年在堪萨斯城大学（现称为密苏里大学堪萨斯城分校）获得应用数学硕士学位，并于 1955 年在 Robert P. Dilworth 的指导下获得加州理工学院数学博士学位。 随后，在康奈尔大学和俄亥俄州立大学教授数学后，Hartmanis 于 1958 年加入通用电气研究实验室。在通用电气期间，他发展了计算复杂性理论的许多原理。 1965年，他成为康奈尔大学教授。 他是该校计算机科学系（世界上最早的计算机科学系之一）的创始人之一和第一任系主任。 哈特马尼斯于 2022 年 7 月 29 日去世。 计算复杂性理论（Computational complexity theory）计算复杂性理论（Computational complexity theory）是理论计算机科学和数学的一个分支，它致力于将可计算问题根据它们本身的复杂性分类，以及将这些类别联系起来。一个可计算问题被认为是一个原则上可以用计算机解决的问题，亦即这个问题可以用一系列机械的数学步骤解决，例如算法。 1993 年，Hartmanis 和 R.E. 斯特恩斯获得了计算机科学领域的最高奖——图灵奖。 他们的论文定义了复杂性类的基本概念，这是一种根据解决计算问题所需的时间对计算问题进行分类的方法。 他们继续证明了许多基本结果，例如时间层次定理（Time hierarchy theorem）。 理查德·M·卡普 (Richard M. Karp) 在他自己的图灵奖演讲中指出，“Juris Hartmanis 和 Richard Stearns 于 1965 年发表的论文标志着复杂性理论现代时代的开始。” ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu2023/posts/50cb0fc9/"},{"title":"图灵奖：尼克劳斯·维尔特（1984）","text":"图灵奖是计算机界最负盛名的奖项，有“计算机界诺贝尔奖”之称。”图灵奖”系列将介绍历届获奖者。每周二更新，本文为第 23 期。图灵奖：尼克劳斯·维尔特（1984） 文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 本文来自 wiki:Niklaus Wirth，翻译基于 谷歌翻译. 他的书 “Algorithms + Data Structures = Programs”（算法+数据结构=程序）是计算机科学的名句。 尼克劳斯·埃米尔·维尔特（德语：Niklaus Emil Wirth，1934年2月15日—）是一位瑞士计算机科学家。 他设计了包括 Pascal 在内的多种编程语言，并开创了软件工程中的多个经典主题。 他于 1984 年获得图灵奖。 其图灵奖颁奖词为“开发一系列创新计算机语言：EULER、ALGOL-W、MODULA 和 PASCAL。 PASCAL 在教学上具有重要意义，并为未来的计算机语言、系统和体系结构研究提供了基础。”。（For developing a sequence of innovative computer languages, EULER, ALGOL-W, MODULA and PASCAL. PASCAL has become pedagogically significant and has provided a foundation for future computer language, systems, and architectural research.） 生平Wirth 1934 年出生于瑞士温特图尔。1959 年，他获得瑞士苏黎世联邦理工学院 (ETH Zürich) 电子工程理学学士学位。 1960 年，他获得加拿大拉瓦尔大学理学硕士学位。1963年，他获得加州大学伯克利分校电气工程和计算机科学博士学位，师从计算机设计先驱哈里·赫斯基（Harry Huskey）。 1968 年，他成为苏黎世联邦理工学院信息学教授，并在加州施乐帕洛阿尔托研究中心休了两次为期一年的休假（1976-1977 年和 1984-1985 年）。 1999年退休。 贡献（各种编程语言）Wirth 是以下编程语言的主设计师， Euler (1965)、 PL360 (1966)、 ALGOL W (1966)、 Pascal (1970)、 Modula (1975)、 Modula-2 (1978)、 Oberon (1987)、 Oberon-2 (1991)、 Oberon-07 (2007) 他还是下列操作系统团队的主要成员， Medos-2（1983 年，Lilith 工作站） Oberon（1987 年，Ceres 工作站） Lola（1995 年）数字硬件设计和实施 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu2023/posts/86214005/"},{"title":"图灵奖：巴特勒·兰普森（1992）","text":"图灵奖是计算机界最负盛名的奖项，有“计算机界诺贝尔奖”之称。”图灵奖”系列将介绍历届获奖者。每周二更新，本文为第 32 期。图灵奖：巴特勒·兰普森（1992） 文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 本文来自 wiki:Butler Lampson，翻译基于 谷歌翻译. Alto系统 巴特勒·兰普森（Butler W. Lampson），生于 1943 年 12 月 23 日，是一位美国计算机科学家，因其对分布式个人计算的开发和应用的贡献而闻名。 他于 1992 年获得图灵奖。 其图灵奖颁奖词为“为分布式个人计算环境及其实现技术的开发做出贡献：工作站、网络、操作系统、编程系统、显示、安全和文档发布”。（*For contributions to the development of distributed, personal computing environments and the technology for their implementation: workstations, networks, operating systems, programming systems, displays, security and document publishing.*） 生平兰普森 1964 年获得哈佛大学物理学学士学位，并于 1967 年获得加州大学伯克利分校电气工程和计算机科学博士学位。 完成博士学位后，兰普森留在加州大学伯克利分校担任计算机科学助理教授（1967-1970）和副教授（1970-1971）。 1971 年，兰普森成为 Xerox PARC 的创始成员之一，在计算机科学实验室 (CSL) 担任首席科学家 (1971-1975) 和高级研究员 (1975-1983)。 1983 年，兰普森跟随他们的长期同事来到了数字设备公司的系统研究中心。 1995 年，兰普森前往微软研究院工作至今。 自 1987 年以来，兰普森一直担任麻省理工学院电气工程和计算机科学系的兼职教授。 贡献他著名的个人电脑的愿景被记录在 1972 年题为“为什么选择 Alto？”的备忘录中。 而后 1973 年，配备三键鼠标和全页显示器的 Xerox Alto 诞生，这被认为是第一台真正的的个人计算机。 在帕洛阿尔托研究中心（PARC），兰普森还协助研究了许多其他革命性技术，例如 激光打印机设计 两阶段提交协议 Bravo，第一个所见即所得文本格式化程序 以太网：第一个高速局域网（LAN） 多种有影响力的编程语言，例如 Euclid ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu2023/posts/f3bd70cd/"},{"title":"图灵奖：托尼·霍尔（1980）","text":"图灵奖是计算机界最负盛名的奖项，有“计算机界诺贝尔奖”之称。”图灵奖”系列将介绍历届获奖者。每周二更新，本文为第 18 期。图灵奖：托尼·霍尔（1980） 文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 本文来自 wiki:Tony Hoare，翻译基于 谷歌翻译. 快排，霍尔逻辑，空指针，ALGOL，哲学家就餐！大神啊！ 托尼·霍尔爵士（Sir Charles Antony Richard Hoare）生于 1934 年 1 月 11 日），是一位英国计算机科学家，对编程语言、算法、操作系统、形式验证和并发计算做出了基础性贡献。 霍尔在 1959-1960 年开发了排序算法快速排序。然后开发了霍尔逻辑，这是验证程序正确性的公理基础。在并发语义中，他引入了形式语言通信顺序过程（CSP）来指定并发过程的交互，并与 Edsger Dijkstra 一起提出了哲学家就餐问题。 他还因空指针的开发（以及后来的自我批评）而受到赞誉，并将其引入了 ALGOL 系列语言中。 自 1977 年以来，他一直在牛津大学和剑桥微软研究院任职。 他于 1980 年获得图灵奖。 其图灵奖颁奖词为“表彰他对编程语言的定义和设计的基本贡献。”。（For his fundamental contributions to the definition and design of programming languages.） 生平托尼·霍尔 1934 年出生于锡兰科伦坡（现斯里兰卡），父母是英国人。 霍尔在英国本土接受教育。先是在英国牛津的 Dragon School 和坎特伯雷的 King’s School，而后在牛津的默顿学院（Merton College）学习古典学和哲学（“Greats”）。 1956 年毕业后，他在皇家海军服役了 18 个月，在那里他学习了俄语。 1958 年，他回到牛津大学，攻读统计学研究生（postgraduate）。正是在这里，他开始了计算机编程，由莱斯利·福克斯 (Leslie Fox) 在 Ferranti Mercury 上教学自动编码。然后，他作为英国文化协会交换生前往莫斯科国立大学，在那里，他在安德烈·科尔莫戈洛夫 (Andrey Kolmogorov) 的指导下学习机器翻译。 1960 年，霍尔离开苏联，开始在 Elliott Brothers 公司工作，这是一家位于伦敦的小型计算机制造公司。在那里，他实现了 ALGOL 60 语言并开始开发主要算法。 作为国际信息处理联合会 (IFIP) 算法语言和微积分工作组 2.1 的成员，他参与了编程和信息学方面的国际标准的制定。该工作组指定、维护和支持 ALGOL 60 和 ALGOL 68 语言。 1968 年，他成为贝尔法斯特女王大学计算机科学教授，并于 1977 年 Christopher Strachey 去世后，作为计算机教授返回牛津大学，领导牛津大学计算机实验室（现为牛津大学计算机科学系）的编程研究小组。他现在是该校的名誉教授，也是英国剑桥微软研究院的首席研究员。 在 2009 年的一次软件会议上，霍尔为发明空引用而道歉。 贡献 Quicksort Quickselect Hoare 逻辑 Structured Programming 形式语言通信顺序过程（CSP） ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu2023/posts/4089fec3/"},{"title":"图灵奖：查尔斯·巴赫曼（1973）","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 图灵奖是计算机界最负盛名的奖项，有“计算机界诺贝尔奖”之称，”图灵奖”系列将介绍历届获奖者。每周二更新，本文为第 9 期。 本文来自 wiki: Charles_Bachman，翻译基于 腾讯交互翻译. 查尔斯·威廉·巴赫曼三世（Charles William Bachman III，1924年12月11日-2017年7月13日），美国计算机科学家，他的整个职业生涯都是作为工业研究员、开发人员和管理人员，而并非在学术界。他以在数据库管理系统的早期开发方面的工作闻名，包括以他命名的分层架构技术——巴赫曼图。 其图灵奖颁奖词为“表彰他对数据库技术的杰出贡献”（For his outstanding contributions to database technology）。 生平查尔斯·巴赫曼 1924 年出生于堪萨斯州曼哈顿，他的父亲小查尔斯·巴赫曼在是堪萨斯州立大学的橄榄球队主教练。 在第二次世界大战中，他加入了美国陆军，期间在防空炮兵部队服役时，他第一次接触并使用火力控制计算机来瞄准 90 毫米火炮。 1946 年退伍后，他进入密歇根州立大学，并获得机械工程学士学位。 此后他就读于宾夕法尼亚大学，于 1950 年获得了机械工程硕士学位。 巴赫曼于 2017 年 7 月 13 日因帕金森病，在马萨诸塞州列克星敦的家中去世，享年92岁。 贡献 集成数据存储 (IDS) IDS 在磁盘上维护了一组共享文件，以及用于构建和维护它们的工具。负责特定任务（例如计费或库存更新）的程序通过向 IDS 发送请求来检索和更新这些文件。 IDS 为应用程序程序员提供了一组强大的命令来操作数据，这是很快被称为数据操作语言的早期表达。 巴赫曼信息系统公司 该公司开发了一系列计算机辅助软件工程 (CASE) 产品。这些产品的核心是 BACHMAN/Data Analyst，它为 Bachman 图的创建和维护提供图形支持 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~","link":"/kewenlu2023/posts/c3319c64/"},{"title":"图灵奖：理查德·卡普（1985）","text":"图灵奖是计算机界最负盛名的奖项，有“计算机界诺贝尔奖”之称。”图灵奖”系列将介绍历届获奖者。每周二更新，本文为第 24 期。图灵奖：理查德·卡普（1985） 文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 本文来自 wiki:Richard M. Karp，翻译基于 谷歌翻译. 理查德·曼宁·卡普（Richard Manning Karp，1935 年 1 月 3 日出生）是一位美国计算机科学家和计算理论家，因在 NP 完备性理论和应用、构建高效组合算法以及在计算机科学中应用概率方法方面做出的重大贡献而知名。 他于 1985 年获得图灵奖。 其图灵奖颁奖词为“表彰他对算法理论的持续贡献，包括开发网络流和其他组合优化问题的有效算法、用算法效率的直观概念识别多项式时间可计算性，以及最值得注意的是对NP-完整性理论的贡献。Karp 引入了现在的标准方法来证明问题是 NP 完全的，这导致许多理论和实际问题在计算上是困难的。”。（For his continuing contributions to the theory of algorithms including the development of efficient algorithms for network flow and other combinatorial optimization problems, the identification of polynomial-time computability with the intuitive notion of algorithmic efficiency, and, most notably, contributions to the theory of NP-completeness. Karp introduced the now standard methodology for proving problems to be NP-complete which has led to the identification of many theoretical and practical problems as being computationally difficult.） 生平Karp 出生于波士顿马萨诸塞州。 他 1955 年于哈佛大学获得学士学位，1956 年获得硕士学位，1959 年获得应用数学博士学位。随后，在 IBM 的 Thomas J. Watson 研究中心开始工作。 1968年，他成为加州大学伯克利分校计算机科学、数学和运筹学教授。 除了在华盛顿大学担任教授四年外，从 1988 年到 1995 年以及 1999 年至今，他一直留在伯克利大学。他还担任伯克利国际计算机科学研究所的研究科学家，目前领导该研究所的算法小组。 2012 年，卡普成为加州大学伯克利分校西蒙斯计算理论研究所的创始主任。 研究工作 1962 年，他与 Michael Held 共同开发了 Held-Karp 算法，这是一种针对旅行商问题的精确指数时间算法 1971 年，他与 Jack Edmonds 共同开发了 Edmonds-Karp 算法，用于解决网络上的最大流问题，并于 1972 年发表了复杂性理论中具有里程碑意义的论文“组合问题的可归约性”，其中他证明了 21 个问题 NP 完全 1973 年，他和 John Hopcroft 发表了 Hopcroft-Karp 算法，这是已知在二部图中查找最大基数匹配的最快方法 1980 年，卡普与理查德·J·利普顿 (Richard J. Lipton) 一起证明了卡普-利普顿定理（该定理证明，如果 SAT 可以通过具有多项式逻辑门数的布尔电路来求解，则多项式层次结构会崩溃到第二层） 1987 年，他与 Michael O. Rabin 共同开发了 Rabin-Karp 字符串搜索算法 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu2023/posts/b8a6ce51/"},{"title":"图灵奖：理查德·斯特恩斯（1993）","text":"图灵奖是计算机界最负盛名的奖项，有“计算机界诺贝尔奖”之称。”图灵奖”系列将介绍历届获奖者。每周二更新，本文为第 32 期。图灵奖：理查德·斯特恩斯（1993） 文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 本文来自 wiki:Richard E. Stearns，翻译基于 谷歌翻译. 计算复杂性理论（Computational complexity theory） 理查德·斯特恩斯，（Richard Edwin Stearns， 1936 年 7 月 5 日出生），美国计算机科学家。 他与 Juris Hartmanis 一起获得了 1993 年 ACM 图灵奖。 其图灵奖颁奖词为“与尤里斯·哈特马尼斯 (Juris Hartmanis) 合作，表彰他们为计算复杂性理论领域奠定基础的开创性论文”。（*With Juris Hartmanis, in recognition of their seminal paper which established the foundations for the field of computational complexity theory.*） 生平斯特恩斯于 1958 年获得卡尔顿学院数学学士学位，获得博士学位。 1961 年，在哈罗德·W·库恩 (Harold W. Kuhn) 的指导下完成题为“无额外支付的三人合作游戏”（Three person cooperative games without side payments）的博士论文后，获得普林斯顿大学数学博士学位。 斯特恩斯现在是纽约州立大学奥尔巴尼大学计算机科学系的杰出名誉教授。 计算复杂性理论（Computational complexity theory）计算复杂性理论（Computational complexity theory）是理论计算机科学和数学的一个分支，它致力于将可计算问题根据它们本身的复杂性分类，以及将这些类别联系起来。一个可计算问题被认为是一个原则上可以用计算机解决的问题，亦即这个问题可以用一系列机械的数学步骤解决，例如算法。 1993 年，Hartmanis 和 R.E. 斯特恩斯获得了计算机科学领域的最高奖——图灵奖。 他们的论文定义了复杂性类的基本概念，这是一种根据解决计算问题所需的时间对计算问题进行分类的方法。 他们继续证明了许多基本结果，例如时间层次定理（Time hierarchy theorem）。 理查德·M·卡普 (Richard M. Karp) 在他自己的图灵奖演讲中指出，“Juris Hartmanis 和 Richard Stearns 于 1965 年发表的论文标志着复杂性理论现代时代的开始。” ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu2023/posts/e997b43c/"},{"title":"图灵奖：理查德·汉明（1968）","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 图灵奖是计算机界最负盛名的奖项，有“计算机界诺贝尔奖”之称，”图灵奖”系列将介绍历届获奖者。每周二更新，本文为第 4 期。 本文来自 wiki: Richard Hamming，翻译基于 腾讯交互翻译. 理查德·卫斯理·汉明（英语：Richard Wesley Hamming，1915 年2 月 11 日-1998 年 1 月 7 日）是一位美国数学家，他的工作对计算机工程和电信领域有深远影响。 “汉明码”系列应用是他的主要贡献。 出生于芝加哥的汉明曾就读于芝加哥大学、内布拉斯加大学和伊利诺伊大学香槟分校，并在瓦尔德马·特日津斯基（Waldemar Trjitzinsky，1901-1973）的指导下完成了数学博士论文。 1945 年 4 月，他加入了 Los Alamos 实验室的曼哈顿计划，在那里他使用 IBM 计算机器编程，求解该计划中的物理学家提供的方程。 1946 年，他离开并加入了贝尔电话实验室。并在接下来的 15 年里，他参与了那些几乎实验室所有的突出成就。1968 年，他因此成为图灵奖的第三位获奖者。 1976 年，从贝尔实验室退休后，汉明在加州州蒙特雷的海军研究生院担任计算机科学的副教授和高级讲师，并致力于教学和写书。在 1997 年 12 月，他发表了他的最后一次演讲。 1998 年 1 月 7 日汉明死于心脏病发作。 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~","link":"/kewenlu2023/posts/b662b17c/"},{"title":"图灵奖：简介","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 图灵奖是计算机界最负盛名的奖项，有“计算机界诺贝尔奖”之称，”图灵奖”系列将介绍历届获奖者。每周二更新，本文为第 1 期。 本文来自wiki：Turing Award 图灵奖（ACM A. M. Turing Award）是由美国计算机协会（ACM）颁发的年度奖项，以表彰获奖者对计算机科学做出的影响深远的重大技术贡献。它被公认为计算机科学领域的最高荣誉，有”计算机界的诺贝尔奖”的俗称。 该奖项是以英国数学家、曼彻斯特大学数学系 reader（这是一种高级头衔，不是读者的意思）艾伦·图灵（Alan Mathison Turing）的名字命名的。图灵通常被认为是理论计算机科学和人工智能的主要开创者。 从 2007 年到 2013 年，该奖项还获得了 25 万美元、由英特尔和谷歌赞助的额外奖金。自 2014 年起，该奖项的奖金为 100 万美元，由谷歌提供资金支持。 1966 年，卡内基梅隆大学（CMU）的艾伦·佩利斯（Alan Perlis）是第一位获奖者。 第一位女性获奖者是 2006 年 IBM 的法兰西斯·艾伦（Frances E. Allen）。 2021 年的最新获奖者是田纳西大学的杰克·唐加拉（Jack J. Dongarra）。 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~","link":"/kewenlu2023/posts/25f18018/"},{"title":"图灵奖：约翰·巴克斯（1977）","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 图灵奖是计算机界最负盛名的奖项，有“计算机界诺贝尔奖”之称，”图灵奖”系列将介绍历届获奖者。每周二更新，本文为第 15 期。图灵奖：约翰·巴克斯（1977） 本文来自 wiki:John Backus，翻译基于 腾讯交互翻译. 约翰·华纳·巴克斯（英语：John Warner Backus，1924 年 12 月 3 日-2007 年 3 月 17 日），美国计算机科学家。他领导的团队发明并实现了 FORTRAN，这是第一种广泛使用的高级编程语言。他也是巴科斯范式（BNF）的提出者，这是一种广泛使用的、用来定义形式语言语法的记号法。 他于 1977 年获得图灵奖。 其图灵奖颁奖词为“对实用高级编程系统设计的深刻、有影响和持久的贡献，特别是通过他在 FORTRAN 方面的工作，以及对编程语言规范化的开创性出版物”。（For profound, influential, and lasting contributions to the design of practical high-level programming systems, notably through his work on FORTRAN, and for seminal publication of formal procedures for the specification of programming languages.） 生平巴克斯 1924 年 12 月 3 日出生于美国宾夕法尼亚州费城。 他曾就读于宾夕法尼亚州波茨敦的希尔学校，但他显然不是一个勤奋的学生。 而后他进入弗吉尼亚大学学习化学，但在那里的学业进行的很艰难，不到一年就因出勤率低而被开除。 随后，他在第二次世界大战期间被征召入伍，并最终获得下士军衔，负责指挥驻扎在佐治亚州斯图尔特堡的防空炮台。 在军事能力测试中获得高分后，陆军派他去匹兹堡大学学习工程学。他后来转到哈弗福德学院的医学预科课程。在医院实习期间，他被诊断出患有颅骨肿瘤，成功切除后还在头部安装了钢板。 在这个过程中，他对数学产生极大兴趣，于是去往哥伦比亚大学学习，并于 1949 年由数学专业获得硕士学位。 1950 年，他加入 IBM，并开始了漫长的工作生涯。 1957 年 4 月他所领导 13 人小组推出全世界第一套高阶电脑语言 FORTRAN，并首次在 IBM 704 计算机上面使用。 1977 年 10 月 17 日在西雅图举行的 ACM 年会上，他获得图灵奖。会中，他发表了“程序设计能从冯诺伊曼形式中解脱出来吗？函数式风格及其程序的代数”（Can Programming be Liberated from the von Neumann Style? A Functional Style and Its Algebra of Programs）演讲，提出了叫做 FP 的函数级编程语言。 他于 1991 年退休，并于 2007 年 3 月 17 日在俄勒冈州阿什兰的家中去世。 贡献 Fortran Backus–Naur form，BNF Function-level programming ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu2023/posts/bf7cc272/"},{"title":"图灵奖：约翰·科克（1987）","text":"图灵奖是计算机界最负盛名的奖项，有“计算机界诺贝尔奖”之称。”图灵奖”系列将介绍历届获奖者。每周二更新，本文为第 27 期。图灵奖：约翰·科克（1987） 文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 本文来自 wiki:John Cocke，翻译基于 谷歌翻译. 中国的老朋友，上过《开讲啦》 约翰·科克（John Cocke，1925 年 5 月 30 日－2002 年 7 月 16 日）,美国计算机科学家，因其对计算机体系结构和优化编译器设计的巨大贡献而受到认可。 他被许多人认为是“RISC 架构之父”。 他于 1987 年获得图灵奖。 其图灵奖颁奖词为“在编译器的设计和理论、大型系统的体系结构以及精简指令集计算机（RISC）的开发方面做出了重大贡献； 发现和系统化现在用于优化编译器的许多基本转换，包括减少运算符强度、消除公共子表达式、寄存器分配、常量传播和死代码消除。”。（For significant contributions in the design and theory of compilers, the architecture of large systems and the development of reduced instruction set computers (RISC); for discovering and systematizing many fundamental transformations now used in optimizing compilers including reduction of operator strength, elimination of common subexpressions, register allocation, constant propagation, and dead code elimination.） 生平科克出生于美国北卡罗来纳州夏洛特。 他于 1946 年在杜克大学获得机械工程学士学位，并于 1956 年获得数学博士学位。 从 1956 年到 1992 年，Cocke 的整个职业生涯都是在 IBM 担任工业研究员。 RISC，精简指令集他的创新最引人注目的项目是 IBM 801 小型计算机。他发现将架构指令集的设计与编译器实际相对简单的指令相匹配可以以低成本实现高性能。 CYK 算法他是CYK算法（C代表Cocke）的发明者之一。 CYK算法（英语：Cocke–Younger–Kasami algorithm，缩写为CYK algorithm）是由约翰·科克，Younger和嵩忠雄共同研究。它是基于动态规划思想设计的一种自底向上语法分析算法，被用来判定任意给定的字符串 $w\\in \\Sigma^$ 是否属于一个上下文无关文法*。 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu2023/posts/7453f851/"},{"title":"图灵奖：约翰·霍普克洛夫特（1986）","text":"图灵奖是计算机界最负盛名的奖项，有“计算机界诺贝尔奖”之称。”图灵奖”系列将介绍历届获奖者。每周二更新，本文为第 25 期。图灵奖：约翰·霍普克洛夫特（1986） 文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 本文来自 wiki:John Hopcroft，翻译基于 谷歌翻译. 中国的老朋友，上过《开讲啦》 约翰·爱德华·霍普克罗夫特（John Edward Hopcroft，1939 年 10 月 7 日出生），美国理论计算机科学家。他的计算理论教科书（也称为灰姑娘书）和数据结构教科书被视为各自领域的标准。他是康奈尔大学计算机科学工程与应用数学 IBM 教授，北京大学计算前沿研究中心联席主任。 他于 1986 年获得图灵奖。 其图灵奖颁奖词为“与 Robert E Tarjan 一起，在算法和数据结构的设计和分析方面取得了基础性成就”。（With Robert E Tarjan, for fundamental achievements in the design and analysis of algorithms and data structures.） 生平约翰·霍普克罗夫特 (John Hopcroft) 1939 年 10 月 7 日出生于华盛顿州西雅图。 约翰在西雅图长大并就读于当地学校。 1961 年在西雅图大学获得学士学位，而后分别于1962年和1964年获得斯坦福大学硕士、博士学位。 约翰的第一份学术工作是担任普林斯顿大学电气工程助理教授。当他的系主任要求他教授计算机科学课程时，他几乎是偶然地成为了一名计算机科学家。 杰夫·厄尔曼（Jeff Ullman）是第一批学生之一，他后来成为他工作的主要合作者（共同获得 2010 年 IEEE 约翰·冯·诺依曼奖）。 他在普林斯顿大学工作了三年，此后一直在康奈尔大学工作。 约翰不仅是一位受人尊敬的研究员，也是一位鼓舞人心的老师。他认为应该要求学生减少选修专业课程。应该允许他们接受广泛的教育，并有更多的自由时间自学。他承认，他在改变大学课程要求方面取得的成功有限，但他仍在尝试。 在中国的痕迹 《开讲啦》有更多内容 中国科学院外籍院士，与北京理工大学、云南大学、重庆大学、上海交通大学、香港科技大学等高校有交集。 2016 年获得友谊奖（中国）。 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu2023/posts/aa8d57f5/"},{"title":"图灵奖：约翰·麦卡锡（1971）","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 图灵奖是计算机界最负盛名的奖项，有“计算机界诺贝尔奖”之称，”图灵奖”系列将介绍历届获奖者。每周二更新，本文为第 7 期。 本文来自 wiki:John_McCarthy，翻译基于 腾讯交互翻译. 约翰·麦卡锡（John McCarthy，1927年9月4日-2011年10月24日），美国计算机科学家和认知科学家。 他是人工智能（AI）这一学科的创始人之一。 麦卡锡的大部分职业生涯都在斯坦福大学度过。 因其在人工智能领域的卓越成就，他被授予 1971 年的图灵奖。 生平约翰·麦卡锡于 1927 年 9 月 4 日出生于马萨诸塞州州波士顿，父亲是爱尔兰移民，母亲是立陶宛犹太移民。 他于 1944 年被加州理工学院录取。但他因体育课的问题被加州理工学院听雪。接下来，他在美国陆军服役后，被加州理工再次录取，并于 1948 年获得学士学位。 在加州理工学院，他听了冯诺依曼的讲座，从此激发了他再后来的努力。 1951 年，他在普林斯顿大学完成了题为“投影算子和偏微分方程”（Projection operators and partial differential equations）的博士论文，并获得博士学位。 贡献他 与人合著的文档创造了“人工智能”（AI）一词； 开发了编程语言系列 Lisp，显著影响了语言ALGOL的设计，推广了分时（time-sharing），并发明了垃圾回收机制。 彩蛋：他是著名的达特茅斯会议参会者之一，你知道其他几位都是谁吗？ ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~","link":"/kewenlu2023/posts/3ff45f0/"},{"title":"图灵奖：罗伯特·塔扬（1986）","text":"图灵奖是计算机界最负盛名的奖项，有“计算机界诺贝尔奖”之称。”图灵奖”系列将介绍历届获奖者。每周二更新，本文为第 25 期。图灵奖：罗伯特·塔扬（1986） 文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 本文来自 wiki:Robert Tarjan，翻译基于 谷歌翻译. 中国的老朋友，上过《开讲啦》 罗伯特·恩德烈·塔扬（Robert Endre Tarjan，1948 年 4 月 30 日出生）是一位美国计算机科学家和数学家。 他是多个图论算法的发现者，包括强连通分量算法，也是展开树和斐波那契堆的共同发明者。 Tarjan 目前是普林斯顿大学计算机科学系 James S. McDonnell 杰出教授。 他于 1986 年获得图灵奖。 其图灵奖颁奖词为“与 John E Hopcroft 一起，在算法和数据结构的设计和分析方面取得了基础性成就”。（With John E Hopcroft, for fundamental achievements in the design and analysis of algorithms and data structures.） 生平塔扬出生于加利福尼亚州波莫纳。小时候，塔扬读了很多科幻小说，并想成为一名天文学家。在阅读《科学美国人》上马丁·加德纳的数学游戏专栏后，他对数学产生了兴趣。 塔扬于 1969 年获得加州理工学院数学学士学位。1971 年在斯坦福大学获得计算机科学硕士学位，1972 年获得计算机科学博士学位（辅修数学），他的博士论文是一种高效的平面算法（An Efficient Planarity Algorithm） 在斯坦福大学，他的导师是 Robert Floyd 和 Donald Knuth。 。 算法和数据结构塔扬以其在图论算法和数据结构方面的开创性工作而闻名。 他的一些著名算法包括 Tarjan 的离线最小公共祖先算法和 Tarjan 的强连通分量算法，他是中位数线性时间选择算法的五位合著者之一。 Hopcroft-Tarjan 平面度测试算法是第一个用于平面度测试的线性时间算法。 塔扬还开发了重要的数据结构，例如斐波那契堆（一种由树木组成的堆数据结构）和展开树（一种自我调整的二叉搜索树；由 Tarjan 和 Daniel Sleator 共同发明）。 另一个重要贡献是对不相交集数据结构的分析； 他是第一个证明涉及逆阿克曼函数的最佳运行时间的人。 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu2023/posts/a724ce79/"},{"title":"图灵奖：罗伯特·弗洛伊德（1978）","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 图灵奖是计算机界最负盛名的奖项，有“计算机界诺贝尔奖”之称，”图灵奖”系列将介绍历届获奖者。每周二更新，本文为第 16 期。图灵奖：罗伯特·弗洛伊德（1978） 本文来自 wiki:Robert W. Floyd，翻译基于 谷歌翻译. 知识点：图最短路径算法——弗洛伊德算法 罗伯特·W·弗洛伊德（1936 年 6 月 8 日 - 2001 年 9 月 25 日），美国计算机科学家。他设计了 Floyd-Warshall 算法，该算法可以有效地找到图中的所有最短路径。他在一篇论文中介绍了渲染图像的误差扩散的重要概念，也称为 Floyd–Steinberg 抖动（尽管他区分了抖动和扩散）。他在 1967 年发表的论文《Assigning Meanings to Programs》中开创了使用逻辑断言进行程序验证的领域，这是对后来的 Hoare 逻辑的贡献。 他于 1978 年获得图灵奖。 其图灵奖颁奖词为“对创建高效可靠软件的方法论产生了显著影响，并帮助建立了计算机科学的以下重要子领域：解析理论、编程语言语义、自动程序验证、自动程序合成以及算法分析。”。（For having a clear influence on methodologies for the creation of efficient and reliable software, and for helping to found the following important subfields of computer science: the theory of parsing, the semantics of programming languages, automatic program verification, automatic program synthesis, and analysis of algorithms.） 生平弗洛伊德 1936 年出生于纽约市，14 岁高中毕业。 1953 年（当时年仅 17 岁）在芝加哥大学获得文科学士学位 (B.A.)，并于 1958 年获得物理学的学士学位。 弗洛伊德于 20 世纪 50 年代成为伊利诺伊理工学院装甲研究基金会（现为 IIT 研究所）的一名工作人员。 在 20 世纪 60 年代初成为计算机操作员后，他开始发表许多论文，包括有关编译器（尤其是解析）的论文。他是运算符优先语法的先驱，并因开创了编程语言的语义领域而备受赞赏。 27 岁时，他被任命为卡内基梅隆大学副教授，6 年后成为斯坦福大学正教授。 注意，他是本科。 弗洛伊德与唐纳德·高德纳 (Donald Knuth) 合作密切，是高德纳 (Donald Knuth) 的开创性著作《计算机编程的艺术》(The Art of Computer Programming) 的主要审稿人，并且是该著作中被引用次数最多的人。 而后，他罹患皮克氏病（一种神经退行性疾病），因此于 1994 年初退休。 2001 年 9 月 25 日去世。 他的爱好包括徒步旅行，而且他还是一位狂热的西洋双陆棋玩家。 贡献 Floyd–Warshall algorithm Floyd–Steinberg dithering Floyd’s cycle-finding algorithm Floyd’s triangle ALGOL ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu2023/posts/4e320f50/"},{"title":"图灵奖：罗宾·米尔纳（1991）","text":"图灵奖是计算机界最负盛名的奖项，有“计算机界诺贝尔奖”之称。”图灵奖”系列将介绍历届获奖者。每周二更新，本文为第 31 期。图灵奖：罗宾·米尔纳（1991） 文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 本文来自 wiki:Robin Milner，翻译基于 谷歌翻译. 分时操作系统 亚瑟·约翰·罗宾·戈雷尔·米尔纳 FRS（Arthur John Robin Gorell Milner，FRS，1934 年 1 月 13 日 – 2010 年 3 月 20 日）是一位英国计算机科学家。 他于 1991 年获得图灵奖。 其图灵奖颁奖词为“获得三项独特且完整的成就：1. LCF，斯科特可计算函数逻辑的机制，可能是第一个基于理论且实用的机器辅助证明构建工具；2. ML，第一种包含多态类型推断和类型安全异常处理机制的语言；3. CCS，并发的一般理论。此外，他还提出并大力推进了完全抽象，即操作语义和指称语义之间关系的研究。”。（*For three distinct and complete achievements:1. LCF, the mechanization of Scott’s Logic of Computable Functions, probably the first theoretically based yet practical tool for machine assisted proof construction;2. ML, the first language to include polymorphic type inference together with a type-safe exception-handling mechanism;3. CCS, a general theory of concurrency. In addition, he formulated and strongly advanced full abstraction, the study of the relationship between operational and denotational semantics.*） 生平米尔纳出生于英国普利茅斯附近耶尔普顿的一个军人家庭。 他就读于剑桥大学国王学院，并于 1957 年毕业。 米尔纳先是一名教师，然后在 Ferranti 担任程序员，之后进入伦敦城市大学、斯旺西大学、斯坦福大学的学术界，并从 1973 年开始在爱丁堡大学工作，他是计算机科学基础实验室 (LFCS) 的联合创始人。 1995 年，他回到剑桥，担任计算机实验室的负责人，但最终辞职。 自 2009 年起，米尔纳担任苏格兰信息学与计算机科学联盟高级研究员，并担任（兼职）爱丁堡大学计算机科学系主任。 米尔纳于 2010 年 3 月 20 日在剑桥因心脏病去世。 贡献 LCF，Logic for Computable Functions 最早的自动定理证明（Automated theorem proving, ATP）工具之一 ML 他为LCF开发的语言ML是第一个具有多态类型推断和类型安全异常处理的语言 通信系统演算(CCS)，$\\pi$-演算 分析并发系统的理论框架，即通信系统演算(CCS)及其继承者π演算 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu2023/posts/c9c3354d/"},{"title":"图灵奖：肯·汤普逊（1983）","text":"图灵奖是计算机界最负盛名的奖项，有“计算机界诺贝尔奖”之称。”图灵奖”系列将介绍历届获奖者。每周二更新，本文为第 22 期。图灵奖：肯·汤普逊（1983） 文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 本文来自 wiki:Ken Thompson，翻译基于 谷歌翻译. 所有程序员都知道的 K&amp;R 肯尼思·莱恩·汤普森（Kenneth Lane Thompson，1943 年 2 月 4 日出生）是美国计算机科学先驱，他的大部分职业生涯都在贝尔实验室工作。 他因创建 C 编程语言（名著《K&amp;R》的K）而闻名，并与同事丹尼斯·里奇一起创建了 Unix 操作系统和 B 编程语言。 除了各种下文中赫赫有名的工作，他还有在计算机国际象棋方面的贡献，包括创建残局表库和国际象棋机器 Belle。 他于 1983 年与丹尼斯·里奇一起获得图灵奖。 其图灵奖颁奖词为“与 Dennis M. Ritchie 一起开发了通用操作系统理论并专门用于 UNIX 操作系统的实现”。（With Dennis M. Ritchie, for their development of generic operating systems theory and specifically for the implementation of the UNIX operating system.） 生平Thompson 出生于路易斯安那州的新奥尔良。 他于 1965 年在加州大学伯克利分校获得了电气工程和计算机科学理学学士学位，并于 1966 年获得了硕士学位。 UNIXThompson 于 1966 年受聘于贝尔实验室。在 20 世纪 60 年代，在贝尔实验室，Thompson 和 Dennis Ritchie 致力于 Multics 操作系统的开发。 在编写 Multics 时，Thompson 创建了 Bon 编程语言。后来，贝尔实验室退出了 Multics 项目。为了继续玩游戏，汤普森找到了一台旧的 PDP-7 机器并在上面重写了由他自己开发的视频游戏《太空旅行》。 最终，Thompson 开发的这些工具成就了 Unix 操作系统，包括由 Thompson 和 Ritchie 领导的贝尔实验室研究人员团队在 PDP-7 上开发的分层文件系统、计算机进程和设备的概念 文件、命令行解释器、用于轻松进程间通信的管道以及一些小型实用程序。 B语言在对 Unix 进行初步研究后，Thompson 认为 Unix 需要一种系统编程语言并创建了 B，它是 Ritchie 的 C 的前身。 Go语言自 2006 年以来，Thompson 一直在 Google 工作，与他人共同开发了 Go 编程语言。 UTF-81992年，Thompson与Rob Pike一起开发了UTF-8编码方案。 UTF-8 编码从此成为万维网的主导字符编码，占 2019 年所有网页的 90% 以上。 正则表达式20 世纪 60 年代，Thompson 也开始研究正则表达式。 Thompson 开发了 QED 编辑器的 CTSS 版本，其中包括用于搜索文本的正则表达式。 值得一提的是，他是著名搜索指令 grep 的作者。 贡献 Multics Unix B (programming language) Belle (chess machine) UTF-8 Plan 9 from Bell Labs Inferno (operating system) grep Endgame tablebase Go ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu2023/posts/278b050c/"},{"title":"图灵奖：肯尼斯·艾佛森（1979）","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 图灵奖是计算机界最负盛名的奖项，有“计算机界诺贝尔奖”之称，”图灵奖”系列将介绍历届获奖者。每周二更新，本文为第 17 期。图灵奖：肯尼斯·艾佛森（1979） 本文来自 wiki:Kenneth E. Iverson，翻译基于 谷歌翻译. 肯尼思·尤金·艾弗森（Kenneth Eugene Iverson，1920 年 12 月 17 日—— 2004 年 10 月 19 日），加拿大计算机科学家，因开发编程语言 APL 而闻名。 他于 1979 年获得图灵奖。 其图灵奖颁奖词为“表彰他在编程语言和数学符号方面的开创性努力，以至产生了现在被称为 APL 的计算科学领域；表彰他对交互式系统的实现、APL 的教育应用以及编程语言理论和实践的贡献”。（For his pioneering effort in programming languages and mathematical notation resulting in what the computing field now knows as APL, for his contributions to the implementation of interactive systems, to educational uses of APL, and to programming language theory and practice.） 生平艾佛森于 1920 年 12 月 17 日出生于加拿大阿尔伯塔省中部小镇卡姆罗斯附近。他的父母都是农民。 第二次世界大战期间，他先在加拿大陆军服役，然后在加拿大皇家空军服役。 他于女王大学获得了文学学士学位。 女王大学学士学位。然后于哈佛大学获得硕士和博士学位。 而后先后就职于哈佛大学、IBM、I. P. Sharp Associates 和 Jsoftware 公司。 2004 年 10 月 16 日，艾佛森在新 J 实验室工作时中风，于 2004 年 10 月 19 日在多伦多去世，享年 83 岁。 贡献 编程语言 APL J ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu2023/posts/db29cb16/"},{"title":"图灵奖：艾伦·佩利（1966）","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 图灵奖是计算机界最负盛名的奖项，有“计算机界诺贝尔奖”之称，”图灵奖”系列将介绍历届获奖者。每周二更新，本文为第 2 期。 本文来自 wiki: Alan Perlis，翻译基于 DeepL. 颁奖词：因为他在高级编程技术和编译器构造领域的影响。 艾伦·佩利（1922年4月1日-1990年2月7日）是一位美国计算机科学家，曾任普渡大学、卡内基梅隆大学和耶鲁大学的教授。他因在编程语言方面的开创性工作而闻名，是图灵奖的第一位获得者。 佩利出生在宾夕法尼亚州匹兹堡的一个犹太家庭。他于 1939年 毕业于Taylor Allderdice 高中。1943年，他获得了卡内基技术学院（后来改名为卡内基梅隆大学）的化学学士学位。 二战期间，他在美国陆军服役，在那里他开始对数学感兴趣。随后，他在麻省理工学院（MIT）获得了数学硕士学位（1949 年）和博士学位（1950 年）。他的博士论文的题目是 “On Integral Equations, Their Solution by Iteration and Analytic Continuation”（论积分方程，它们的迭代和解析延拓解法）。 1952 年，他参加了“旋风计划”（Project Whirlwind）。他在普渡大学开始任教，并在 1956 年转到卡内基技术研究所。他是数学系主任，也是计算机科学系的首位负责人。1962 年，他被选为 ACM （国际计算机学会）主席。 佩利在 1966 年被授予首届图灵奖，颁奖词为“因为他在高级编程技术和编译器构建领域的影响”。这源于他在 1956 年所做的关于内部翻译器的工作（Donald Knuth 口中的第一个成功的编译器），以及作为开发编程语言 ALGOL 的团队的成员。 1971 年，佩利搬到耶鲁大学，担任计算机科学系主任，并担任 Eugene Higgins 主任美国。1977 年，他被选为国家工程院院士。 1982 年，他为计算机协会（ACM）的 SIGPLAN 杂志写了一篇文章，“关于编程的箴言”，用“箴言”的形式描述了他在职业生涯中所学到的许多关于编程的东西。后来一直在耶鲁大学工作，直到 1990 年去世。 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~","link":"/kewenlu2023/posts/7d5031d5/"},{"title":"图灵奖：艾伦·纽厄尔（1975）","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 图灵奖是计算机界最负盛名的奖项，有“计算机界诺贝尔奖”之称，”图灵奖”系列将介绍历届获奖者。每周二更新，本文为第 11 期。 本文来自 wiki: Allen_Newell，翻译基于 腾讯交互翻译. 艾伦·纽厄尔（Allen Newell，1927年3月19日-1992年7月19日），美国计算机科学和认知心理学研究员，曾就职于 RAND 公司、卡内基梅隆大学计算机科学学院、Tepper 商学院和心理学系。 他是信息处理语言（IPL）发明者之一，并作为开发者之一，使用该语言编写最早的两个 AI 程序：逻辑理论家（Logic Theorist，首个可以自动进行推理的程序）和一般问题解决器（General Problem Solver）。 1975年他和赫伯特·西蒙（Herbert A. Simon，司马贺）一起因人工智能方面的基础贡献而被授予图灵奖。 其图灵奖颁奖词为“表彰其二十多年的联合科学努力中，最初与J. C. Shaw 在兰德公司，随后与众多师生在卡内基梅隆大学，纽厄尔和共同获奖者赫伯特·西蒙对人工智能、人类认知心理学和列表处理做出了基本贡献”（In joint scientific efforts extending over twenty years, initially in collaboration with J. C. Shaw at the RAND Corporation, and subsequentially with numerous faculty and student colleagues at Carnegie-Mellon University, Newell and co-recipient Herbert A. Simon made basic contributions to artificial intelligence, the psychology of human cognition, and list processing）。 生平纽厄尔于 1949 年在斯坦福大学获得物理学学士学位。 1949 年至 1950 年，他在普林斯顿大学读数学方向的研究生。由于他在研究数学的过程中接触了一个被称为博弈论的未知领域，从而确信他更喜欢实验和理论研究的结合学科而不是纯数学。 1950年，他离开普林斯顿，加入圣莫尼卡的兰德公司，在那里他为“一个研究空军后勤问题的小组（a group that was studying logistics problems of the Air Force）”工作（西蒙）。纽厄尔最终在现在的卡内基梅隆大学泰珀商学院获得博士学位，赫伯特·西蒙担任他的导师。 1954 年 9 月，纽厄尔参加了一个研讨会，奥利弗·塞尔福里奇（Oliver Selfridge）“描述了一个正在运行的计算机程序，该程序学会了识别字母和其他模式”（西蒙）。就在那时，艾伦开始相信系统可能是被创造出来的，智能，并具备自适应的能力。 他的工作引起了赫伯特·西蒙的注意，并与程序员 J. C. Shaw 一起开发了第一个真正的人工智能程序，逻辑理论家（Logic Theorist）。 他们在 1956 年的达特茅斯会议上介绍了该计划。 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~","link":"/kewenlu2023/posts/7c572988/"},{"title":"图灵奖：艾兹赫尔·韦伯·迪杰斯特拉（1972）","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 图灵奖是计算机界最负盛名的奖项，有“计算机界诺贝尔奖”之称，”图灵奖”系列将介绍历届获奖者。每周二更新，本文为第 8 期。 本文来自 wiki: Edsger_Wybe_Dijkstra，翻译基于 腾讯交互翻译. 学过算法的，应该都不会忘记被最短路径（Dijkstra）算法支配的恐惧吧！ Edsger Wybe Dijkstra（1930 年 5 月 11 日- 2002 年 8 月 6 日）是一位荷兰计算机科学家、程序员、软件工程师、系统科学家和科学散文家。他因对开发结构化编程语言的基本贡献而获得 1972 年图灵奖。 其图灵奖颁奖词为“表彰对编程这一高智力挑战的基础性贡献；强有力的主张和切实地证明程序应该正确编写，而不仅仅是调试好；从程序设计的基础上阐明对问题的认识”（For fundamental contributions to programming as a high, intellectual challenge; for eloquent insistence and practical demonstration that programs should be composed correctly, not just debugged into correctness; for illuminating perception of problems at the foundations of program design）。 生平Edsger W. Dijkstra 1930 年出生于荷兰鹿特丹。他的父亲是一位化学家，曾任荷兰化学学会主席，曾在一所中学教化学，后来当了校长。他的母亲是一位数学家，但从未有过正式的工作。 Dijkstra 曾考虑从事法律职业，并希望在联合国代表荷兰。然而，1948 年毕业后，在他父母的建议下，他去往莱顿大学学习数学和物理，到后来的理论物理。 他的计算机生涯是很偶然的。读书期间，Dijkstra 通过他的导师，Johannes Haantjes 教授，他遇到了阿姆斯特丹数学中心计算部的主任Adriaan van Wijngaarden，并在得到了那里的一份工作。于是，在 1952 年 3 月，Dijkstra 正式成为了荷兰第一位“程序员”。 1959 年，他以题为“与自动计算机的通信”（Communication with an Automatic Computer）的论文获得了阿姆斯特丹大学的博士学位，论文描述了为荷兰开发的第一台商用计算机 Electrologica X1 设计的汇编语言。他的论文导师是 Van Wijngaarden。 2002 年 8 月 6 日，Dijkstra 在荷兰尼嫩（Nuenen）自己的家中与世长辞。终年72岁。 贡献 Dijkstra 最短路径算法 避免死锁产生的银行家算法 GOTO 陈述有害论 信号量 哲学家就餐问题 名言 一张图胜过一千个字，而一个公式胜过一千张图 “A picture may be worth a thousand words, a formula is worth a thousand pictures.” 关于没有参考条目这事，我既不解释也不道歉。 “For the absence of a bibliography I offer neither explanation nor apology.” - A Discipline of Programming (1976) 这怪不到麻省理工，毕竟他们没有注意到荷兰小镇上一位默默无闻的计算机科学家。 “You can hardly blame M.I.T. for not taking notice of an obscure computer scientist in a small town in the Netherlands.”~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~","link":"/kewenlu2023/posts/18d0e76/"},{"title":"图灵奖：莫里斯·威尔克斯（1967）","text":"图灵奖：莫里斯·威尔克斯（1967） 文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 图灵奖是计算机界最负盛名的奖项，有“计算机界诺贝尔奖”之称，”图灵奖”系列将介绍历届获奖者。每周二更新，本文为第 3 期。 本文来自 wiki: Maurice Wilkes，翻译基于 DeepL. 莫里斯·文森特·威尔克斯爵士（Sir Maurice Vincent Wilkes FRS FREng）（1913年6月26日-2010年11月29日）是一位英国计算机科学家。他最为知名的工作是设计并制造了第一台具有内部存储程序的计算机，EDSAC。这台计算机建于 1949 年，是最早的存储程序计算机之一。他还发明了微编程，一种使用存储程序逻辑来操作中央处理单元电路的控制单元的方法。另外，他还与 Wheeler 和 Gill 一起在 1951 年编写了著名的《Preparation of Programs for Electronic Digital Computers》一书，该书引入了程序库。 威尔克斯与 EDSAC1945 年，威尔克斯被任命为剑桥大学数学实验室（后来的计算机实验室）的第二任主任。 剑桥的实验室最初有许多不同的计算设备，包括一台微分解析器。有一天，Leslie Comrie 拜访了威尔克斯，并借给他一份 John von Neumann 对EDVAC 的印前描述，这是 ENIAC 的正在建造的后继机。由于没有复印设备，威尔克斯就连夜阅读。这份文件描述了未来计算机的逻辑设计，这让他立即决定，参与这种机器的设计和建造。1946 年 8 月，威尔克斯乘船前往美国，参加摩尔学校的课程。但由于行程的延误，他只参与了最后两周的讲座。在返回英国的五天航程中，威尔克斯比较详细地勾画了一台机器的逻辑结构，而这就是后来的 EDSAC。 由于他的实验室有自己的资金，他一回到剑桥就立即开始了小型实用机器 EDSAC 的工作。他认为，他的任务不是去发明一个更好的计算机，而仅仅是为大学提供一个够用的。因此，他选择了实用的路线——只使用已被证实的方法来建造计算机的每个部分。由此诞生的计算机比其他当代计算机更慢更小。总之，他实验室的这台计算机是自 1949 年 5 月起、第二台成功运行的存储程序式电子计算机，比起规模更大、更复杂的 EDVAC 早了一年多。（根本区别在于前者的实用性） ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~","link":"/kewenlu2023/posts/1ab5d08/"},{"title":"图灵奖：詹姆斯·哈迪·威尔金森（1970）","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 图灵奖是计算机界最负盛名的奖项，有“计算机界诺贝尔奖”之称，”图灵奖”系列将介绍历届获奖者。每周二更新，本文为第 6 期。图灵奖：詹姆斯·哈迪·威尔金森（1970） 本文来自 wiki: James H. Wilkinson，翻译基于 腾讯交互翻译. 詹姆斯·哈迪·威尔金森（James Hardy Wilkinson，1919 年 9 月 27 日-1986 年 10 月 5 日）是一位英国数学家和计算机学家，他对所在的数值分析领域有杰出贡献（数值分析是应用数学与计算机科学的交叉学科，对物理学和工程有重要作用）。 由于他在促进高速数字计算机使用的数值分析方面的研究，并在线性代数计算和“向后”误差分析方面的工作得到了特别的认可，他 被授予 1970 年的图灵奖。 生平詹姆斯·哈迪·威尔金森 1919 年出生于英格兰的 Strood，在 16 岁时获得了剑桥大学三一学院的奖学金，并在 17 岁时开始学习数学。在 20 岁时，它以 Senior Wrangler 身份毕业。 二战期间，1940 年，他从事弹道学的研究。 在 1946 年，他转入国家物理实验室（NPL），并成为阿兰·图灵（Alan Turing）的同事，从事 Pilot ACE（英国最早的计算机之一）项目。并在图灵离开后实现了图灵的设想，完成了 ACE 原型。 往后，威尔金森在数值分析领域发现了许多重要的算法。 贡献 舍入误差 由于计算机使用精度有限的浮点数，因此在计算中会出现舍入误差，这可能会严重影响结果。威尔金森深入研究了此类舍入误差。这对于求解线性方程组特别重要。 Pilot ACE 著作 The Algebraic Eigenvalue Problem 最多被引用 Rounding Errors in Algebraic Processes Handbook for Computation, Volume II, Linear Algebra The Perfidious Polynomial. In: Studies in Numerical Analysis 彩蛋！稀疏矩阵，sparse matrix，这个术语就是他发明的。 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~","link":"/kewenlu2023/posts/446c43db/"},{"title":"图灵奖：费南多·柯巴托（1990）","text":"图灵奖是计算机界最负盛名的奖项，有“计算机界诺贝尔奖”之称。”图灵奖”系列将介绍历届获奖者。每周二更新，本文为第 30 期。图灵奖：费南多·柯巴托（1990） 文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 本文来自 wiki:Fernando J. Corbató，翻译基于 谷歌翻译. 分时操作系统 费南多·荷西·柯巴托（Fernando José “Corby” Corbató，1926 年 7 月 1 日~ 2019 年 7 月 12 日），美国计算机科学家，是分时操作系统开发的先驱。 他于 1990 年获得图灵奖。 其图灵奖颁奖词为“表彰他组织概念并领导通用、大规模、分时和资源共享计算机系统 CTSS 和 Multics 开发的开创性工作”。（For his pioneering work organizing the concepts and leading the development of the general-purpose, large-scale, time-sharing and resource-sharing computer systems, CTSS and Multics.） 生平柯巴托 1926 年 7 月 1 日出生于加利福尼亚州奥克兰。 1943 年，柯巴托就读于加州大学洛杉矶分校，但由于第二次世界大战，他在第1年就被海军招募。 1946 年，柯巴托离开海军，就读于加州理工学院，并于 1950 年获得物理学学士学位。1956 年，他在麻省理工学院获得物理学博士学位。 毕业后，他立即加入麻省理工学院计算中心，1965年成为教授，并留在麻省理工学院直至退休。 柯巴托因糖尿病并发症于 2019 年 7 月 12 日在马萨诸塞州纽伯里波特去世，享年 93 岁。 分时操作系统与 Unix他所涉及的第一个分时系统被称为 MIT 兼容分时系统 (CTSS， Compatible Time-Sharing System)，它的早期版本在1961年被展示。 开发 CTSS 的经验催生了第二个项目 Multics，该项目被通用电气用于其高端计算机系统（后来被霍尼韦尔收购）。 Multics 开创了现代操作系统中使用的许多概念，包括分层文件系统、面向环的安全性、访问控制列表、单级存储、动态链接以及用于可靠服务的可扩展在线重新配置。 虽然 Multics 本身在商业上并不是特别成功，但它直接启发了 Ken Thompson 开发 Unix。 柯巴托定理（Corbató’s Law）：“在一段固定时间内，不管他使用的是什么编程语言，一个程式员能写作的源代码行数是固定的。” ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu2023/posts/4ab1d0bd/"},{"title":"图灵奖：赫伯特·西蒙（司马贺，1975）","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 图灵奖是计算机界最负盛名的奖项，有“计算机界诺贝尔奖”之称，”图灵奖”系列将介绍历届获奖者。每周二更新，本文为第 12 期。 本文来自 wiki: Herbert A. Simon，翻译基于 腾讯交互翻译. 赫伯特·亚历山大·西蒙（英语：Herbert Alexander Simon，1916年6月15日-2001年2月9日），美国政治学家。他的研究以其跨学科性质而闻名，跨越了认知科学，计算机科学，公共行政，管理和政治科学等领域。他的工作影响了计算机科学、经济学和认知心理学领域。 他的主要研究兴趣是组织内的决策，其中最著名的是“有限理性”（bounded rationality）和“满意”（satisficing）理论。 值得注意的是，西蒙是几个现代科学领域的先驱之一，如人工智能、信息处理、决策、问题解决、组织理论和复杂系统。他是最早分析复杂性结构并提出偏好连接机制来解释幂律分布的人之一。 他于 1978 年获得诺贝尔经济学奖，并于 1975 年获得图灵奖。 其图灵奖颁奖词为“在二十多年的联合科学努力中，最初与J. C. Shaw 在兰德公司，以及随后在卡内基梅隆大学的众多教师和学生同事中，西蒙和共同获奖者艾伦·纽韦尔对人工智能、人类认知心理学和列表处理做出了奠基性的贡献。”。（In joint scientific efforts extending over twenty years, initially in collaboration with J. C. Shaw at the RAND Corporation, and subsequentially with numerous faculty and student collegues at Carnegie-Mellon University, Simon and co-recipient Allen Newell made basic contributions to artificial intelligence, the psychology of human cognition, and list processing.） 生平赫伯特·亚历山大·西蒙 1916 年 6 月 15 日出生于威斯康星州密尔沃基。 西蒙就读于密尔沃基公立学校，在那里他对科学产生了兴趣。 1933年，西蒙进入芝加哥大学，并在他早期经历的影响下，决定学习社会科学和数学。（西蒙对研究生物学很感兴趣，但由于色盲的原因放弃） 在大学期间，西蒙专注于政治学和经济学。西蒙最重要的导师是 Henry Schultz，一位计量经济学家和数理经济学家。 西蒙分别于 1936 年和 1943 年获得了政治学的学士、博士学位。 在获得本科学位后，西蒙获得了市政管理的研究助理职位，并于1939年至 1942 年在加州大学伯克利分校担任运筹学研究小组的主任。 1942 年到 1949 年，西蒙是伊利诺伊理工学院的政治学教授，并担任系主任。 1949 年到 2001 年，西蒙担任卡内基梅隆大学的教员。 贡献 决策 基于西蒙的博士论文，《行政行为学》（Administrative Behavior），于 1947 年首次出版，并在多年中不断更新。 人工智能 西蒙是人工智能领域的先驱，他与 Allen Newell 一起创建了逻辑理论机（1956年）和通用问题求解器（GPS）（1957年）程序。 心理学 西蒙与 Edward Feigenbaum 一起开发了 EPAM（Elementary Perceiver and Memorizer）理论，这是第一个以计算机程序实现的学习理论之一。 社会学和经济学 西蒙是微观经济学的变革者，组织决策概念的提出者。他最先严格验证管理人员如何在没有完美和完整的信息时作出决定时。正是在这方面的工作，他于1978 年被授予诺贝尔奖。 教育学 西蒙的工作对 John Mighton 产生了很大的影响，后者开发了一个程序，在提高小学和高中学生的数学成绩方面取得了重大成功。 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu2023/posts/3463527f/"},{"title":"图灵奖：达纳·斯科特（1976）","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 图灵奖是计算机界最负盛名的奖项，有“计算机界诺贝尔奖”之称，”图灵奖”系列将介绍历届获奖者。每周二更新，本文为第 14 期。 本文来自 wiki:Dana Scott，翻译基于 腾讯交互翻译. 达纳·斯图尔特·斯科特（英语：Dana Stewart Scott，1932 年 10 月 11 日-），美国逻辑学家，现为卡内基梅隆大学希尔曼大学计算机科学、哲学和数理逻辑名誉教授。 他在 20 世纪 70 年代与 Christopher Strachey 的合作奠定了现代编程语言语义方法的基础。同时，他还从事模态逻辑，拓扑学和范畴理论的研究。 因在自动机理论方面的工作，斯科特获得了 1976 年的图灵奖。 其图灵奖颁奖词为“与 Michael O. Rabin 联合撰写的论文“有限自动机及其决策问题”，其中介绍了非确定性机器的想法，这已被证明是一个非常有价值的概念。 他们的经典论文一直是该领域后续工作的持续灵感来源”。（Along with Michael O. Rabin, for their joint paper “Finite Automata and Their Decision Problem,” which introduced the idea of nondeterministic machines, which has proved to be an enormously valuable concept. Their (Scott &amp; Rabin) classic paper has been a continuous source of inspiration for subsequent work in this field） 生平1954 年，斯科特于加州大学伯克利分校的数学系获得了学士学位。 在普林斯顿大学，斯科特在 Alonzo Church 指导下，撰写了名为“收敛序列的完整理论”（Convergent Sequences of Complete Theories）的博士论文，并于 1958 年通过答辩。 完成博士学位后，他搬到了芝加哥大学，并在那里担任讲师到 1960 年。 1959 年，他与普林斯顿大学的同事 Michael O. Rabin，发表了题为“有限自动机和他们的决策问题”的论文，在自动机理论中引入了不确定性机器的概念。而这项工作使得二人被联合授予图灵奖。 贡献 自动机理论 笛卡尔幺半群 可计算函数逻辑 程序设计语言语义学 非确定有限自动机 …… （实在看不懂） ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu2023/posts/aeee1d1f/"},{"title":"图灵奖：迈克尔·奥瑟·拉宾（1976）","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 图灵奖是计算机界最负盛名的奖项，有“计算机界诺贝尔奖”之称，”图灵奖”系列将介绍历届获奖者。每周二更新，本文为第 13 期。 本文来自 wiki: Michael O. Rabin，翻译基于 腾讯交互翻译. 迈克尔·奥瑟·拉宾，出生于 1931 年 9 月 1 日，是以色列数学家、计算机科学家。 1976 年他和赫伯特·西蒙（Herbert A. Simon，司马贺）一起因人工智能方面的基础贡献而被授予图灵奖。 其图灵奖颁奖词为“与 Dana S. Scott 一起，他们联合发表了论文“有限自动机及其决策问题”，其中介绍了非确定性机器的想法，这已被证明是一个非常有价值的概念。 他们这篇经典论文一直是该领域后续工作的灵感来源”。（Along with Dana S. Scott, for their joint paper “Finite Automata and Their Decision Problem,” which introduced the idea of nondeterministic machines, which has proved to be an enormously valuable concept. Their (Scott &amp; Rabin) classic paper has been a continuous source of inspiration for subsequent work in this field.） 生平拉宾于 1931 年出生于德国 Breslau（今波兰 Wrocław）。 1935 年，他与家人移民到巴勒斯坦。 1948 年拉宾毕业于 Haifa 的希伯来雷亚里学校，并在 1948 年阿以战争期间应征入伍。 1949 年，由于在耶路撒冷担任数学教授的数学家亚伯拉罕·弗兰克尔（Abraham Fraenkel）的干预，拉宾退伍到大学学习。 拉宾于 1953 年获得耶路撒冷希伯来大学硕士学位，1956 年获得普林斯顿大学博士学位。 就职 Professor, Harvard (Gordon McKay Professor of Computer Science,1981-1983; Thomas J. Watson Sr. Professor of Computer Science 1983); Professor, Hebrew University of Jerusalem (Albert Einstein Chair,1980-1999; Pro-Rector, 1976-1980; Rector (Academic Head) 1972-1975; Chairman, Computer Science Department 1970-1971; Chairman, Institute of Mathematics 1964-1966; Senior Lecturer, Associate Professor and Professor 1958-1965); Institute for Advanced Study, Princeton (1958 Member; H. B. Fine Instructor1956-1958). 贡献 Rabin 密码系统 Rabin 指纹 Rabin 签名算法 Rabin–Karp 字符串搜索算法 不经意传输 非确定有限状态自动机 随机化算法 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu2023/posts/d5bd2347/"},{"title":"图灵奖：马文·闵斯基（1969）","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 图灵奖是计算机界最负盛名的奖项，有“计算机界诺贝尔奖”之称，”图灵奖”系列将介绍历届获奖者。每周二更新，本文为第 5 期。 本文来自 wiki: Marvin Minsky，翻译基于 腾讯交互翻译. 马文·李·明斯基（英语：Marvin Lee Minsky，1927年8月9日-2016年1月24日）是一位美国认知和计算机科学家，MIT 人工智能实验室的联合创始人。 他因在创造、塑造、促进和推进人工智能（AI）领域方面的主导作用获得 1969 年的图灵奖。 生平马文·李·明斯基于 1927 年出生于纽约市的一个犹太人家庭。1950年，他大学毕业于哈佛大学数学系； 1954 年从普林斯顿大学数学系博士毕业。他的博士论文题目是“神经模拟强化系统理论及其在大脑模型问题上的应用”。 1954 年至 1957 年期间，他在哈佛大学研究员协会任初级研究员。而后，自 1958 年到他去世，他一直在麻省理工学院任教。 另外，他在 1958 年加入麻省理工学院林肯实验室的一年后，和约翰·麦卡锡（John McCarthy）开办了麻省理工学院计算机科学和人工智能实验室。 在计算机科学上的贡献 Artificial intelligence learning knowledge representation、 common sense reasoning computer vision robot manipulation cognitive psychology, neural networks, 第一个随机连线神经网络学习机, SNARC 书籍，《Perceptrons》 奠定了人工神经网络（ANN）的研究基础 automata theory, graphics and microscope technology. 首个头戴式图形显示器（1963） 共焦显微镜 1957，是当今广泛使用的共聚焦激光扫描显微镜的前身 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~","link":"/kewenlu2023/posts/c93fd99c/"},{"title":"大佬：2023年诺贝尔化学奖揭晓","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转载须注明出处。科技：2023年诺贝尔化学奖揭晓 自 10 月 2 日起，2023 年诺贝尔奖六大奖项将逐次揭晓。 官方颁奖词.pdf press-chemistryprize2023.pdf “for the discovery and synthesis of quantum dots” “发现和合成量子点” 2023年诺贝尔化学奖奖励量子点的发现和发展，量子点是非常微小的纳米粒子，它们的大小决定了它们的性质。这些纳米技术的最小组成部分现在可以传播电视和LED灯中的光线，还可以指导外科医生切除肿瘤组织，以及其他许多事情。 编者注：量子点，指微小的半导体颗粒，尺寸仅为几纳米。由于量子力学的作用，这些颗粒具有独特的光学和电子特性。它们常被用于电子学、医学和能源等领域，用于显示器、太阳能电池和生物成像等应用。 关于获奖者Moungi G. Bawendi，1961 年出生于法国巴黎。 1988年获得美国伊利诺伊州芝加哥大学（University of Chicago, IL, USA）博士学位。美国马萨诸塞州剑桥市麻省理工学院 (MIT) 教授。 Louis E. Brus，1943 年出生于美国俄亥俄州克利夫兰。 1969年获得美国纽约哥伦比亚大学（Columbia University, New York, NY, USA）博士学位。美国纽约州哥伦比亚大学教授。 Alexei I. Ekimov，1945 年出生于前苏联。 1974 年获得俄罗斯圣彼得堡 Ioffe 物理技术研究所（Ioffe Physical-Technical Institute, Saint Petersburg, Russia）博士学位。曾任美国纽约市 Nanocrystals Technology Inc. 首席科学家。 研究过程在 20 世纪 80 年代初，Alexei Ekimov 成功地在有色玻璃中创造了依赖于尺寸的量子效应。颜色来自氯化铜纳米颗粒，Ekimov 证明颗粒尺寸通过量子效应影响玻璃的颜色。 几年后，Louis Brus 成为世界上第一位证明流体中自由漂浮的粒子的尺寸依赖性量子效应的科学家。1993 年，Moungi Bawendi 彻底改变了量子点的化学生产方式，产生了近乎完美的粒子。这种高质量对于它们在应用中的使用是必要的。 1993 年，Moungi Bawendi 彻底改变了量子点的化学生产方式，产生了近乎完美的粒子。这种高质量对于它们在应用中使用是必要的。 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 赞赏请前往公众号菜单栏~~ 至少点个赞再走吧~","link":"/kewenlu2023/posts/e7e58079/"},{"title":"大佬：2023年诺贝尔和平奖揭晓","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转载须注明出处。 自 10 月 2 日起，2023 年诺贝尔奖六大奖项将逐次揭晓。 官方颁奖词.pdf press-nobelprize2023 “for her fight against the oppression of women in Iran and her fight to promote human rights and freedom for all” “表彰她在伊朗反对压迫妇女的斗争，以及她为促进所有人的人权和自由而进行的斗争” 关于获奖者Narges Mohammadi (Persian: نرگس محمدی; born 21 April 1972) is an Iranian human rights activist and scientist. 纳尔吉斯·穆罕默迪（Narges Mohammadi；波斯语：نرگس محمد）于 1972 年 4 月 21 日出生于伊朗赞詹，在 Qorveh（库尔德斯坦）、卡拉吉和 Oshnaviyeh 长大，是一位伊朗人权活动家和科学家。她是人权捍卫者中心 (DHRC) 的副主席，该中心由诺贝尔和平奖获得者 Shirin Ebadi 领导。 “Woman – Life – Freedom”“Zan – Zendegi – Azadi” 挪威诺贝尔委员会决定将 2023 年诺贝尔和平奖授予纳尔吉斯·穆罕默迪，以表彰她为反对伊朗妇女受压迫以及为促进所有人的人权和自由而进行的斗争。她的勇敢斗争付出了巨大的个人代价。当局总共逮捕了她13次，定罪5次，总共判处她31年监禁和154下鞭笞。此时，穆罕默迪女士仍在监狱中。 示威者采用的座右铭——“女性——生命——自由”——恰当地表达了纳尔吉斯·穆罕默迪的奉献和工作。 女性。她为妇女反对系统性的歧视和压迫而奋斗。 生命。她支持妇女为过上充实而有尊严的生活的权利而奋斗。伊朗各地的斗争遭到了迫害、监禁、酷刑，甚至死亡。 自由。她争取言论自由和独立权，反对要求女性远离公众视线并遮盖身体的规定。示威者表达的自由要求不仅适用于妇女，而且适用于全体人民。 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 赞赏请前往公众号菜单栏~~ 至少点个赞再走吧~","link":"/kewenlu2023/posts/70912802/"},{"title":"大佬：2023年诺贝尔文学奖揭晓","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转载须注明出处。 自 10 月 2 日起，2023 年诺贝尔奖六大奖项将逐次揭晓。 官方颁奖词.pdf press-literatureprize2023.pdf “for his innovative plays and prose which give voice to the unsayable”. “表彰他创作的戏剧和散文道出了不可言说之事” 关于获奖者Jon Fosse（约恩·福瑟，1959年9月25日—）是挪威作家和剧作家。他是继亨里克·易卜生（Henrik Ibsen）之后被出演次数最多的挪威剧作家。Fosse 的作品通常被称为“新易卜生”（new Ibsen），被认为是易卜生在 19 世纪建立的戏剧传统的现代延续。 作品Fosse 用挪威尼诺斯克语写成的作品涵盖多种体裁，包括戏剧、小说、诗集、散文、儿童读物和翻译作品。代表作包括《有人将至》、《死狗》、《我是风》，剧作《有人将至》已被翻译为中文。 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 赞赏请前往公众号菜单栏~~ 至少点个赞再走吧~","link":"/kewenlu2023/posts/2b8c73a8/"},{"title":"大佬：2023年诺贝尔物理学奖揭晓","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转载须注明出处。 自 10 月 2 日起，2023 年诺贝尔奖六大奖项将逐次揭晓。 官方颁奖词.pdf press-physicsprize2023.pdf “for experimental methods that generate attosecond pulses of light for the study of electron dynamics in matter” 表彰用于产生阿秒光脉冲以研究物质中电子动力学的实验方法 三位 2023 年诺贝尔物理学奖获得者因其实验而获得认可，这些实验为人类探索原子和分子内的电子世界提供了新工具。 Pierre Agostini、Ferenc Krausz 和 Anne L’Huillier 展示了一种产生极短光脉冲的方法，可用于测量电子移动或改变能量的快速过程。 关于获奖者Pierre Agostini，1968 年获得法国艾克斯-马赛大学（Aix-Marseille University, France）博士学位。美国哥伦布俄亥俄州立大学（The Ohio State University, Columbus, USA）教授。 Ferenc Krausz，1962 年出生于匈牙利莫尔。1991年获得奥地利维也纳科技大学（Vienna University of Technology, Austria）博士学位。德国加兴马克斯普朗克量子光学研究所（Max Planck Institute of Quantum Optics, Garching）所长、路德维希马克西米利安慕尼黑大学（LMU）教授。 Anne L’Huillier，1958 年出生于法国巴黎。 1986年获得法国巴黎皮埃尔和玛丽居里大学（University Pierre and Marie Curie, Paris, France）博士学位。瑞典隆德大学（Lund University, Sweden）教授。 研究过程1987 年，Anne L’Huillier 发现，当她通过惰性气体传输红外激光时，会产生许多不同的光的谐波。每个谐波都是一个光波，激光中每个周期都有给定的周期数。它们是由激光与气体中的原子相互作用引起的；它给一些电子额外的能量，然后以光的形式发射出来。 Anne L’Huillier 继续探索这一现象，为后续的突破奠定了基础。 2001年，Pierre Agostini成功地产生并研究了一系列连续的光脉冲，其中每个脉冲仅持续250阿秒。与此同时，Ferenc Krausz 正在进行另一种类型的实验，该实验可以分离出持续 650 阿秒的单个光脉冲。 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 赞赏请前往公众号菜单栏~~ 至少点个赞再走吧~","link":"/kewenlu2023/posts/740f0d4a/"},{"title":"大佬：2023年诺贝尔生理学或医学奖揭晓","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转载须注明出处。 自 10 月 2 日起，2023 年诺贝尔奖六大奖项将逐次揭晓。 官方颁奖词.pdf press-medicineprize2023-3.pdf for their discoveries concerning nucleoside base modifications that enabled the development of effective mRNA vaccines against COVID-19 表彰他们在核苷碱基修饰方面的发现，这些发现使得开发针对 COVID-19 的有效 mRNA 疫苗成为可能 两位诺贝尔奖获得者的发现对于在 2020 年初开始的新冠病毒大流行期间开发有效的针对 COVID-19 的 mRNA 疫苗至关重要。他们的突破性发现从根本上改变了我们对 mRNA 如何与免疫系统相互作用的理解，在现代人类健康面临的最大威胁之一期间，获奖者做出的贡献使得疫苗的开发速度前所未有。 关于获奖者卡塔琳·卡里科 (Katalin Karikó) 1955 年出生于匈牙利 Szolnok。她于 1982 年在塞格德大学（Szeged’s University）获得博士学位，并在塞格德的匈牙利科学院从事博士后研究直至 1985 年。随后，她在费城坦普尔大学（Temple University, Philadelphia）和贝塞斯达健康科学大学（the University of Health Science, Bethesda）进行博士后研究。 1989 年，她被任命为宾夕法尼亚大学助理教授，并一直任职到 2013 年。之后，她成为 BioNTech RNA Pharmaceuticals 的副总裁，后来又担任高级副总裁。自2021年起，她一直担任塞格德大学教授和宾夕法尼亚大学佩雷尔曼医学院（Perelman School）兼职教授。 德鲁·韦斯曼 (Drew Weissman) 1959 年出生于美国马萨诸塞州列克星敦（Lexington, Massachusetts）。 1987年，他在波士顿大学获得博士学位（MD，PhD）。他在哈佛医学院贝斯以色列女执事医疗中心（Beth Israel Deaconess Medical Center）接受临床培训，并在美国国立卫生研究院进行博士后研究。 1997年，韦斯曼在宾夕法尼亚大学佩雷尔曼医学院（Perelman School）成立了他的研究小组。罗伯茨家族疫苗研究教授（注：一个终身教授职位）和宾夕法尼亚大学 RNA 创新研究所所长。 关键发表Karikó, K., Buckstein, M., Ni, H. and Weissman, D. Suppression of RNA Recognition by Toll-like Receptors: The impact of nucleoside modification and the evolutionary origin of RNA. Immunity 23, 165–175 (2005). Karikó, K., Muramatsu, H., Welsh, F.A., Ludwig, J., Kato, H., Akira, S. and Weissman, D. Incorporation of pseudouridine into mRNA yields superior nonimmunogenic vector with increased translational capacity and biological stability. Mol Ther 16, 1833–1840 (2008). Anderson, B.R., Muramatsu, H., Nallagatla, S.R., Bevilacqua, P.C., Sansing, L.H., Weissman, D. and Karikó, K. Incorporation of pseudouridine into mRNA enhances translation by diminishing PKR activation. Nucleic Acids Res. 38, 5884–5892 (2010). ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 赞赏请前往公众号菜单栏~~ 至少点个赞再走吧~","link":"/kewenlu2023/posts/199d028d/"},{"title":"尬聊：朋友，光靠工资发不了财！来试试这么做","text":"原答案：没有人靠工资致富 文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。Quora：朋友，光靠工资发不了财！来试试这么做 做自己的老板，你将一天之内挣到你的月薪…… 1. 学习高收入技能每天抽出两小时，专心去构建你自己的专业技能 这样做： 选择一项技能 选择 10-20 个教授技能的视频博主 连续观看 100 天 掌握基础知识，然后积累知识 我推荐这 4 个技能，你可以选择一项技能并培养 3 个月； 销售 编程 文案写作 外汇交易 事实：技能比学位更有价值 10 倍 2. 创建你的圈子扩大你的圈子：选择 3 位朋友，开始自我提升。 让你们的谈话围绕： 钱 成功 商业 注意：成为一名可靠的团队合作者 3. 创造多种收入来源事实：你做不到钱所能为你做的事情 这样， 开设超过 15 种业务 持有资产 装穷 不要存钱，这是骗局。 投资你所有的现金，让钱为你工作。 4. 每天至少花 100 分钟阅读88% 的财务自由者者痴迷于学习。 金融知识是自学的，可以从阅读这些书开始； 《人性18法则》（注：应为 The Laws of Human Nature） 《掌控习惯》（Atomic Habits） 《思考致富》（Think and grow rich） 5. 凌晨 4:00 或 5:00 起床人们害怕早起，但这可以在一天开始前为您节省 3 个小时。 培养成功人士的习惯： 整理你的床 喝一杯水 锻炼/散步 阅读 50 多页 成功隐藏在你的日常生活中。 6. 在网络发展品牌就是这样， 选择一个网络平台 扩大受众群体 分享您的故事 变现 提示：聘请导师来加速您的学习过程。 利用互联网赚钱。 现在，有了网上业务； 出售书籍/指南 创建在线课程 拥有一个盈利博客 提供指导计划 仅拥有单一收入来源无异于财务自杀 7. 投资自己你如何对待自己，人们就会如何对待你。 这样做， 让自己闻上去很香 吃得健康 去健身房 合身的衣服 提高你的社交技能 优先考虑你的自我提升。 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu2023/posts/2516df27/"},{"title":"尬聊：离谱，国足成都赛龙之队将首次缺席","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转载须注明出处。尬聊：离谱，国足成都赛龙之队将首次缺席 离谱，龙之队球迷会将历史首次缺席国家队比赛看台助威。 事情是这样的。 国足三角战关心足球的朋友已经注意到，最近在成都将举办中国国家男子足球队和马来西亚、叙利亚的三角战，比赛的性质是国际A级热身赛。 这个赛事消息其实在一个多月以前就已经爆出来了，但最近一系列的事情让这个这一系列赛事变得非常的具有戏剧性，直到现在变成非常离谱。 “黑”其实中国足协早已定下，要在成都举办这项三角战。但期间成都蓉城足球队在中超赛事中被严重误判，而后引发的成都蓉城队的球迷的抗议活动。其中包括在主场打出大幅“黑”字 TIFO，e由此引发整个足坛的非常高的热度，也让足协因此十分尴尬。 所以接下来各方揣测，足协大概率不会再将该项赛事放在成都，以示惩戒。 还是成都，但省足协独家承办不知道什么原因，最终还是放在了成都，但是从比赛的各方承办单位来看，好像和成都足协没有任何关系，而是由四川省足协完全独自承担了下来。 这里需要着重提醒各位读者的是，在足协的会员单位中，四川省足协和成都市足协是平级的两个单位，前面提到的成都蓉城队是成都足协下注册的球队、亲儿子。 变卦，搞笑的票务大家都知道龙之队是中国国家男子、女子足球队在比赛现场的重要球迷协会和助威团体。 龙之队在这次比赛定下来的时候就已经着手谈好了票务信息。如他们的公告所说，原价 380 元的票，定价为面向会员的优惠价 220 元一张。 本地的各大球迷协会也得到了类似的折扣优惠，并且开始向会员开放票务登记和缴费。 就在本地以及外地各方球迷协会统计好票务，收好预缴款时，足协却突然变卦。通知将原定的 4 万张球票，也就是说上限为 4 万人的球场，重新限定到上限为 3 万人。因此，由此票务就重新被定价。 直到刚刚最新的票价为首层看台全部统一 380 元，二层看台全部统一 280 元，所有票务没有优惠，没有折扣价。 这就让大部分会员都感受到了欺骗，因此拒绝买票入场。 离了个大谱，不让助威？足协通知还说，现场不允许任何球迷协会以团体存在，也就是说不允许集体助威。 这就让几乎所有的球迷协会正式完全放弃了这次比赛的统一购票和助威准备。 这也让整个事情变得离谱了起来，也就是说也就如龙支队公告所说，这将会是龙支队首次缺席国足的比赛。 这一把四川省、成都市本地的承办单位，好像真的是丢人丢到了全国乃至全世界了。😂 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 赞赏请前往公众号菜单栏~~ 至少点个赞再走吧~","link":"/kewenlu2023/posts/b3a65ef0/"},{"title":"年度：“央广”感动中国2022年度人物","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 3月4日，中央广播电视总台感动中国2022年度人物晓。获奖对象包括钱七虎、邓小岚、杨宁、沈忠芳、徐淙祥、银发知播、徐梦桃、陈清泉、陆鸿和林占熺。 以下是颁奖词， 钱七虎什么才是安全不是深藏地下，构筑掩体，是有人默默把胸瞠挡在前面。什么才是成就不是移山跨海，轰天钻地。是奋斗一甲子，铸盾六十年,是了却家国天下事，一头白发终不悔。 邓小岚你把自己留给一座小小山村,你把山村的孩子们送上最绚丽的舞台你在这里出生也在这里离开。山花烂漫，杨柳依依，为什么孩子的歌声如此动人?因为你对这片土地爱得深沉。 杨宁连就连，连上书记结对子莫看女娃年纪小，敢卖婚房种新田。连要牢，担子虽重娃敢挑，苗乡今年多喜事，紫了糯米撑荷包。牢又牢，党和乡亲我作桥,后有党员干干万，不怕弯多山又高。 沈忠芳从无到有，从近到远,从长缨在手，到红旗如画。这一代人,从没有在乎过自己的得与失这一代人，一辈子都在磨砺国家的剑与盾。今天，后辈们终于能听到你们的传奇,隐秘而伟大，平静而神圣。 徐淙祥饿过，所以懂得温饱拼过，才更执着收获。种了一辈子庄稼，现在赶上了好年景禾苗在汗水中抽穗稻麦在农机下归仓珍惜陇亩颗粒，心怀天下仓虞你是泥土上的黄牛，夕烟下的英雄。 “银发知播”春蚕不老，夕阳正红没有墙壁的教室，不设门槛的大学。白发人创造的流量，汇聚成真正的能量。知播，知播,传播知识与文化，始终是你们执着的方向。 徐梦桃烧烤炉温暖的童年伤病困扰的青春近在咫尺的金牌,最终披上肩膀的国旗。全场最高难度，这是创纪录的翻转更是人生的翻转。桃之天天，灼灼其华梦之芒芒，切切其真。 陈清泉汽车曾经改变世界而你要改变汽车。中国制造，今天车辙遍布世界你是先行者你是领航员。在新能源的赛道上驰骋了四十多年，如今，你和祖国，正在超车。 陆鸿有人一生迟疑，从不行动;而你从不抱怨，只想扼住命运的喉咙。能吃苦，肯奋斗，有担当似一叶扁舟在激湍中逆流而上，如一株小树在万木前迎来春光。在阴霾中，你的笑容给我们带来力量。 林占嬉咬定青山大地立根黄沙破岩，传递幸福，不以闽宁为限传播文明，不以山海为远。时不我待，所以只争朝夕:心系乡士，所以敢为天下先你不是田间的野草，你是新时代滋养的大树。 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~","link":"/kewenlu2023/posts/f3e9eea7/"},{"title":"时事：中共中央，国务院印发《数字中国建设整体布局规划》","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 2023-02-27 18:43 来源： 新华社 新华社北京2月27日电 近日，中共中央、国务院印发了《数字中国建设整体布局规划》（以下简称《规划》），并发出通知，要求各地区各部门结合实际认真贯彻落实。 《规划》指出，建设数字中国是数字时代推进中国式现代化的重要引擎，是构筑国家竞争新优势的有力支撑。加快数字中国建设，对全面建设社会主义现代化国家、全面推进中华民族伟大复兴具有重要意义和深远影响。 《规划》强调，要坚持以习近平新时代中国特色社会主义思想特别是习近平总书记关于网络强国的重要思想为指导，深入贯彻党的二十大精神，坚持稳中求进工作总基调，完整、准确、全面贯彻新发展理念，加快构建新发展格局，着力推动高质量发展，统筹发展和安全，强化系统观念和底线思维，加强整体布局，按照夯实基础、赋能全局、强化能力、优化环境的战略路径，全面提升数字中国建设的整体性、系统性、协同性，促进数字经济和实体经济深度融合，以数字化驱动生产生活和治理方式变革，为以中国式现代化全面推进中华民族伟大复兴注入强大动力。 《规划》提出，到2025年，基本形成横向打通、纵向贯通、协调有力的一体化推进格局，数字中国建设取得重要进展。数字基础设施高效联通，数据资源规模和质量加快提升，数据要素价值有效释放，数字经济发展质量效益大幅增强，政务数字化智能化水平明显提升，数字文化建设跃上新台阶，数字社会精准化普惠化便捷化取得显著成效，数字生态文明建设取得积极进展，数字技术创新实现重大突破，应用创新全球领先，数字安全保障能力全面提升，数字治理体系更加完善，数字领域国际合作打开新局面。到2035年，数字化发展水平进入世界前列，数字中国建设取得重大成就。数字中国建设体系化布局更加科学完备，经济、政治、文化、社会、生态文明建设各领域数字化发展更加协调充分，有力支撑全面建设社会主义现代化国家。 《规划》明确，数字中国建设按照“2522”的整体框架进行布局，即夯实数字基础设施和数据资源体系“两大基础”，推进数字技术与经济、政治、文化、社会、生态文明建设“五位一体”深度融合，强化数字技术创新体系和数字安全屏障“两大能力”，优化数字化发展国内国际“两个环境”。 《规划》指出，要夯实数字中国建设基础。一是打通数字基础设施大动脉。加快5G网络与千兆光网协同建设，深入推进IPv6规模部署和应用，推进移动物联网全面发展，大力推进北斗规模应用。系统优化算力基础设施布局，促进东西部算力高效互补和协同联动，引导通用数据中心、超算中心、智能计算中心、边缘数据中心等合理梯次布局。整体提升应用基础设施水平，加强传统基础设施数字化、智能化改造。二是畅通数据资源大循环。构建国家数据管理体制机制，健全各级数据统筹管理机构。推动公共数据汇聚利用，建设公共卫生、科技、教育等重要领域国家数据资源库。释放商业数据价值潜能，加快建立数据产权制度，开展数据资产计价研究，建立数据要素按价值贡献参与分配机制。 《规划》指出，要全面赋能经济社会发展。一是做强做优做大数字经济。培育壮大数字经济核心产业，研究制定推动数字产业高质量发展的措施，打造具有国际竞争力的数字产业集群。推动数字技术和实体经济深度融合，在农业、工业、金融、教育、医疗、交通、能源等重点领域，加快数字技术创新应用。支持数字企业发展壮大，健全大中小企业融通创新工作机制，发挥“绿灯”投资案例引导作用，推动平台企业规范健康发展。二是发展高效协同的数字政务。加快制度规则创新，完善与数字政务建设相适应的规章制度。强化数字化能力建设，促进信息系统网络互联互通、数据按需共享、业务高效协同。提升数字化服务水平，加快推进“一件事一次办”，推进线上线下融合，加强和规范政务移动互联网应用程序管理。三是打造自信繁荣的数字文化。大力发展网络文化，加强优质网络文化产品供给，引导各类平台和广大网民创作生产积极健康、向上向善的网络文化产品。推进文化数字化发展，深入实施国家文化数字化战略，建设国家文化大数据体系，形成中华文化数据库。提升数字文化服务能力，打造若干综合性数字文化展示平台，加快发展新型文化企业、文化业态、文化消费模式。四是构建普惠便捷的数字社会。促进数字公共服务普惠化，大力实施国家教育数字化战略行动，完善国家智慧教育平台，发展数字健康，规范互联网诊疗和互联网医院发展。推进数字社会治理精准化，深入实施数字乡村发展行动，以数字化赋能乡村产业发展、乡村建设和乡村治理。普及数字生活智能化，打造智慧便民生活圈、新型数字消费业态、面向未来的智能化沉浸式服务体验。五是建设绿色智慧的数字生态文明。推动生态环境智慧治理，加快构建智慧高效的生态环境信息化体系，运用数字技术推动山水林田湖草沙一体化保护和系统治理，完善自然资源三维立体“一张图”和国土空间基础信息平台，构建以数字孪生流域为核心的智慧水利体系。加快数字化绿色化协同转型。倡导绿色智慧生活方式。 《规划》指出，要强化数字中国关键能力。一是构筑自立自强的数字技术创新体系。健全社会主义市场经济条件下关键核心技术攻关新型举国体制，加强企业主导的产学研深度融合。强化企业科技创新主体地位，发挥科技型骨干企业引领支撑作用。加强知识产权保护，健全知识产权转化收益分配机制。二是筑牢可信可控的数字安全屏障。切实维护网络安全，完善网络安全法律法规和政策体系。增强数据安全保障能力，建立数据分类分级保护基础制度，健全网络数据监测预警和应急处置工作体系。 《规划》指出，要优化数字化发展环境。一是建设公平规范的数字治理生态。完善法律法规体系，加强立法统筹协调，研究制定数字领域立法规划，及时按程序调整不适应数字化发展的法律制度。构建技术标准体系，编制数字化标准工作指南，加快制定修订各行业数字化转型、产业交叉融合发展等应用标准。提升治理水平，健全网络综合治理体系，提升全方位多维度综合治理能力，构建科学、高效、有序的管网治网格局。净化网络空间，深入开展网络生态治理工作，推进“清朗”、“净网”系列专项行动，创新推进网络文明建设。二是构建开放共赢的数字领域国际合作格局。统筹谋划数字领域国际合作，建立多层面协同、多平台支撑、多主体参与的数字领域国际交流合作体系，高质量共建“数字丝绸之路”，积极发展“丝路电商”。拓展数字领域国际合作空间，积极参与联合国、世界贸易组织、二十国集团、亚太经合组织、金砖国家、上合组织等多边框架下的数字领域合作平台，高质量搭建数字领域开放合作新平台，积极参与数据跨境流动等相关国际规则构建。 《规划》强调，要加强整体谋划、统筹推进，把各项任务落到实处。一是加强组织领导。坚持和加强党对数字中国建设的全面领导，在党中央集中统一领导下，中央网络安全和信息化委员会加强对数字中国建设的统筹协调、整体推进、督促落实。充分发挥地方党委网络安全和信息化委员会作用，健全议事协调机制，将数字化发展摆在本地区工作重要位置，切实落实责任。各有关部门按照职责分工，完善政策措施，强化资源整合和力量协同，形成工作合力。二是健全体制机制。建立健全数字中国建设统筹协调机制，及时研究解决数字化发展重大问题，推动跨部门协同和上下联动，抓好重大任务和重大工程的督促落实。开展数字中国发展监测评估。将数字中国建设工作情况作为对有关党政领导干部考核评价的参考。三是保障资金投入。创新资金扶持方式，加强对各类资金的统筹引导。发挥国家产融合作平台等作用，引导金融资源支持数字化发展。鼓励引导资本规范参与数字中国建设，构建社会资本有效参与的投融资体系。四是强化人才支撑。增强领导干部和公务员数字思维、数字认知、数字技能。统筹布局一批数字领域学科专业点，培养创新型、应用型、复合型人才。构建覆盖全民、城乡融合的数字素养与技能发展培育体系。五是营造良好氛围。推动高等学校、研究机构、企业等共同参与数字中国建设，建立一批数字中国研究基地。统筹开展数字中国建设综合试点工作，综合集成推进改革试验。办好数字中国建设峰会等重大活动，举办数字领域高规格国内国际系列赛事，推动数字化理念深入人心，营造全社会共同关注、积极参与数字中国建设的良好氛围。 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~~ 至少，点个赞再走吧~","link":"/kewenlu2023/posts/d67f637c/"},{"title":"生活：2023奥斯卡颁奖，杨紫琼最佳女主","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 第95届奥斯卡金像奖（The 95th Academy Awards, USA (2023)）今天开奖，获奖名单如下。 其中，杨紫琼，关继威获得最佳女主和最佳男配。 奥斯卡奖项 获奖者 最佳影片 瞬息全宇宙 Everything Everywhere All at Once 最佳导演 关家永 Dan Kwan 丹尼尔·施纳特 Daniel Scheinert 《瞬息全宇宙》 最佳男主角 布兰登·费舍 Brendan Fraser 《鲸》 最佳女主角 杨紫琼 Michelle Yeoh 《瞬息全宇宙》 最佳男配角 关继威 Ke Huy Quan 《瞬息全宇宙》 最佳女配角 杰米·李·柯蒂斯 Jamie Lee Curtis 《瞬息全宇宙》 最佳原创剧本 瞬息全宇宙 Everything Everywhere All at Once 最佳改编剧本 女人们的谈话 Women Talking 最佳国际影片 西线无战事 Im Westen nichts Neues 最佳动画长片 吉尔莫·德尔·托罗的匹诺曹 Guillermo Del Toro’s Pinocchio 最佳纪录长片 纳瓦尔尼 Navalny 最佳摄影 西线无战事 Im Westen nichts Neues 最佳剪辑 瞬息全宇宙 Everything Everywhere All at Once 最佳视觉效果 阿凡达：水之道 Avatar: The Way of Water 最佳音响 壮志凌云2：独行侠 Top Gun: Maverick 最佳艺术指导 西线无战事 Im Westen nichts Neues 最佳服装设计 黑豹2 Black Panther: Wakanda Forever 最佳化妆与发型设计 鲸 The Whale 最佳原创配乐 西线无战事 Im Westen nichts Neues 最佳原创歌曲 RRR 最佳动画短片 男孩、鼹鼠、狐狸和马 The Boy, the Mole, the Fox and the Horse 最佳真人短片 爱尔兰式告别 An Irish Goodbye 最佳纪录短片 小象守护者 The Elephant Whisperers ~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~~ 至少，点个赞再走吧~","link":"/kewenlu2023/posts/6426538/"},{"title":"生活：中超，成都主场火爆收官","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 周末去了中超球队“成都蓉城”的主场“凤凰山”观赛，也就是中超末轮“成都蓉城”对“大连人”的现场。 “金牌球市” 由于非常戏剧性的末轮多队弃赛，“武汉三镇”其实已经提前一轮夺冠，这场比赛的赛果仿佛没有那么重要。 而现场，从赛场上到看台，给出的火爆恰恰相反。直到倒数第三场比赛，还是因为前期比赛的延期，才回到主场的“成都蓉城”斗志昂扬，球迷更是点燃了“金牌球市”的火苗。 前一天， 2 万多张票放出后 1 小时售罄，现场的黄牛也是加价至少 100 元转卖。 据现场主持人报告，这场比赛现场观众达 3 万 7 千多人。但根据现场空座来看，实际在场人数应该不会低于 4 万人。要知道，官方信息，售票加赠票也就开放了 3 万座位左右，球场满座也就 5 万。 与“梅州客家”和“广州”（恒大）的比赛形成鲜明对比，后面这场比赛确实有点儿“老太太钻被窝”的局促了。 “这才是足球应该有的样子”可能绝大多数读者对中国足球没有那么感兴趣。但还是劝各位去一次现场，感受下现场的氛围。尤其是有中超主场的城市。中国足球会变得更好的！ 当然，这里还是首推“成都蓉城”的主场“凤凰山”啦！毕竟连对手“大连人”的知名教练谢晖在赛后采访都感叹这个现场，“这才是足球应该有的样子”。 多提一句，“大连人”绝对是今年最值得尊敬的一个球队，从赛季初的递补升级的全华班，到最后拿到了 11/18 的名次。 “我们联赛缺少的就是这样的比赛，我在更衣室里也和球员们说了，你要会踢这样的比赛，这样的比赛才是足球的根本，才是最纯粹的东西。如果这样的比赛多了，中国足球才有下一步。有了观众才有青训，才有小孩子们来踢球，所有这些都是以刚才这样的比赛为基础的。这场比赛有三万七千名球迷，这才是足球应该有的样子。”——谢晖 现场这里给各位读者来一些我在现场的拍摄。（第一张为官方微博@成都蓉城足球俱乐部 的图，可以在微博看到更多更好的视频、照片） 都看到这儿了，不如关注每日推送的“科文路”、互动起来~~ 至少，点个赞再走吧~","link":"/kewenlu2023/posts/f002c96b/"},{"title":"生活：剑门关游玩攻略","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 正式失业的第一天，第一个工作日，我在老家。 我的老家在“蜀道之难，难于上青天”的蜀道一景“剑门关”——剑阁县。 出走小半生了，别人问起的我的老家在哪里，我通常都会像上面那句话一样引出来。 我成长在下辖的一个小镇上，但前些年由于家里的工作调动，举家搬迁到了剑阁新县城，这个离剑阁著名景点——剑门关更近的地方。所以近几年来这里的机会越来越多。 今天我想简单、客观介绍一下我的老家特色——剑门关。这篇文章也可以作为剑门关的游玩攻略。 蜀道雄关——剑门关“剑阁峥嵘而崔嵬，一夫当关，万夫莫开”——《蜀道难》，李白 这句经典诗词，应该大多数人都会背后面两截。可能是因为前面有几个生僻字的原因吧。 这句里面的“剑阁”就是说的剑门关这里。 一提起剑门关，就一定会联想到它的雄壮、巍峨。置身其中的时候，也必然会感受到古代征战此关的人能同样感受到的艰险。 剑门关现在已经是 5A 级景区，离剑阁新县城 10 多公里。剑阁新县城已经作为“西成高铁”的途中一站通了高铁，就叫“剑门关”站。从成都到剑门关只需要 1 个多小时，西安过来也就 2 个多小时。交通可以说是十分方便了，不妨作为途中游览目的地。 游玩建议剑门关的主要游玩方式是从山脚爬到山顶，或者徒步、或者缆车。在一路的观光中欣赏剑门关以及远处的奇山。 以下是我的个人游玩建议： 春、秋季节游玩。春秋两季是在剑阁游玩最舒适的季节。春天，生机盎然，漫山遍野的新绿；深秋，一望无际的彩林。但夏天炎热，不宜再爬山；冬季湿寒，可能有些小景点就有点危险了。 早起看雾。剑阁这边早晨总能升起薄雾，这个是官方从未宣传的特色。雄关漫漫，云雾缭绕，远观雾中的群山时，空气清新，心旷神怡。 背点《蜀道难》。其实《蜀道难》已经把剑门关的所有特色一一道尽，跟着诗文中的描述去找眼前对应的景色别有一番体验。比如“枯松倒挂倚绝壁”，“百步九折萦岩峦”等等。另外，现在背《蜀道难》可以免门票。 吃什么考虑到广告嫌疑，就不指定饭店了。多走走多问问吧。 剑阁有几个特色美食， 剑门豆腐。豆腐宴，简单讲，就是用豆腐作为原材料做了一整桌子菜。剑门豆腐宴不知道为啥就名声在外了，我小的时候也没有太吃过，更多的就是买块豆腐。外地的朋友可以尝试一下。 广元蒸凉面。米凉面，这个是广元的特色，通常是本地人的早饭（只有早上有），和稀饭一起吃、也可以单独吃。也是我们本地人的最爱。外地没有的！听说外地的水做不出来，不太懂。 剑阁麻辣串。麻辣串是剑阁的特色，不同于串串香，麻辣串是用同一个锅煮，然后送到每个桌上。有“重聚老地方”、“海娃子”等等连锁店。然后我们本地人一般会配上店里有的“酸菜干饭”。 其他除了前面提到的，还有些别的项目。 翠云廊景点。这个景点离剑阁不远，景区内主要是各种遮天蔽日的古柏。 温泉。剑阁县城内有几处温泉，考虑到身体情况后可以去泡泡。当然，也可以就住到温泉酒店。 昭化古镇。这个古镇很多名人去过，离剑阁不远，但全国的古镇都差不多，别抱太大希望。 最后剑阁总体来说是个不错的中转站景区，适合 1～3 天的停留，总体花费也能接受。 我理想中的游客的一天是这样的， 早起去吃个蒸凉面，吃完回到酒店；翻出《蜀道难》，对蜀道奇景有了大概的心中景象，买票去往剑门关游玩；下午，回到剑阁县城，找一家剑阁麻辣串或者剑门豆腐店，和朋友们畅聊；吃完饭后，沿着江边，看着远处的宝龙山上的阁楼灯光，徐徐走回酒店，结束这一天。 ~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~~ 至少，点个赞再走吧~","link":"/kewenlu2023/posts/b1a49c00/"},{"title":"生活：又入职了","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 今天，又又又入职了。 没错，呼应之前的《生活：又离职了》。那里面有简单的离职情况介绍。 今天微博有一条热搜是“离职前一天被辞退了”正好呼应了我的经历。而且我至今没想明白，为什么我老板会以“恶心”我的方式抢先辞退我，送我一个 N+1 礼包。算了，给都给了，就收着吧😊。 今天到了新公司，熟悉的感觉又回来了。没有了嘈杂的扯皮、压抑的气氛，回到了专注、轻松的工作环境。剩下的唯一问题，就是交代给我的任务能不能如期完成了🤣，希望能超预期！毕竟以高龄换回之前的赛道了，可能就要在这个赛道上一直搞下去了。 对了，这次的换工作有一个很重要的感受可以分享一下——如果你新换的工作没有你之前的工作舒适，那多半是没换对。人生苦短，别老在苦海里瞎扑腾。 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~","link":"/kewenlu2023/posts/98b86204/"},{"title":"生活：又离职了","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 周五，又又又离职了。 这次创造了最短工作经历记录——一年。 不同于以往的惺惺相惜，这次的离职过程可真称得上是一路坎坷又大开眼界。 细节上也不多介绍了。总的来讲就是公司方依然抱着“北上广不相信眼泪，成都不相信劳动法”的幻想，反复吓唬人、恶心人。最终我这边也是由一开始的我主动协商离职，变成了最后我被裁员。 其实一开始是我主动口头提出的离职外加一些附加条件。所以几经波折，到最后的处理结果的时候，我和经手我这个事的同事都是一脸懵逼，对上层领导往复、奇怪的做法感到莫名其妙。 于是，这一周的我就一直处于研究《劳动法》的状态。 以前，我本一直以为《劳动法》有点过分的保护劳动者了，因为它对用人方的约束确实比较严苛。比如，用人方要裁掉一个员工，除非给 N+1 的赔偿，否则还真难想到合理合法的方式。 但真到这次这重锤落到我身上的时候，我才体会到，《劳动法》是咱大头兵最后的保护了。如果没有它，我还真想象不到公司对我还能做出多出格的事情来。 最后，《劳动法》是个好东西，希望我们都不用去研究它。 ~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~","link":"/kewenlu2023/posts/f656c8a4/"},{"title":"生活：开学啦！","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 周五下午下班，照例坐火车回在另一个城市的家。 好家伙，车厢被行李箱堵的满满当当。顺着行李箱扫荡了一下，也尽都是约莫二十岁左右的年轻人的面孔，于是才恍然大悟——开学啦！因为下一站就是某大学的所在地。 哈哈，还是年轻人生猛，目的站下车时，他们应该有差不多四分之一的人没戴口罩了。 他们下车后，车厢顿时由嘈杂转向往常一样的沉静。可能其他乘客也和我一样，被带起了自己关于学生时期的回忆，那些一想起来就热血沸腾的日子。 ~~ 不知道是不是心理暗示的作用，从上车开始，这两天总感觉自己身边的人都在谈论跟开学有关的事。 “你们小孩是哪天报名啊？” “xxx，作业又没做完！” “开学有考试哦！” “今年给小孩报个啥兴趣班呢？” 哦对了，公司也刚来一个实习生做毕业设计，看来也是放完假了。 一谈到开学，家长们、学生们仿佛有聊不完的天。全世界把读书的仪式感看的这么重的估计也就我们中国人了吧！ ~~ 说回我自己。我对于“开学”这件事和绝大多数当事人的心情是一样的——不开心！ 开学意味着要交假期作业，意味着要重新开始一个学习目标、学习阶段、学习过程，也意味着要暂停被父母呵护的美好时光了。 所以，虽然仅仅是中断了一个月的学校生活，在开学前几天也变得极其难以适应。可能不住校的朋友很难体会这种感受。 要庆幸的是，好像我们都在学习的过程中得到过很多快乐，于是，在多年以后的车厢上碰到过去的自己时，回忆里有骄傲的印记。 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~~ 至少，点个赞再走吧~","link":"/kewenlu2023/posts/386dc91/"},{"title":"生活：政通人和——淄博烧烤的必杀技","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 3 个视频，​来看看最近大火的“淄博烧烤”！ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~","link":"/kewenlu2023/posts/d4cd2713/"},{"title":"生物：熊猫界顶流女明星“花花”","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 从没见过一只熊猫这么的火！是“花花”，本名“和花”。 也见过熊猫，也去过成都大熊猫繁育基地。印象中的熊猫长的都差不多，无非高矮胖瘦、不同年龄段的差别。还是第一次见到那么多网友对这么一只熊猫情有独钟。 但我至今仍旧“脸盲”，如果非要说女明星花花有什么与众不同，我也只有按图索骥的去分辨。但她的梨形身材确实让我印象深刻。 但不管怎么说，这只熊猫确实可爱的有点特别。下面放上视频锦集的一些截图，和各位读者一起认识一下这位新晋梨形身材女明星“花花”。 原视频在《精彩一刻》“和花”的个熊档案来啦！ ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~","link":"/kewenlu2023/posts/93378f1/"},{"title":"生活：看了《交换人生》，还行","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 周五回家早，墨迹墨迹着想着看个什么电影。 恰巧最近总是有意无意间瞟到雷佳音和张小斐宣传电影《交换人生》，就搜了一下。果然线上已经有了。 由于之前也没有多大的市场反响，所以感觉应该是个一般的“肥皂剧”。于是，茶水瓜子准备好，就开始了观影。 看完后觉得确实如之前所料，这几个同志的业务水平确实不足以把普普通通的剧情推上另一个高度。哈哈。 总的来说，作为一部周末消遣一下的电影，这部片子是合格的。 电影里有句台词我很喜欢，也适合我这个年龄本就动摇的方向感——“希望这个艰难复杂的世界不要改变你”。 我给 6 分（不至于像豆瓣的 5.4 那么低啦） ~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~","link":"/kewenlu2023/posts/abc538ab/"},{"title":"生活：见证历史，股票“注册制”正式实施","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 见证历史了。股票“注册制”正式实施。同时，今天股市也是很给面子，大涨。 “注册制”是一项传闻已久、终于落地的一项股市新政策。简单讲，就是股市新股的发行与否，由之前的“审核”制转向现在的“注册”制。（跟美国学习） 以前的“审核”制下，股票的发行与否、发行价等等，由上面有关部门审核决定。最近这两年审核速度算快的了，再往前，是很慢的，往往待上市公司要排很长时间的队。所以有些等不及审核的大公司，就收购已经上市了、但市值不高的小公司，从而跳过审核“借壳上市”。明星股“360”公司就是这么快速完成上市的。 当然，这种操作后来被严管了。比较有名的一个案例是恒大没能成功借壳上市圈钱，也就造成了许家印后面的一系列下坡路。 说回来，“审核”制有啥特点？ “审核”制带来了一项隐形福利，由于严格的审核，往往发行价格定的相对较低，所以就有大批股民去申购新股，以谋取公司正式上市后的价值回归、飞速上涨带来的利润。所谓的“打新股”，在当下的股市里基本上稳赚不赔。当然，哄抢新股的这种炒作也让公司股价本身畸形上升，公司也很开心。 但是，“注册”制后，公司上市与否的权利交回给了公司自己。注册上市将会比以前容易很多。相应的，占着坑位的“壳”股也将失去价值、最终被淘汰，这需要股民提防了。 另外，也不是说就能胡乱造假上市了。如果新上市公司被发现有问题，那么会计事务所、证券公司等等相关服务机构将会受到严肃处理。也就是说，其实“注册”制把上市的权利和义务同时交给了公司。 总的来说，不管我的读者你炒不炒股，我们都一起经历了中国证券行业的一次历史变革。 ~~ 以下是《全面实行股票发行注册制制度规则发布实施》公告原文。 日期：2023-02-17 来源：证监会 2023年2月17日，中国证监会发布全面实行股票发行注册制相关制度规则，自公布之日起施行。证券交易所、全国股转公司、中国结算、中证金融、证券业协会配套制度规则同步发布实施。 全面实行注册制是涉及资本市场全局的重大改革。在各方共同努力下，科创板、创业板和北交所试点注册制总体上是成功的，主要制度规则经受住了市场检验，改革成效得到了市场认可。这次全面实行注册制制度规则的发布实施，标志着注册制的制度安排基本定型，标志着注册制推广到全市场和各类公开发行股票行为，在中国资本市场改革发展进程中具有里程碑意义。 此次发布的制度规则共165部，其中证监会发布的制度规则57部，证券交易所、全国股转公司、…… ………… （以上内容详见官网证监会令和证监会公告等栏目）~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~~ 至少，点个赞再走吧~","link":"/kewenlu2023/posts/aef93b0/"},{"title":"生活：选专业？择业？这份名单很重要","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 去年底，工业和信息化部正式公布 45 个“国家先进制造业集群”的名单。 这份名单好像并没有作为整体引起讨论，但其实其中蕴含了非常有用的信息，比如如何选专业。 “先进”是什么，我认为这代表着这个东西别的地方没得搞，就我这里能搞、愿意搞、搞得好。 从我的角度看，无论是从地域软硬实力的基础，还是可预见的发展方向看，这份名单都非常务实的定下了区域性的主要发展方向。当然，这里说的发展方向更多的说的是技术或者科技发展方向。而这对于需要选方向的学生、需要择业的打工人都是非常重要的。 以我所在的成都市为例，名单上有 成都市软件和信息服务集群 成渝地区电子信息先进制造集群 成都市、德阳市高端能源装备集群 这就非常务实。成都本身确实没有如名单上其他集群那样有很强的制造业、材料类基础，但成都拥有最强的电子科学类高校（电子科技大学），也有一定的软件业基础（军工类还是很强的，另外还有南门一堆二三线 IT 公司）。所以这个集群的定位不仅结合了历史，也对未来的可能性作出了一定的预判。 所以，如果想跟紧大势至少喝口汤的同学，若想在成都得到超额的发展回报，不妨把电子类、软件类作为择业方向。 另一方面，这里提到了“成渝”、“成德”，也就说明这些城市之间的相关合作将会更加紧密，甚至会带动之间的交通发展、人员交流。而其他城市的这类行业的资源就会有点被动。这也符合我的切身体会。 所以，如果你已经确定了想去的城市，不妨跟着这份名单、关注一下近期发布的年度政府工作报告，去找找更细化的方向上的信息。 以下是《国家先进制造业集群名单》完整名单， 序号 集群名称 1 深圳市新一代信息通信集群 2 无锡市物联网集群 3 上海市集成电路集群 4 广州市、佛山市、惠州市超高清视频和智能家电集群 5 南京市软件和信息服务集群 6 东莞市智能移动终端集群 7 合肥市智能语音集群 8 杭州市数字安防集群 9 青岛市智能家电集群 10 成都市软件和信息服务集群 11 武汉市光电子信息集群 12 长沙市新一代自主安全计算系统集群 13 成渝地区电子信息先进制造集群 14 南京市新型电力（智能电网）装备集群 15 株洲市轨道交通装备集群 16 长沙市工程机械集群 17 徐州市工程机械集群 18 西安市航空集群 19 广州市、深圳市、佛山市、东莞市智能装备集群 20 青岛市轨道交通装备集群 21 成都市、德阳市高端能源装备集群 22 株洲市中小航空发动机集群 23 南通市、泰州市、扬州市海工装备和高技术船舶集群 24 潍坊市动力装备集群 25 保定市电力及新能源高端装备集群 26 沈阳市机器人及智能制造集群 27 上海市新能源汽车集群 28 武汉市、襄阳市、十堰市、随州市汽车集群 29 长春市汽车集群 30 深圳市先进电池材料集群 31 苏州市纳米新材料集群 32 宁波市磁性材料集群 33 常州市新型碳材料集群 34 宁德市动力电池集群 35 宁波市绿色石化集群 36 赣州市稀土新材料及应用集群 37 上海市张江生物医药集群 38 深圳市、广州市高端医疗器械集群 39 苏州市生物医药及高端医疗器械集群 40 泰州市、连云港市、无锡市生物医药集群 41 京津冀生命健康集群 42 温州市乐清电气集群 43 呼和浩特市乳制品集群 44 佛山市、东莞市泛家居集群 45 苏州市、无锡市、南通市高端纺织集群 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~","link":"/kewenlu2023/posts/4b87f286/"},{"title":"省馆之宝：内蒙古，草原宝藏","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 通常，一个省级行政区内最有名的文物都会被收藏到其省博物馆内。所以，”省馆之宝”系列将介绍我国各个省馆的明星文物。每周二更新，本文为第 25 期。 本期介绍内蒙古博物院的镇馆藏品。本期选取了 6 件藏品。本期内容全部来自内蒙古博物院：官网，更多细节请访问相关网站。 匈奴王金冠·战国 尺寸：鹰高6.7，冠带直径16.5-16.8厘米，重1211.7克。 这套金冠饰的主体造型为，一展翅的雄鹰，站立在一个狼羊咬斗纹的半球状体上，俯瞰着大地。额圈由三条半圆形金条榫铆插合而成，上有浮雕卧虎、卧式盘角羊和卧马造型，中间部分为绳索纹。是目前国内发现唯一的匈奴贵族金冠饰。 神兽纹灰陶尊·新石器时代 口径19.1厘米、底径10.5厘米、高20.2厘米。 这件陶尊是有着赵宝沟文化特征的器物，器表和内壁都经过磨光处理，腹部压划神兽纹。神兽纹饰分布在陶器高度的1/3处，是视觉上“黄金分割点”的位置，分别是鹿、猪、鸟三种灵物，布局巧妙、制作精细、造型美观。 红山玉猪龙·5000多年前红山文化 这件玉猪龙玉器上雕刻的动物，鼻子突出褶皱，眼睛微凸、耳朵直立、身体卷曲、首尾相连、器体厚重、造型简素。这件玉器出土于赤峰市敖汉旗红山文化遗址，是红山文化中的代表性玉器。它体形较小，酷似玉玦，考古学界称之为“猪龙形玉玦”或玉猪龙。 鸟形双系彩陶罐·新石器时代 高37.2厘米、宽32.8厘米、底径11厘米。 鸟仰头张嘴，显示出嗷嗷待哺的形象。夹砂灰陶，表面绘红彩和黑彩的线条，使形象更加生动。这件器物整体做成鸟形，体现以鸟为图腾崇拜的现象。 龙首青铜灶·汉代 高44厘米、长40厘米。 器物为灶、烟筒、釜、甑分制组合而成。灶前有长方形灶门，后部插一昂首嘶吼的龙头烟筒，灶底有四蹄足，两侧各有一铺首衔环。灶是中原定居民族生活必需品，在内蒙古长城地带的汉墓中，多作为冥器出现。这件铜灶是内蒙古地区迄今发现个体最大最完整的一件。 和林格尔东汉墓壁画《幕府图》·东汉末年 全长约20米。 1971年，和林格尔的一位农民在修筑梯田时，发现了东汉时期的这座古墓。1972 至 1973 年间，内蒙古文物考古队对该墓葬进行了发掘与清理。在墓室的壁、顶及甬道两侧绘满了壁画，其画幅之大，内容之丰富，榜题之多，是我国考古发掘迄今所见汉墓壁画中最珍贵的样本。 墓主人名叫阚如。壁画和榜题宛如气韵生动的墓志铭，描绘出了墓主人瑰丽而完整的人生路径。在众多壁画中，《幕府图》描绘得最为详细，是墓葬画面的核心部分。整个幕府分为堂、营舍和庖舍3部分。营舍位于幕府后院，为幕府中管理军务的机构所在，庖舍位于幕府的西南角，掌管幕府厨饮之事。营舍位于幕府后院堂院为高大的庑殿式房屋，墓主人端坐堂上，堂下艺人在表演乐舞杂耍，身着民族服饰人物伏拜觐见，周围环立官吏武士，场面喧嚣隆重。 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~","link":"/kewenlu2023/posts/d8c3cd5f/"},{"title":"省馆之宝：合集","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 通常，一个省级行政区内最有名的文物都会被收藏到其省博物馆内。所以，”省馆之宝”系列将介绍我国各个省馆的明星文物。每周二更新，本文为最后一期，给出 28 个省（自治区）博物馆的链接合集。 本系列总计 28 期，介绍了 28 个省（自治区）的博物馆代表馆藏，可以作为一个观展指南。 你可以点击上面的标签，去到合集页直接查看。你也可以点击文末的“阅读原文”去备份站查看。 那么“省馆之宝”系列就到此结束了，谢谢各位读者的阅读。 ~~ 省馆之宝：辽宁，新中国建立的第一座博物馆 省馆之宝：山西，三晋大地 省馆之宝：河北，满城汉墓 省馆之宝：吉林，白山松水 省馆之宝：黑龙，黑土风采 省馆之宝：江苏，国立中央博物院 省馆之宝：浙江，越地长歌 省馆之宝：安徽，江淮撷珍 省馆之宝：福建，闽迹 省馆之宝：江西，江南青铜王国 省馆之宝：山东，齐鲁文博 省馆之宝：河南，九州腹地、十省通衢 省馆之宝：湖北，楚国八百年 省馆之宝：湖南，马王堆汉墓 省馆之宝：海南，天涯海角有古迹 省馆之宝：四川，春风又绿浣花溪 省馆之宝：贵州，苗舞侗歌 省馆之宝：云南，高原明珠 省馆之宝：陕西，十三朝古都 省馆之宝：甘肃，绿马很行 省馆之宝：青海，都兰遗珍 省馆之宝：台湾，故宫博物院 省馆之宝：新疆，好地方 省馆之宝：宁夏，西夏 省馆之宝：内蒙古，草原宝藏 省馆之宝：广西，歌舞之乡 省馆之宝：西藏，世界屋脊 省馆之宝：广东，不辞长作岭南人 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~","link":"/kewenlu2023/posts/41f3354d/"},{"title":"省馆之宝：宁夏，西夏","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 通常，一个省级行政区内最有名的文物都会被收藏到其省博物馆内。所以，”省馆之宝”系列将介绍我国各个省馆的明星文物。每周二更新，本文为第 24 期。 本期介绍宁夏回族自治区博物馆的镇馆藏品。本期选取了 7 件藏品，其中，前 3 件为官网提到的三大镇馆之宝。本期内容全部来自宁夏回族自治区博物馆：官网，宁夏回族自治区文物考古研究所：官网和百度百科，更多细节请访问相关网站。 石刻胡旋舞墓门扇·唐 单扇：长89厘米，宽43厘米，厚5厘米；圆柱门枢：高13厘米，直径10厘米。 每扇门均呈长方形，上下有圆柱状榫，两门闭合处各有一孔，出土时有铁锁锁扣。每扇石门正中浅雕一“胡旋舞“男伎。所刻男伎为典型的胡人形象：虬髯卷发。深目高鼻，宽肩细腰，体魄健壮。身着圆领紧身窄袖衫，下着紧腿裙，脚穿长筒皮靴，站在一块编织精美的小圆毯上，双人对舞。左边舞伎侧身回首，左脚站立圆毯上，右腿后屈，左手正微微上举，右臂屈至头顶；右侧男伎右脚立毯上，左腿前伸，双臂上屈，至头顶上方合拢。 两人均手举长巾，熟练挥旋。四周剔地浅浮雕卷云纹，似舞伎腾跃于云气之中，造成流动如飞的艺术效果。整个画面构思精妙，主题突出，人物面部表情生动自然，体态轻盈健美，舞姿迅疾奔放、充满欢乐生活气息。 石雕力士志文支座·西夏 长68厘米，宽65厘米，高62厘米。 圆雕，白砂石质，近似正方体.圆雕男性人像，面部浑圆，颧骨高突，粗眉上翘，双目圆睁且外突，鼻梁短粗，撩牙外露，下额置于胸前，裸体，腹有肚兜，肩与头齐，肘部后屈，双手托膝，下肢屈跪，背部平直.座顶左上角阴刻西夏文三行，计15个字。第一布刊字，汉译为“小虫旷负”；第二行4字，汉译为“志文支座“；第三行7字，汉译为“瞻行通雕写流行”。背部阴刻汉文一行6字’‘砌垒匠高世昌‘，为西夏石雕工匠的姓名，弥足珍贵。雕像以夸张的手法表现了负重者的神态，反映出西夏时期石雕艺术的独特风格。迄今在西夏陵区多座帝陵的碑亭遗址中，共出土这类支座十多件，但刻有西夏文字的仅此一件.1996年，被定为国宝级文物。 鎏金铜牛·西夏 长120厘米，宽38厘米，高45厘米。 该文物由青铜铸造而成，中间空心，外表通体染金。牛屈肢而卧，牛角耸立，两耳竖起，双眸远眺，四肢有力，体态健壮，牛颈有弧纹，比例匀称，线条流畅，形象逼真，个体硕大。表现出了西夏时期较高的铸造工艺。1977年宁夏回族自治区银川市西夏陵陪葬墓出土。同年入藏宁夏博物馆。1996年被定为一级文物。 鎏金天王铜造像·西夏 高57.5厘米，正面宽31.7厘米，侧面宽16厘米。 佛教中的天王是护持佛法的神，该造像为四天王（亦称“四大金刚”）之一，取立姿，头戴宝冠，横眉怒目，长髯拂胸，身着金甲，下衬宽袖征袍，披带飘摇。左臂抬起，食指和小指向上，其余三指微屈，右臂内屈，右手握空拳（可能原握有兵器），足踏半马蹄形山岳台座。此像似为南方增长天王。在黑水城出土有一副西夏时期的增长天王画像，作赤色忿怒形，此形象在印度佛教中表示降伏邪魔、增长善根之意。相比之下，这件造像的整体形象则更加中原化。 彩绘泥塑佛头像·西夏 高39厘米、正面宽25厘米、 侧面宽27厘米。 这尊佛头像中空，头顶为螺髻。眼珠乌亮，为黑色釉料特制。下眼睑上有黑色泪痕。西夏出土的佛像大都是流泪的，这是由于环境变化，使佛像眼中的釉料融化，滴淌而出，从而形成佛像流泪的奇景。 德化窑观音立像·明 高36.2厘米，底宽11.5厘米。 明清时期德化窑曾大量烧造瓷塑释迎牟尼、观音、达摩、弥勒、妈祖、关帝、文昌等，涌现出何朝宗、张寿山、林朝景等能工巧匠。这除了与宫廷的佛事活动有关以外，也与明清时期德化窑所呈现出的非凡的制瓷实力有着密切关系。该器中空，观音身材修长，体态轻盈，容貌端庄，慈祥和蔼，超凡脱浴。头披羽巾，发髻高耸。头部稍向前倾，双目微合，若有所思，直鼻小口，两耳硕长，面庞丰满圆润。身着开襟长衫，胸前佩带缨路饰物，衣纹刻划很深，褶皱分明。观音左手搭于右手之上，惜有儿指残断；一脚露于衣物之外，立于海浪纹座土。此作瓷塑像通体施白釉，釉色滋润，以德化瓷细腻的质地和独特的象牙自展示其静美柔曼的风韵，朴素典雅，衣纹流畅，表情传神，形象逼真，美观大方。雕刻手法细腻，手、足、毫发之间尤见功力。 具装甲陶骑俑·北周 泥质灰陶，高17.7厘米，长17.2厘米。 骑俑头戴尖顶兜鍪（móu），中起脊棱，额前伸出冲角，两侧有护耳。身着铠甲，甲片长方形，以墨线勾勒。外罩黑色披风，两臂弯曲至胸前，双手作执物状，左拳心有孔，原物已失，战马垂首站立，身披鱼鳞状铠甲，辔（pèi）鞍齐备，四肢僵直粗壮，甲片用白色打底，墨线勾勒并点红色，周围涂朱。 南北朝时期，马铠已成为军规较为普遍的装备，而甲骑具装的普遍使用则使骑兵的攻击和防护能力得到了极大提高。 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~","link":"/kewenlu2023/posts/4dab9a1/"},{"title":"省馆之宝：广东，不辞长作岭南人","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 通常，一个省级行政区内最有名的文物都会被收藏到其省博物馆内。所以，”省馆之宝”系列将介绍我国各个省馆的明星文物。每周二更新，本文为第 28 期。 本期介绍广东省博物馆的镇馆藏品。本期选取了 8 件藏品，本期内容全部来自广东省博物馆：官网，更多细节请访问相关网站。 金漆木雕大神龛 根据大神龛龛门上金漆画的落款推断，它是1935年在“贻穀祠”内制作完成的。 这件神龛的两扇门由十二部分装饰而成，龛门正背面和龛内框栏、龛楣、楣栅，镂通雕人物故事、潮剧戏出、花鸟鱼虫、博古炉瓶等题材。龛后壁绘金漆画围屏，上部绘山水、人物和亭台楼阁等图案，下部绘仙鹤、喜鹊等祥禽瑞兽以及瓶花、香炉等图案。这些寓意着富贵吉祥、幸福喜庆的纹样，寄托了人们对美好生活的向往和追求。 潮州木雕是我国主要木雕流派之一，流行于粤东，以其极尽精致的雕刻和髹漆贴金的工艺而独具特色，具有金碧辉煌、富贵华丽的艺术效果。其起源至迟可追溯到唐宋时期，经过明代的发展，至清代达到鼎盛。潮州木雕应用广泛，涵盖建筑装饰、礼祭器具和家具陈设等方面，以宗祠家庙建筑装饰和祭祀用的礼器装饰最为大宗和精致。 潮汕人大多聚族而居，宗族观念极强，祠堂家庙成为崇宗敬祖的重要活动场所，每逢节日祭祀，必然祭拜祖宗，而神龛则是祠堂家庙必备的礼祭用具。它是潮汕民间供奉祖先神位的特制用具，整体造型庄重，制作精巧，是潮州木雕制品中做工最讲究的一种，以金漆木雕装饰最常见。潮汕人自古崇尚孝道，非常重视宗祠文化，把神龛做得精细辉煌，也是对骨肉亲情的一种重视。 宋金项饰 宋金项饰由四股八条金线编织而成，截面呈方形。带钩长条形，中间隆起并饰有花纹，其中一端有四个小圆环，可以用来调整松紧。作为南海I号沉船出水的第一件金器，宋金项饰承载着八百多年的历史。宋金项饰造型素雅，工艺精良，虽沉入沧海近千年，仍光彩夺目。它的工艺并非中国传统风格，暗示沉船或许与海外贸易活动有关。 南海 I 号是目前发现的较为完整的一艘宋代沉船，文物种类和数量都非常多。其中数量最多的是外销瓷器，占据目前出水文物的90% 左右，包含了景德镇窑、龙泉窑、德化窑等窑口的瓷器，样式形制各不相同，都是为海外市场定制。其他已发掘的文物还包括铜铁器、金银器、漆木器等等。宋金项饰在其中仅仅是一件普通文物，其他大量的金项链、金戒指等各类饰品都十分精美。经测量，这些金饰的含金量基本达到95%—98%。 清乾隆农耕商贸图外销壁纸 纵292.1 厘米，横72.4—146 厘米不等 中国壁纸是十八、十九世纪外销商品中的一种时髦饰品，以花鸟、风景、生产、生活等题材为主。“清乾隆农耕商贸图外销壁纸”来自英国英格兰东北部约克郡的一座一级历史保护建筑——夏活庄园大宅（Harewood House），是夏活伯爵拉斯切利斯家族（Lascelles Family）的收藏。据文献记载，亨利·拉斯切利斯是东印度公司商船“约克号”的船长，曾在1741-1748年三次乘“约克号”到访广州，这套壁纸就是亨利到访广州时的订购之物。该套壁纸共有12件，虽然每幅画面题材各不相同，但拼起来是一组完整的水乡稻作、茶叶贸易的广州风土人情写实画，既是当时外销壁纸中的佳作，也是清代早期中英商贸文化交流的重要历史见证。 赵孟頫《行书陋室铭》 纵49厘米、横131厘米，纸本。 赵孟頫（1254-1322），字子昂，号松雪道人、水晶宫道人等，浙江吴兴（今浙江湖州）人。宋宗室，入元后历官至翰林学士承旨，死后追封魏国公。其集诸艺于一身，诗文、道释、金石、音律无一不精，尤以书法和绘画成就最高，在书法史、绘画史上都占有重要地位。 此卷共19行，计86字，曾经国家文物鉴定委员会启功、徐邦达、刘九庵等先生鉴定为真迹。作品虽无纪年，但从印章、署款和书风看，应为赵氏早年作品。原为纸本挂轴，后经蓑衣裱，改为手卷。录书唐刘禹锡《陋室铭》全文，通篇结字扁平，用笔方圆并举，法度谨严，气势端秀，意态古朴生拙，与宋高宗书法在笔道、结体上多有继承之处，从中可以看出作者早年书风“初临思陵”“元贞以前，犹未脱高宗窠臼”的特点。 陈容《墨龙图》·南宋 纵201.5厘米，横130.5厘米 陈容，生卒不详，字公储，号所翁，一说是福建长乐人，也有说是江西临川人，《图绘宝鉴》作福唐（今福建福清）人。南宋端平二年（1235年）进士，曾官福建莆田太守。擅书画，长于松、竹、虎、鹤，尤精画龙，水墨纵横，气势豪壮，为中国写意龙画第一人。 此画无年款，署名所翁作。作品绢本墨笔，以水墨大写意表现独龙于云雾中腾驾，气势非凡。画中笔随形写，墨由状走，浓淡结合，局部见细节，整体见气神。作者运笔控墨得心应手，恰到好处，将龙之精神体貌表现无遗。该画为其代表作。 《群峰晴雪图》·北宋 纵114厘米，横48.2厘米 此画绢本，设色，落款处残缺，仅存“熙宁辛”三字，经考证，为熙宁辛亥年（公元1071年）所作。作品采用烘染、留白手法表现白雪皑皑的山间之景，全景式的构图增强画面之气势感，墨色擦染烘托山体雄浑与庄重，山间蟹爪枯树散布，茅亭楼阁半隐，迭迭山泉涌现，萧寒中平添一分趣味与变化，具有典型的宋代山水画风格。曾为谢稚柳、吴南生收藏，画面上方有谢稚柳题跋印鉴。 西周铜盉（ hé ） 该铜盉通高26.2厘米，造型别致、独特，形体凝重，纹饰繁复，刻缕精细。器身为“鬲”体，龙头型的壶嘴高高昂起，三足分立，扳手由两个缕空的夔龙精巧结合而成，盖体亦精制成凸起的龙头装饰，通体饰夔纹、雷纹和饕餮纹，其形制与纹饰均为均典型的西周器物。 千金猴王砚·清 长25.5、宽17.6、厚2.7厘米 老坑大西洞石。砚堂中有大片鱼脑冻，形似猕猴，侧蹲回首，栩栩如生。砚工因材施艺，将砚面及砚背巧妙设计为花果山、水帘洞意境。砚右侧铭文：千金猴王砚，光绪壬辰禺山何氏闲叟珍藏。砚左侧铭文：郭兰祥作砚，项信南刊字。 郭兰祥为肇庆制砚世家郭家传人，项信南为广州雕刻工匠。 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~","link":"/kewenlu2023/posts/6e513fcf/"},{"title":"省馆之宝：广西，歌舞之乡","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 通常，一个省级行政区内最有名的文物都会被收藏到其省博物馆内。所以，”省馆之宝”系列将介绍我国各个省馆的明星文物。每周二更新，本文为第 26 期。 本期介绍广西壮族自治区博物馆的镇馆藏品。本期选取了 4 件藏品。本期内容全部来自广西壮族自治区博物馆：官网，更多细节请访问相关网站。 翔鹭纹铜鼓·西汉 尺寸：高36.8厘米，面径56.4厘米，足径67.5厘米 鼓面中心为太阳纹，十二芒，芒外七晕圈，主晕为衔鱼翔鹭纹，其余饰栉纹、勾连雷纹和锯齿纹。鼓身九晕圈，饰锯齿纹、圆圈纹、羽人划船纹和羽人舞蹈纹。鼓胸为六组羽人划船纹，每船六人，其中三船的划船者皆戴羽冠，另三船各有一裸体人，船头下方有衔鱼站立的鹭鸶或花身水鸟，水中有游鱼。鼓腰饰八组羽人舞蹈纹，每组二至三人，头戴羽饰，下身系展开的羽裙，两臂外展，双腿叉开作舞蹈状。舞上空有衔鱼的翔鹭。足部一侧卧刻篆文“百廿斤”。铜鼓实测重30750克。 铜鼓是一种平面曲腰、中空无底的敲击体鸣乐器，流行于滇、黔、川、粤、桂、湘、琼等省区，使用于民族生活的不同领域。铜鼓由面、胸、腰、足、耳五部分组成。鼓面圆而平，是敲击发音的部分，下接鼓身，连接部分略外凸，形成球状弧度为胸。腰部略细，内收如束腰。往下鼓身又扩大，呈喇叭口部分为足。鼓身两侧各有两个半环形的耳。鼓面主体为太阳纹，周围有许多层称为“弦”的同心线条，弦数多少不等，弦与弦之间由宽窄不等的图案组成，称为晕圈。鼓身四周的表面，也有多数平行的晕圈，晕圈中铸出的纹饰图案绚丽多彩，有虫鱼、鸟兽、花卉、舟船和人物等。铜鼓制作工艺考究，用以铜为主要成分的铜、锡、铝合金等铸造而成。按不同形制和花纹，铜鼓可分为八个类型：万家坝型、石寨山型、冷水冲型、遵义型、麻江型、北流型、灵山型和西盟型。 该鼓属石寨山型铜鼓。铜鼓是西瓯、骆越的重器，瓯骆人不仅用作伴舞节乐，还曾把它作为权力和财富的象征。铜鼓集冶炼、铸造、绘画、雕塑、音乐、舞蹈于一身，是南方古代民族特有的综合艺术精品。铜鼓文化源远流长，融政治、经济、文化于一体，两千余年绵延不绝。直到今天，我们仍可在许多民族村寨领略到它的奇异风采。 漆绘提梁铜筒·西汉 尺寸：高41.8厘米，盖径13.8厘米，底径13厘米 此器为盛酒器。盖顶有环钮，深直腹，上部有一对铺首衔环耳，系活动提梁，圈足。同类器物在江苏、安徽、河北、辽宁、宁夏、山西、山东、陕西等地汉墓均有出土。其形状类似今广西壮族、苗族、瑶族人民外出劳动时随身携带用以盛水或装粥的竹筒。此器盖面绘勾连云纹，足部绘菱形纹。器身漆绘，上下共四段，每段均自成一个完整的画面。 第一段似二人观斗兽。画面右方绘一独角兽，面对一似虎之物。独角兽腾空而起，向前猛冲；虎，劲向前，右前肢抬起，迎上。画面中间有一朱雀。 第二段分为两组：一组绘两人围一朱雀及一兽对舞；另一组是一人荷矛牵犬前行，一人跪送。 第三段分为三组：第一组一人骑虎；第二组有三人，一人负长矛而立，一人腋下挟剑而跪，一老者策杖而行；第三组三人，以一高柄灯为中心，灯左方一人，侧身而立，似在言语，灯右侧二妇人，一前一后跪坐。 第四段分为三组：第一组是画面左方，一人在奋力搏兽；第二组二人位于画面中间，相跪而揖；第三组二人戴冠，着深衣相向而揖。 漆绘画面的内容，以上、下不同层次展开，这种表现方式正与长沙马王堆一号汉墓所出T行帛画相同。所画题材，造型生动，线条流畅，给人以惟妙惟肖之感。其中，人物的造型、服饰可在战国楚人绘画遗物中找到源头，并且，画面中两次出现的朱雀是楚人艺术创作中最为常用的母题之一。此外，画面的构图亦颇具匠心。故事的发生是以人物的行为动态提领情节，期间以流云、花木以及山岭补白，显得详略得当，浑然一体。作为一件难得的艺术品，此幅漆画是研究当时有关情况的重要实证。 人面纹羊角钮铜钟·西汉 尺寸：通高19厘米，纵径8.1厘米， 横径4厘米，底宽14厘米 钟呈半截橄榄形，上小下大，顶有羊角形扳钮，上端开长方形孔。鼓部正面铸有浮雕式的人面纹：人面呈桃子形，脸庞轮廓及眼、鼻、口突起，清晰显现；头顶一对倒八字形外撇的弯角，形若羊角；人面的两眼平视、双唇闭合，神态威严肃穆。合模铸成。 羊角钮钟流行于战国晚期至西汉初，是一种极富地方特色的青铜打击乐器。已知最早的羊角钮钟出土于云南楚雄万家坝的春秋晚期墓，但以岭南发现最多，如广西、广东、云南、贵州、湖南等省区及越南北部。在广西，除贵县外，浦北、西林、容县也有出土，形制大致相同。 与铜鼓一样，羊角钮钟作为古越人使用的重要的打击乐器，其在战国至汉代瓯骆文化遗迹——左江崖壁画中有描绘：在首领的带领下，伴随着敲击羊角钮钟、铜鼓等发出的节奏和音律，祭祀人群翩翩起舞。 经测音，此人面纹羊角钮铜钟正鼓音为#C5-27、侧鼓音为E5-4。音高、律制与同墓共出的“布”字铭钮铜钟、铜锣、铜鼓完全相同，可与这些乐器合奏本地特有的音乐旋律，广泛应用于各种祭祀等活动。 除了实用功能外，羊角钮钟还被赋予了作为权力和财富象征的社会功能。 马承源先生主编的《中国青铜器》指出，“人面纹是一种半人半兽的怪神，有的仅有面部，有得还有兽的身躯，面部虽为人形，但还包含兽类的特点，如头上长角，口中有獠牙”。装饰人面纹的器物，多是专用于祭祀活动的青铜礼器或巫术祭祀中的用品。装饰人面纹的羊角钮钟，被赋予了“天神”的威严和法力，占有它的人变为可以与天上神仙沟通、传递各种世俗愿望的“人神”。“通天达地”、“人神合一”，也是统治者用来显耀其权力和财富、神化自身以巩固其统治地位的工具。 羊是古越人所尊崇的图腾神之一。羊角钮钟上的人面头顶饰有一对外撇的羊角，应是古越人对羊图腾崇拜的体现。 羽纹铜凤灯·西汉 尺寸：通高33厘米，长42厘米，宽15厘米 灯作凤鸟形，顾首回望，双足分立，尾羽下垂及地。足与尾形成鼎立之势以支撑灯身。头、冠、颈、翅、尾、足各部位轮廓清晰，比例匀称。通体细刻羽毛，精致美观。凤鸟背部有一圆孔，用以放置长柄灯盏。凤鸟口内衔喇叭形灯罩，垂直对准灯盏蜡锥柱上方。凤鸟颈部由两段套管衔接，可以自由转动和拆卸，便于调节灯光和冲洗体内烟尘。灯罩与颈部及腹腔相通，腹腔中空，可以贮水。当灯盏中的蜡烛点燃时，烟灰经灯罩纳入颈管，再由颈管导入腹腔，最后溶入水中。 此羽纹铜凤灯具有三个特点。 一是造型独特。该灯凤鸟造型，灵巧优美、活泼可爱，寓意吉祥，富于浓郁的生活气息。 二是工艺先进。该灯的铸造采用了汉代分铸法；纹饰采用西汉时期流行于我国南方，特别是岭南地区的一种新兴錾刻花纹工艺。 三是构思巧妙。在油灯上加装导烟管，将环保思想应用于灯具的设计制作中，是汉代首创，在世界灯具史上也处于领先地位。类似功能的汉代灯具不断被考古发掘，如河北出土的长信宫灯、山西出土的彩绘雁鱼铜灯等，说明利用清水净化烟尘的科学思想在西汉时期受到人们的普遍重视。 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~","link":"/kewenlu2023/posts/cbf71fb5/"},{"title":"省馆之宝：西藏，世界屋脊","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 通常，一个省级行政区内最有名的文物都会被收藏到其省博物馆内。所以，”省馆之宝”系列将介绍我国各个省馆的明星文物。每周二更新，本文为第 27 期。 本期介绍西藏博物馆的镇馆藏品。本期选取了 6 件藏品，其中第一件为禁止出国(境)展览文物。本期内容全部来自西藏博物馆：官网，更多细节请访问相关网站。 元“统领释教大元国师之印”龙钮玉印 长12.2厘米，宽12.2厘米，高12厘米。玉质青色。扁方形，龙钮。印文为八思巴文，内容是“统领释教大元国师”的藏文译音。整器雕琢而成，造型庄重古朴，是典型的元代官方重器。 说唱帽 说唱格萨尔时需要佩戴说唱帽，展柜中展示的这件就是西藏已故著名艺术家土登先生捐赠给西藏博物馆的，旁边的书籍详细记录了帽子上的每个饰物所代表的寓意。在西藏，目前规模盛大、影响广泛的三大赛马节要属那曲恰青赛马节、当吉仁赛马节、江孜达玛节。除了赛马、骑马射箭、骑马拾哈达等活动外，还有会举行摔跤、抱石头、拔河等竞技比赛，使节日氛围更加热烈。 嘎乌 嘎乌为藏语音译，即佛盒。人们将护法神、印着经文的布片、纸片或舍利子等放入盒中，佩戴在身上以求平安。随着经济社会的发展，嘎乌的材质和工艺也愈加考究，功能也日益朝着装饰的方向发展。女性佩戴的嘎乌以金、银、铜等材质居多，形状有圆、椭圆、星形等，表面雕刻多种吉祥图案，并镶嵌玛瑙、绿松石、珊瑚等宝石，佩戴于胸前。男性的嘎乌则一般为方形，且器形较大，金属表面镶嵌物较少，一般斜挂于左腋与左臂之间。 角质酒壶 西藏人民饮酒一般使用木碗，讲究的人家会将质地优良的木碗用纯银包裹，并镶嵌宝石。由于角质用具易于携带，且硬度大不易破损，因此，游牧地区角质酒壶较为普遍。“匝阔”是代表性的农区酒具，“匝”是陶的意思，从名称可以看出，这种酒具最初是陶制品，目前看到的多为铜质，在日喀则等传统农耕地区，是盛行。婚礼或者新年等重要庆典上使用的一种酒具。 皮质糌粑袋 糌粑是西藏人民的一种主食，食用时所使用的器具有传统的木质糌粑盖碗、瓷碗、羊皮糌粑袋等。把糌粑倒入羊皮袋中，再倒入适量茶水、酸奶或青稞酒后用力揉搓成块状便可食用，这种用具一般在外放牧或者田间劳作时使用，最大的特点是便于携带，干净卫生。 佛教造像·不空成就佛 在持续受到祖国其他地区以及印度、尼泊尔、克什米尔等地佛教造像艺术的影响下，结合西藏各时期各地不同的政治、文化、经济面貌，西藏地区佛造像艺术逐渐形成不同地方特色。这里陈列的这些精美佛教造像，就是按照元明时期典型的本地风格流派进行分类的，大家首先看到的这件不空成就佛，即为丹萨替风格造像。丹萨梯塑佛像一般具有脸型宽大，面部饱满，装饰繁缛等的特点，现存世量极少。 双体陶罐 开始制作陶器也是进入新石器时代的特征。卡若陶器的制作手法为手制，所以器形不规整，类别比较简单。随着时代的发展与进步，人们很快就掌握了泥条盘筑和轮制法，卡若先民的制陶技术才得到一定发展，能够制造出更加精美的陶器。这件陶器是我馆的镇馆之宝—-双体陶罐，形体好像两只小兽相向而立，颈部和肩部设计了一对带孔钮，既巧妙地表现出动物的耳与尾，还为方便携带而穿绳之用。此件双体陶罐无论从器形还是纹饰，都体现出与同时期出土的陶器与众不同的特点，不仅代表了当时卡若文化的最高制陶水平，而且体现出了卡若先民高超的器物造型能力，是新石器时代西藏陶器的代表和点睛之作，初步认为，这件陶罐是卡若先民在庆典和祭祀活动中使用的一种礼器。 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~","link":"/kewenlu2023/posts/b332288e/"},{"title":"看球去了：川足复兴","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 是的，虽然又上了一天班了，但直到这会儿我整个人还是麻木的状态。 四川九牛代表四川，在昨天的中甲比赛中提前三轮获得了明年的中超联赛的比赛资格。换句话说，四川九牛已经提前冲超了，而我就在现场，也是上面这张图片的组织者之一。 很感动啊，这是在有职业足球联赛 30 年以来，四川队真正意义上的第一次从零开始升入顶级联赛。想到了很多，在现场久久没有离去。 经常看足球的朋友，或者对中国足球比较了解的朋友，会知道成都蓉城已经在中超联赛中征战了两个赛季。而成都蓉城在成都市足协注册，四川九牛在四川省足协注册，这是两个平级的单位，所以互相不能代表彼此。球迷之间以成都队、四川队区分他们。 但在更多的普通球迷看来，这其实根本没有什么区别，都是代表四川省的足球，都是代表川足。而这一刻，两支职业足球队都深升入了顶级联赛，这也标志着四川的足球站到了历史高位。很多球迷也激动的表示，明年可以买两张套票，看不过来了都。 川足复兴，这 4 个字用在这个时候最不为过。 作为一个陪伴成都蓉城队、四川九牛队走到现在的球迷，真的是很幸福！ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~","link":"/kewenlu2023/posts/6bed66e6/"},{"title":"科技：Megapack，特斯拉落地上海的新项目","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 特斯拉近日宣布将在上海新建一家超级工厂，专门生产该公司的储能产品 Megapack，这也是特斯拉在美国之外的首个 Megapack 超级工厂。其官网也已有了该项目的简单介绍。 这里，我们来了解一下这是一个什么项目。 Tesla Megapack 是 Tesla 公司旗下的清洁能源子公司 “Tesla Energy” 生产的大型可充电锂离子电池固定式储能产品，产品面向电池储能站。 简单讲，这有点类似于大的“充电宝”的形态。 该产品在 2019 年首次推出，每个 Megapack 最多可存储 3.9 兆瓦时 (MWh) 的电力。尺寸上，每个 Megapack 略小于一个标准的集装箱。 Megapack 专为公用事业和大型商业项目而设计。比如可以将它用来存储类似太阳能、风能这类间歇性产生能量的可再生能源，再在电力需求高峰期由电网分配使用。甚至可以基于它组建一个本地小电网。 除此之外，Tesla 还提供了面向家庭的类似储能产品“Powerwall”，能存 13.5 kWh。 但是。。。特斯拉目前并没有在中国开展 Megapack 储能业务。 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~~ 至少，点个赞再走吧~","link":"/kewenlu2023/posts/8dc05b28/"},{"title":"科技：分割一切！AI视觉领域奋起直追","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 自从 ChatGPT 横空出世，AI 的各个领域好像都被点燃了。 与自然语言处理同为热门的计算机视觉（Computer Vision）领域今天爆出大进展——Meta（前Facebook） AI 研究院发布并开源了他们在 CV 领域的最新研究成果，“分割一切模型”。 图像分割任务不存在了？ 分割，识别哪些图像像素属于一个对象，是计算机视觉的核心任务，并被广泛应用于从分析科学图像到编辑照片等一系列应用中。但是，为特定任务创建准确的分割模型通常需要高度专业化的工作，也意味着需要在 AI 基础设施上通过大量经过标注的领域内的数据进行训练。 用眼睛分辨眼前的不同物体容易，用摄像头看可就难了，因为图片对于计算机来说，就是“扁平”的“一坨”​。所以，无数的科学家、工程师无时无刻不在研究如何将图片上物体分割开，从而达到“识别”对象的​目标。 ​Meta 提出的“分割一切模型”(SAM，Segment Anything Model) 可以根据用户的类似点击、框选的选择动作，从图像上自动产生掩膜（Mask），也就意味着能自动把想分割的图像部分“抠”出来。比如下面这张图就展示了它强大的分割能力。完全自动化的。 最重要的是，这又是一个“大模型”。官方号称这个模型的训练数据集包含 1100 万张图片跟 11 亿个掩膜，从而拥有了对未知分割任务的强大处理能力（zero-shot learning）。 因为通常的图像分割任务，都是从特定领域的数据集训练，再在同样的领域里完成新的任务。 这仿佛是又干掉了一大波儿图像分割研究方向的工作了。 Demo目前该项目已在 GitHub 开源，地址是 facebookresearch/segment-anything. 同时，官方提供了在线Demo，我试着“抠”了一下，效果不错。 下面这张图片是来自网络的“新”图片， 通过左侧的“Everything”一键分割出所有“零部件”， 惊呆😂 基于此模型的一大波儿创业项目即将来袭~ ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~","link":"/kewenlu2023/posts/fdbc7ed9/"},{"title":"科技：哪些工作可能被AI取代？","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 最近，ChatGPT 衍生的 AI 产品越来越多的出现在了我的生活中。断档式升级的产品也把前浪狠狠的拍在了沙滩，而这种大趋势短期之内应该是不会停止了。 突发奇想，我问了 AI 几个有意思的问题，相信也是很多人想知道的。看看 AI 自己怎么说。 以下回答来自微软 BingGPT， 哪些工作可能被 AI 取代？人工智能（AI）已经在许多领域取得了成功，但是有些工作仍然需要人类的技能和判断力。根据知乎上的一个问题，被AI取代概率最高的十大职业包括电话推销员、打字员、会计等。 但是，这并不意味着所有工作都会被AI取代。例如，需要创造性思维和判断力的工作，如艺术家、作家、设计师等，以及需要人类情感和同理心的工作，如医生、护士、教师等，都不太可能被AI取代。 如果我的工作被AI取代了，我该怎么办？如果您的工作被AI取代了，您可以考虑以下几个方面： 了解自己的技能和兴趣，寻找新的职业方向。 学习新的技能，以适应新的工作市场。 与人工智能合作，以提高工作效率和质量。 参与社区和行业活动，以了解最新的工作趋势和机会。 这一次AI的高热度是虚假繁荣吗？人工智能的热度是真实的，而不是虚假的繁荣。事实上，人工智能正在对经济产生重大影响。有证据表明，人工智能相关活动的数量正在大幅增加，包括机器人出货量、人工智能初创公司和专利数量等。此外，最近的研究表明，人工智能和机器人技术有潜力提高生产率增长，但也可能导致某些职业的消失。 AI会不会给人类带来毁灭性的灾难？人工智能的发展可能会带来一些风险，但并不一定会导致毁灭性的灾难。许多人认为，人工智能可能会导致某些职业的消失，但也可能会创造新的职业。此外，人工智能的发展还可能会带来一些道德和法律问题，例如隐私、安全和责任问题。 总之，人工智能的发展是一个复杂的问题，需要我们认真考虑其潜在的风险和机遇。 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~~ 至少，点个赞再走吧~","link":"/kewenlu2023/posts/207c4c58/"},{"title":"科技：杀疯了的OpenAI","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 随着 ChatGPT 以超高热度走进人们的生活中，其背后的公司 OpenAI 也被推上了风口。就在年初，他又获得了微软的 100 亿美元的投资。今天就来简单介绍下 OpenAI，这家神奇的新时代公司。 参考资料Wiki：OpenAI。 简介OpenAI 是一家美国的人工智能（AI）研究型实验室，由非营利性的OpenAI 公司（OpenAI Inc.）及其营利性子公司 OpenAI 有限合伙公司（OpenAI LP）组成。OpenAI 宣称其研究动机为促进和开发友好型人工智能（FAI）。现在约有 375 位雇员。 这个组织于 2015 年在旧金山，由 Sam Altman, Reid Hoffman, Jessica Livingston, Elon Musk, Ilya Sutskever, Peter Thiel 等人捐资 10 亿美元成立。（对，就是特斯拉那个马斯克） 马斯克于 2018 年从董事会辞职，但仍是捐赠者，并最终承诺捐赠 1 亿美元。 微软在 2019 年向 OpenAI LP 提供了10亿美元的投资。并最终成为 OpenAI 的主要投资者。 创业简史 2015~2018，以非营利属性开始 2019，转向盈利属性 2020 至今，推出多个爆款产品，展开和微软的合作 爆款产品Gym 这个我在 2018 用过，感谢！❤️ 2016 年，Gym 发布。该应用提供了各种各样的环境，以统一各类应用的评价标准。这大大的促进了不同算法之间的能力可比性。 OpenAI Five2017 年首次亮相，这个是和 AlphaGo 类似的竞技游戏类产品，他玩的是 5v5 的 Dota 2。 2019 年 4 月，OpenAI Five 在四天进行了 42729 场比赛, 获得了 99.4% 的胜率。 DALL-E &amp; CLIP2021 年，DALL-E 发布。 之前的文章有介绍，这是一个利用深度学习，根据语言描述，生成图片的应用。 同年发布的 CLIP 功能相反，他可以对给出的图片进行描述。 2022 年，DALL-E 2 发布。 GPT，Generative Pre-trained Transformer2018 年，GPT 发布，指出自然语言的生成式模型可以获取和处理知识。 2019 年，GPT-2 发布，使用无监督生成式语言模型。他可以写假新闻了。 2020 年，GPT-3 发布，该模型用于实现问答、语言翻译。 2022 年，GPT-3.5 发布，它更响亮的名字叫 ChatGPT。该应用一经问世，在被追捧度上创造了多个历史。 本月，OpenAI 发布了 GPT-4。在诸位还在追赶 ChatGPT 时，他已完成自我再次升级。 反思我们常说人工智能的三驾马车：数据、算法和算力。 前些年，我们和其他国家都在同一起跑线上开始征途。从科研成果上看，其实我国的从业者在算法和算力这一块儿其实并没有明显短板。甚至在个别领域时不时还能搞几个大新闻。（数据我不太懂，因为跟业务相关，我直觉上感觉我们应该是不缺的，可能需要花钱去做标注。） 但随着 ChatGPT 的横空出世，算法上的差距好像凸显了出来。甚至前些年开始就重注 AI 的百度公司，在推出类似的工具后迎来了“群嘲”。 算法上的差距和算力也是脱不开干系的，比如前文提到的 OpenAI Five 就使用了 256 个 P100 同时训练。现在好像慢慢的变成了一个拼大模型训练，根本上也就是拼算力的发展阶段。我国在超算事业中一直在全球占据着领先地位，但那是说的类 CPU 的科学计算能力，而这并不适用于可能需要高带宽、大容量的 AI 模型训练。现在回想起，去年的尖端 GPU 对华禁售其实可能就是美国下的一盘大棋的其中一步。 高算力支撑 AI 技术的运用，从而产出新 AI 时代的各类大模型。这对我们的算力和算法又提出了更加紧急、更加严苛的要求。 衷心希望，我们别掉队。~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~~ 至少，点个赞再走吧~","link":"/kewenlu2023/posts/e2abcef/"},{"title":"老外：美国春晚——超级碗","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 今天早上7点半，2023 年超级碗在美国的亚利桑那州格伦代尔的State Farm体育馆正式进行，对阵双方是费城老鹰队与堪萨斯酋长队。最终，堪萨斯城酋长 38-35 绝杀费城老鹰，夺得第57届超级碗冠军，这也是酋长时隔3年再次夺冠，明星四分卫马霍姆斯也收获了生涯第2冠。 由于比赛自带的“暴力”属性，具体比赛说实在的大多数当下的国人应该不太感冒。但既然这么有趣，今天就来了解下这项美国之最的体育赛事！ 美中不足“美中不足”都知道哈？说的就是美国和中国虽都贵为超级大国，但都不怎么能踢足球。 咱们就不提了。 美国人是真的没把足球当世界第一运动，因为橄榄球才是他们的最爱。 还记得美国人和英国人关于“足球”的英文是什么的争论吗？是的，和世界上大多数的英语国家不一样的是，美国人管橄榄球叫 football。 那要这么说的话，跟英国人一样，football 都是他们的第一运动。 超级碗 wiki/超级碗 超级碗（英语：Super Bowl）是全国橄榄球联盟（也称为国家橄榄球联盟，NFL）的年度冠军赛。 各位看这个杯，应该都比较熟悉上面的 NFL logo 吧！ 伴随比赛举行还会有盛大的庆祝活动。超级碗一般在每年 1 月最后一个或 2 月第一个星期天举行，那一天称为超级碗星期天（Super Bowl Sunday）。 参与球队为该球季的美国橄榄球联合会（AFC，旧AFL）冠军以及全国橄榄球联合会（NFC，旧NFL）冠军。所以第一届超级杯，就叫 AFL-NFL 世界冠军赛（AFL-NFL World Championship Game）。 超级碗多年来都是全美收视率最高的电视节目，并逐渐成为一个非官方的全国性节日。在超级碗开场前和中场休息的时候，会有很多流行歌手和声乐人进行演出。另外，超级碗星期天是美国单日食品消耗量第二高的日子，仅次于感恩节。 为让全国观众能欣赏超级碗赛事，在超级碗赛事举行当日多项体育赛事均会作出让步。如NBA则在超级碗赛事当日只举行 1-2 场赛事，而且都在当地时间中午举行以配合超级碗的比赛时间。 超级碗中场秀，美国春晚超级碗被誉为“美国春晚”的另一项重要原因，是它的中场秀。 和国内春晚百花齐放的表演不太一样的是，它一般就一个嘉宾，在十几分钟内完成所有表演。当然，能站上这个舞台的人几乎都是享誉世界的艺人了，迈克尔杰克逊（就是从他开始，超级碗中场秀声名鹊起）、碧昂斯、U2、麦当娜等等都曾奉献过经典演出。而且据传，跟咱们春晚差不多，超级碗中场秀都是零出场费。 今年登台的是流行天后蕾哈娜（Rihanna），她已淡出演艺事业多年。这次一个人的专场秀也是凸显了她的地位​！ 我觉得蕾哈娜最厉害的是，她还挺着个大肚子，相信你们也能从图片上看出来。她的孩子将来知道自己已经上过超级碗中场秀了，一定会很激动。❤️❤️❤️ ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~~ 至少，点个赞再走吧~","link":"/kewenlu2023/posts/b037c440/"},{"title":"致敬：“请帮助乌干达的可怜孩童！”","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 VIM 和 EMACS 是 Linux 下的两大著名文本编辑器，是每一个 Linux 系统上工作的人都会接触的程序。 “请帮助乌干达的可怜孩童!”这句话相信他们也不会陌生，因为在打开 VIM 时的欢迎界面上总会有这么一句话。直到最新的版本，这句“Help poor children in Uganda!”依旧存在。 这是 VIM 的作者 Bram Moolenaar 的初心。 Bram Moolenaar，荷兰工程师，长期支持ICCF Holland，帮助乌干达的孤儿中心，扶助当地因为爱滋病流行产生的大量孤儿。 2021 年，他从 Google 退休。 直到今年 7 月，他仍在 VIM 项目提交代码。 8 月 3 日， Bram 与世长辞。 致敬大佬！ :wq 都看到这儿了，不如关注每日推送的“科文路”、互动起来~","link":"/kewenlu2023/posts/89f5b4a5/"},{"title":"航天：中国首次火星探测火星全球影像图发布","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 “格物致知 叩问苍穹”，中国航天日 4 月 24 日，在合肥举行的 2023 年“中国航天日”主场活动启动仪式上，国家航天局和中国科学院联合发布了中国首次火星探测火星全球影像图。 本次发布的影像图为彩色，包括按照制图标准分别制作的火星东西半球正射投影图、鲁宾逊投影图和墨卡托投影加方位投影图，空间分辨率为 76 米，将为开展火星探测工程和火星科学研究提供质量更好的基础底图。 更多请访问“格物致知 叩问苍穹”，中国航天日。 都看到这儿了，不如关注每日推送的“科文路”、互动起来~","link":"/kewenlu2023/posts/df6cecf6/"},{"title":"荐影：看了《流浪地球2》，震撼","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 啊！收假就连上了 7 天班，真是太难了。 终于周末得空去看了《流浪地球2》。 这部电影本身的话也不用过多推荐，因为就当前 30 多亿的票房来看说明很多人已经观影了。 首先要说的是，《流浪地球2》算是《流浪地球1》的前传，但《2》和《1》在观影节奏上其实没有多大的关联。也就是说，没看过《流浪地球1》对看这部电影影响不大。 喜欢科技的人看这部电影应该会更好一点。比如当“太空电梯”出现在我眼前的时候，我整个人都惊呆了。一是诧异于这个神奇的创意，而是感叹这惊艳、恢宏的效果。这真的是中国电影吗？好像除了这部片子我还没有在其他国产电影上得到过类似的“科技震撼感”。 不喜欢科技的妈妈们，也可以带小孩走进电影院去体验一下。我觉得这部电影至少会给小孩们一些想象空间的拓展。我们很多人不就是不经意间的一些感悟，就自那时起决定了理想的方向吗。 大爷们当然也适合啦！这么重要的吹牛素材。 好了，这么好的电影我说的多也不见得能增光添彩，就亲身观看吧。祝国产科幻一路长红！ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~~ 至少，点个赞再走吧~","link":"/kewenlu2023/posts/11038c4a/"},{"title":"荐歌：1812序曲（柴可夫斯基）","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 周末愉快！ 最近在新公司恢复了 965 的工作节奏，优点是傍晚收工早，不足是我得早起了，10 点半才到公司的风格已然成为历史。😂 不过早睡早起应该更健康吧！ 最近基本上一到公司，我就戴上耳机打开柴可夫斯基的音乐听，其中印象比较深的就有这首《1812序曲》（《1812 overture》）。 《1812序曲》（降E大调，作品第49号）是柴科夫斯基于 1880 年创作的一部管弦乐作品。为了纪念 1812 年库图佐夫带领俄国人民击退拿破仑大军的入侵，赢得俄法战争的胜利。 诶，写的这会儿我就想啊，我大学也上过一学期的交响乐赏析课，要不我来做个《世界交响乐赏析》专题系列吧！ 把这个国内略显小众，但却是极富魅力的音乐领域推广推广，也算是对得起当时贺老师的栽培了。 今天的这个《序曲》就作为这个系列文章的序曲吧！后面会重新介绍一下这个神曲。 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~","link":"/kewenlu2023/posts/da545774/"},{"title":"荐歌：Letting_go（汪苏泷，吉克隽逸）","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。荐歌：晚安（麻园诗人） 周五愉快！ 这周的最热歌曲应该没多少争议了——《Letting go》，由汪苏泷和吉克隽逸在天赐的声音上带来的演唱。 汪苏泷真是越来越“妖”了，频频整些好歌和翻唱出来，还能附加几条段子视频。认真践行歌和人，各火各的。😁 原唱蔡健雅。 12345678910111213141516171819202122232425262728293031323334353637383940414243444546474849505152这是一封离别信写下我该离开的原因我在你生命中扮演的角色太模糊了你对我常忽冷忽热我到底是情人还是朋友爱你是否不该太认真That’s whyI’m letting go我终于舍得为你放开手因为爱你爱到我心痛但你却不懂I’m letting go你对一切的软弱与怠惰让人怀疑你是否爱过我 真的爱过我为你再也找不到借口That’s when we should let it go你是呼吸的空气脱离不了的地心引力你在我生命中 曾经是我存在的原因或许就像他们说爱情只会让人变愚蠢自作多情 爱得太天真That’s whyI’m letting go我终于舍得为你放开手因为爱你爱到我心痛但你却不懂I’m letting go你对一切的软弱与怠惰让人怀疑你是否爱过我 真的爱过我为你再也找不到借口That’s when we should let it go在夜深人静里想着心不安 却越沸腾我无助 好想哭 我找不到退路在夜深人静里写着心慢慢就越变冷我不恨 也不哭 我的眼泪 早已哭干了'Cause I’m letting go我终于舍得为你放开手因为爱你爱到我心痛但你却不懂I’m letting go你对一切的软弱与怠惰让人怀疑你是否爱过我 真的爱过我为你再也找不到借口That’s when we should let it go ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu2023/posts/dcdfcd04/"},{"title":"荐歌：Love_yourself（Justin_Bieber）","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 周末了，轻松一点。 Love yourself，主创 Ed Sheeran，演唱 Justin Bieber。 旋律轻松，编曲简洁，演唱到位。每次一听到这首歌就能非常放松。 完美开启惬意周末~ 对了，MV 也很不错。 123456789101112131415161718192021222324252627282930313233343536373839404142434445464748495051525354555657585960616263646566676869707172737475767778798081828384858687888990919293949596979899100101102103104105106107108109110111For all the times that you rained on my parade一直以来你都在扫我的兴And all the clubs you get in using my name你打着我的名号在夜店寻欢作乐You think you broke my heart oh girl for goodness sake你以为你伤透我心 天啊You think I'm cryin' on my own well I ain't你以为我会独自流泪 但其实我没有And I didn't wanna write a song我甚至都不愿为你写歌'Cause I didn't want anyone thinking I still care因为我不想别人认为我还在乎I don't but you still hit my phone up我不在乎 但你却总是打我电话And baby I'll be movin' on宝贝我早已放下And I think you should be somethin'我想你是某某I don't wanna hold back我不想挽回的人Maybe you should know that也许你该明白My mama don't like you and she likes everyone我妈待人和善 但不喜欢你And I never like to admit that I was wrong我从不愿承认我曾经错了And I've been so caught up in my job didn't see what's going on一直以来我都醉心工作 不知发生何事But now I know I'm better sleeping on my own但现在我发现自己独眠睡的更香'Cause if you like the way you look that much如果你喜欢现在自己的模样Oh baby you should go and love yourself宝贝你应该继续去爱这样的自己And if you think that I'm still holdin' on to somethin'如果你错认为我依然怀念曾经You should go and love yourself你该释怀好好爱自己But when you told me that you hated my friends当你告诉我你讨厌我的朋友The only problem was with you and not them唯一的问题应该是你而不是他们And every time you told me my opinion was wrong每次你说我的观点错误And tried to make me forget where I came from并且试图让我忘记初心And I didn't wanna write a song我甚至都不愿为你写歌'Cause I didn't want anyone thinking I still care因为我不想别人认为我还在乎I don't but you still hit my phone up我不在乎 但你却总是打我电话And baby I'll be movin' on宝贝我早已放下And I think you should be somethin'我想你是某某I don't wanna hold back我不想挽回的人Maybe you should know that也许你该明白My mama don't like you and she likes everyone我妈待人和善 但不喜欢你And I never like to admit that I was wrong我从不愿承认我曾经错了And I've been so caught up in my job didn't see what's going on一直以来我都醉心工作 不知发生何事But now I know I'm better sleeping on my own但现在我发现自己独眠睡的更香'Cause if you like the way you look that much如果你喜欢现在自己的模样Oh baby you should go and love yourself宝贝你应该继续去爱这样的自己And if you think that I'm still holdin' on to somethin'如果你错认为我依然怀念曾经You should go and love yourself你该释怀好好爱自己For all the times that you made me feel small一直以来你让我感觉渺小I fell in love now I feel nothin' at all可我现在坠入爱河却感到无畏I never felt so low and I was vulnerable遇见你之前我从未如此卑微和脆弱Was I a fool to let you break down my walls我像个傻瓜让你打破我的心墙'Cause if you like the way you look that much如果你喜欢现在自己的模样Oh baby you should go and love yourself宝贝你应该继续去爱这样的自己And if you think that I'm still holdin' on to somethin'如果你错认为我依然怀念曾经You should go and love yourself你该释怀好好爱自己'Cause if you like the way you look that much如果你喜欢现在自己的模样Oh baby you should go and love yourself宝贝你应该继续去爱这样的自己And if you think that I'm still holdin' on to somethin'如果你错认为我依然怀念曾经You should go and love yourself你该释怀好好爱自己 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~","link":"/kewenlu2023/posts/ea881380/"},{"title":"荐歌：MC來了（MCHotDog热狗）","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。荐歌：MC來了（MCHotDog热狗） 周末愉快！ 据说是全国范围的大降温啊，应该都感受到了吧。除了前两天北京、河南那些地方下雪，今晚微信群里好几个南方城市的朋友也很激动所在的城市下雪了。 应该南方人比北方人更激动，哈哈。 我突然想起来一首比较应景的抖音神曲，MC热狗的说唱《MC來了》。 歌词第一句“台北下 了雪 你說 那是保麗龍”里的“保丽龙”说的就是聚苯乙烯，也就是我们常见的家电包装的那种白色泡沫塑料。 晚安！ 12345678910111213141516171819202122232425262728293031323334353637383940414243444546474849505152535455565758596061626364656667686970台北下 了雪 你說 那是保麗龍耶誕 夜的配色 也不配黃綠紅叮叮噹 叮叮噹聽 到我的手機鈴聲 你別太緊 張聖誕夜驚魂 從晚上 玩到清晨打得火熱的情人 融化了雪人越冷越開花 原本是呆瓜因為聖誕 節我們全部變成嗨咖放些應景的歌 我們盡情的喝今年或許過的很苦 但今天我們可樂Last Christmas you broke my heart今年耶誕 我要Party like a RockStar每 個地方都變成皇宮宅男都出動 我看到盧廣仲100種生活聖誕 節也只有一種祝你耶誕快樂 它淺顯易懂MC又來了就是Merry ChristmasMC又來了 MC又來了最想念的季節我的MC又來了Merry Christmas 我想 要對你說Merry Christmas我想要對你說Merry Christmas 我想要對你說Merry Merry Christmas最想念的季 節 我想念著你耶誕的老公公 不小心洩了底像個孩子在夜裡 暗自竊喜我的MC又來了 卻不是在指月經U know I meaning? 它一年只來一次只要你快樂 其他都是其次叮叮噹 叮叮噹當你收到我的簡訊 你是否放在心上你會保留它 還是刪除?現在的你是兩個人 還是單獨?你的他 是白馬王子 還是蟾蜍?該不會是你有小孩了 就像吳淡如時間還早 還不想回家最 的MC幫聖誕節制造火花別 再聽喬治麥可的Last Christmas今年耶誕就聽我的 這首吧MC又來了就是Merry ChristmasMC又來了 MC又來了最想念的季節我的MC又來了Merry Christmas 我想 要對你說Merry Christmas 我想要對你說Merry Christmas 我想要對你說Merry Merry Christmas(伴奏)不可 能下的雪 已經下在了台北不可能遇見的人 或許正在和我派對不可能說的話 那可能先不說話罐頭簡訊它再誠懇 也嫌多話我是聖誕節姜餅人 把餅做大當MC又來了 默默許下願 望或許 它永遠不可能會實現But who cares?今天是聖誕節MC又來了就是Merry ChristmasMC又來了 MC又來了最想念的季節我的MC又來了Merry Christmas 我想要對你說Merry Christmas 我想要對你說Merry Christmas 我想要對你說Merry Merry ChristmasMC又來了就是Merry ChristmasMC又來了 MC又來了最想念的季節我的MC又來了Merry Christmas 我想要對你說Merry Christmas我想要對你說Merry Christmas 我想要對你說Merry Merry Christmas ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu2023/posts/482429e0/"},{"title":"荐歌：My_love（西城男孩Westlife）","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。荐歌：My_love（西城男孩Westlife） 周末愉快啊！ 这两天成都最大的体育盛事，就是国足来成都打比赛。其中一场是明天。 整个票务过程非常狗血，最终还是交给经验丰富的大麦解决了。明天比赛，今天才正式开票，也是没谁了~ 抢票的过程中，因为比赛地点是凤凰山专业足球场。由于球票还没开售，在抖音的这个地点的团购选项上一直显示着“西城男孩”Westlife。 一时间回到高中时代的感觉。 搞笑的是，哼了几天《as long as you love me》都没发现这是“后街男孩”Backstreet boys 的歌，哈哈。后知后觉后，找到了他们的代表作《My love》。 这，着实还是很经典的回忆杀了。 1234567891011121314151617181920212223242526272829303132333435363738394041424344454647484950515253545556575859606162636465666768697071727374757677787980818283848586878889909192An empty street,an empty house,a hole inside my heart空荡的街道，空荡的家，心中一直有个缺口I'm all alone and the rooms are getting smaller我一个人感受着房间在变小I wonder how,I wonder why,I wonder where they are我想不明白它们都去哪了The days we had,the songs we sang together我们一起的日子 一起唱的歌Oh yeah哦 耶And all my love,I'm holding on forever我的爱 我会始终坚持Reaching for a love that seems so far也会得到这遥不可及的爱So I say a little prayer我许下小小心愿And hope my dreams will take me there希望我的梦能带我去到那里Where the skies are blue to see you once again,my love那里天是蓝的 只为再次见你 我的爱Over seas and coast to coast漂洋过海 道阻且长To find a place I love the most找寻我最爱的地方Where the fields are green to see you once again那里麦田是绿色的 只为再次见你My love我的爱I try to read,I go to work,I'm laughing with my friends我试着阅读 上班 和朋友欢笑But I can't stop to keep myself from thinking但却无法停止对你的思念Oh no哦 不I wonder how,I wonder why,I wonder where they are我想不明白它们都去哪了The days we had,the songs we sang together我们一起的日子 一起唱的歌Oh yeah哦 耶And all my love,I'm holding on forever我的爱 我会始终坚持Reaching for a love that seems so far也会得到这遥不可及的爱So I say a little prayer我许下小小心愿And hope my dreams will take me there希望我的梦能带我去到那里Where the skies are blue to see you once again,my love那里天是蓝的 只为再次见你 我的爱Over seas and coast to coast漂洋过海 道阻且长To find a place I love the most找寻我最爱的地方Where the fields are green to see you once again那里麦田是绿色的 只为再次见你To hold you in my arms只为拥你入臂弯To promise you my love只为给你爱的承诺To tell you from the heart只为向你倾诉You're all I'm thinking of你是我唯一的念想I'm reaching for a love that seems so far我会得到这遥不可及的爱So I say a little prayer我许下小小心愿And hope my dreams will take me there希望我的梦能带我去到那里Where the skies are blue to see you once again,my love那里天是蓝的 只为再次见你 我的爱Over seas and coast to coast漂洋过海 道阻且长To find a place I love the most找寻我最爱的地方Where the fields are green to see you once again,my love那里麦田是绿色的 只为再次见你 我的爱Say a little prayer许下小小心愿Dreams will take me there梦能带我去到那里Where the skies are blue to see you once again那里天是蓝的 只为再次见你Over seas and coast to coast漂洋过海 路途遥远To find a place I love the most找寻我最爱的地方Where the fields are green to see you once again那里麦田是绿色的 只为再次见你My love我的爱 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu2023/posts/8c67006b/"},{"title":"荐歌：Sailing（Rod_Stewart）","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。荐歌：Sailing（Rod_Stewart） 最近一直在循环的一首老歌分享给大家。 123456789101112131415161718192021222324252627282930313233343536373839404142434445464748I am sailingI am sailingHome again 'cross the seaI am sailing stormy watersTo be near youTo be freeI am flyingI am flyingLike a bird 'cross the skyI am flying passing high cloudsTo be with youTo be freeCan you hear meCan you hear meThru' the dark night far awayI am dyingForever cryingTo be with youWho can sayCan you hear meCan you hear meThru' the dark night far awayI am dyingForever cryingTo be with youWho can sayWe are sailingWe are sailingHome again 'cross the seaWe are sailing stormy watersTo be near youTo be freeOh LordTo be near youTo be freeOh My LordTo be near youTo be freeOh My LordTo be near youTo be freeOh Lord ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu2023/posts/7a83c3af/"},{"title":"荐歌：Video Killed the Radio Star（The Buggles）","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。荐歌：Video-Killed-the-Radio-Star（The Buggles） 1979 年，影视干掉了电台明星。 这首歌和皇后乐队 Queen 的 《Radio Ga Ga》 遥相呼应。 后者的这首赞叹电台的歌曲，在现在看来是那么的纯粹，因为科技日新月异，已经很少有人能对一项新的技术写一首歌了。也很难想象给 ChatGPT、LK99 写首歌吧。 交相辉映，Video 确确实实基本干掉了电台明星，而且一直到现在，video 也仅仅由大屏幕转向了小屏幕，但依然是主要媒体。 一起听听当时人对 video 的感受吧。 123456789101112131415161718192021222324252627282930313233343536373839404142I heard you on my wireless back in '52Lying awake, intent at tuning in on youIf I was young, it didn't stop you coming throughOh-a, oh-aThey took the credit for your second symphonyRewritten by machine and new technologyAnd now I understand the problems you can seeOh-a oh-aI met your childrenOh-a oh-aWhat did you tell them?Video killed the radio starVideo killed the radio starPictures came and broke your heartOh-a-a-a ohAnd now we meet in an abandoned studioWe hear the playback and it seems so long agoAnd you remember the jingles used to goOh-a oh-aYou were the first oneOh-a oh-aYou are the last oneVideo killed the radio starVideo killed the radio starIn my mind and in my carWe can't rewind, we've gone too farOh-a-aho ohOh-a-aho ohVideo killed the radio starVideo killed the radio starIn my mind and in my carWe can't rewind, we've gone too farPictures came and broke your heartPut the blame on VCRYou are a radio starYou are a radio starVideo killed the radio star ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu2023/posts/44616dfa/"},{"title":"荐歌：Yellow（Coldplay）","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。荐歌：Yellow（Coldplay） 周末愉快！ 最近天气转凉，要预防感冒啊朋友们。 四川九牛最近在中甲联赛取得了冠军的好成绩。熟悉四川足球的朋友们印象中的四川队一定是黄色旋风啊！所以 Yellow 这首歌也几乎成了官方的指定外语歌。（但其实这里的 Yellow 本意是“羞涩”） 外语歌对于我们有个神奇的地方，就是很容易听着就像很新、很时髦的歌。要知道这首 Yellow 可是 2000 年就发布啦，不知不觉这首歌已经被“酷玩乐队”唱了 20 多年。但依然还是那么好听。 123456789101112131415161718192021222324252627282930313233343536373839404142434445464748Look at the starsLook how they shine for youAnd everything you doYeah they were all yellowI came alongI wrote a song for youAnd all the things you doAnd it was called yellowSo then I took my turnOh what a thing to have doneAnd it was all yellowYour skinOh yeah your skin and bonesTurn into something beautifulYou know you know i love you soYou know I love you soI swam acrossI jumped across for youOh what a thing to doCos you were all yellowI drew a lineI drew a line for youOh what a thing to doAnd it was all yellowYour skinOh yeah your skin and bonesTurn into something beautifulAnd you knowFor you I'd bleed myself dryFor you I'd bleed myself dryIt's trueLook how they shine for youLook how they shine for youLook how they shine forLook how they shine for youLook how they shine for youLook how they shineLook at the starsLook how they shine for youAnd all the things that you do ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu2023/posts/9d2cdc43/"},{"title":"荐歌：但愿人长久（邓丽君、王菲）","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。荐歌：但愿人长久（邓丽君、王菲） 朋友们中秋快乐！ 1234567891011121314151617明月几时有 把酒问青天不知天上宫阙 今夕是何年我欲乘风归去 唯恐琼楼玉宇高处不胜寒 起舞弄清影 何似在人间转朱阁 低绮户 照无眠不应有恨 何事长向别时圆人有悲欢离合 月有阴晴圆缺此事古难全但愿人长久 千里共婵娟我欲乘风归去 唯恐琼楼玉宇高处不胜寒 起舞弄清影 何似在人间转朱阁 低绮户 照无眠不应有恨 何事长向别时圆 别时圆人有悲欢离合 月有阴晴圆缺此事古难全但愿人长久 千里共婵娟 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu2023/posts/810a66a4/"},{"title":"荐歌：你不要担心（《请回答1988》主题曲，全仁权）","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。荐歌：你不要担心（《请回答1988》主题曲，全仁权） 周末愉快！ 太困了太困了。阳光温暖的时候就想晒晒太阳睡觉，天气昏暗的时候更想蜷缩在被窝。 今天推荐一个大家刷抖音经常刷到的背景乐，也是著名韩国电视剧《请回答1988》的主题曲之一《你不要担心》。 这里为大家还准备了学唱版歌词😁 可带药阿木高早哈吉麻辣哟~~ 睡了。 123456789101112131415161718192021222324252627282930313233343536373839404142434445464748495051你不要担心그대여 아무 걱정 하지 말아요 你呀 什么都不要担心可带药 啊木 高早 哈吉 吗啦呦우리 함께 노래 합시다 我们一起唱歌吧屋里 哈该 努来 哈洗哒그대 아픈 기억들 모두 그대여 你所有悲伤的记忆 你呀可带 啊喷 gi奥的 某度 可带药그대 가슴에 깊이 묻어 버리고 埋藏在你的内心深处可带 嘎色买 gi皮 木到 泡里够지나간 것은 지나간 대로 过去的事都是过去了级那干 高森 鸡那干 带楼그런 의미가 있죠 这样的意思吧可老 你米嘎 一久떠난 이에게 노래 하세요 给离去的人唱歌吧到男 你爱该 努来哈赛呦후회없이 사랑했노라 말해요 说爱过不曾后悔胡挥奥西 撒狼海耨啦 吗来呦그대는 너무 힘든 일이 많았죠 你辛苦的事情太多了吧可带嫩 闹木 hi扥 一里 慢那就새로움을 잃어 버렸죠 失去了新鲜感吧赛楼无么 里老 包料就그대 슬픈 얘기들 모두 그대여 你所有辛苦的事情 你呀可带 色喷 也gi的 某度 可带药그대 탓으로 훌훌 털어 버리고 视作你的过错全部吐露可带 她色楼 胡胡 套老 包里够지나간 것은 지나간 대로 过去的事都是过去了西那干 高森 鸡那干 带楼그런 의미가 있죠 这样的意思吧可老 你米嘎 一久우리 다 함께 노래 합시다 我们一起唱歌吧无里 哒 哈该 努来 哈洗哒후회없이 꿈을 꾸었다 말해요 说梦过不曾后悔胡挥奥西 古么 古奥哒 吗来呦지나간 것은 지나간 대로 过去的事都是过去了鸡那干 高森 鸡那干 带楼그런 의미가 있죠 这样的意思吧可老 你米嘎 一久우리 다 함께 노래 합시다 我们一起唱歌吧无里 哒 哈该 努来 哈洗哒후회없이 꿈을 꾸었다 말해요 说梦过不曾后悔胡挥奥西 古么 古奥哒 吗来呦지나간 것은 지나간 대로 过去的事都是过去了鸡那干 高森 鸡那干 带楼그런 의미가 있죠 这样的意思吧可老 你米嘎 一久우리 다 함께 노래 합시다 我们一起唱歌吧无里 哒 哈该 努来 哈洗哒후회없이 꿈을 꾸었다 말해요 说梦过不曾后悔胡挥奥西 古么 古奥哒 吗来呦새로운 꿈을 꾸겠다 말해요 说要开始新的梦想了赛楼文 古么 古该哒 吗来呦 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu2023/posts/c427aedc/"},{"title":"荐歌：你要跳舞吗（新裤子乐队）","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。荐歌：你要跳舞吗（新裤子乐队） 周末愉快！ 真的速速降温啦，起床都变得困难了起来。 最近国内的球赛正式进入休赛期了，球迷群里的讨论也慢慢转向杂七杂八的事情，也确实是都寂寞了下来。 不过篮球场那边倒是很热闹，CBA、NBA 都如火如荼的进行着，伪球迷也可以抽时间去现场观察一把。主要还是四川男队的成绩太烂了，九连败后才迎来赛季首胜；女篮那边四川队就是谁也打不过了，开场以来十连胜、轻轻松松。不过女篮的受众太少，我也就看了揭幕战。 今天突然想起新裤子乐队这首《你要跳舞吗》，歌曲很简单、歌词很直接、编曲也很典型的朋克风格。 但就是这样朗朗上口的歌曲最容易引起共鸣。跟着唱、跟着跳就完了，想那么多干嘛？ 12345678910111213141516171819202122232425262728293031323334353637383940每当浪潮来临的时候你会不会也伤心在拥挤孤独的房间里我已经透不过气在这冰冷无情的城市里在摩登颓废的派对里每当吉他噪音又响起电流穿过我和你你你你你要跳舞吗你你你你要跳舞吗你你你你要跳舞吗你你你你要跳舞吗每当浪潮来临的时候我当然也会伤心在拥挤孤独的房间里我已经透不过气在这冰冷无情的城市里在摩登颓废的派对里每当吉他噪音又响起电流穿过我和你你你你你要跳舞吗你你你你要跳舞吗你你你你要跳舞吗你你你你要跳舞吗你你你你要跳舞吗你你你你要跳舞吗你你你你要跳舞吗你你你你要跳舞吗你要跳舞吗你要跳舞吗你要跳舞吗你要跳舞吗你要跳舞吗你要跳舞吗 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu2023/posts/de6b8c93/"},{"title":"荐歌：再见我的爱人（王晰，邓丽君）","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 晚安！ 1234567891011121314151617181920212223242526272829GOODBYE MY LOVE 我的爱人 再见GOODBYE MY LOVE 相见不知那一天我把一切给了你 希望你要珍惜不要辜负我的真情GOODBYE MY LOVE 我的爱人 再见GOODBYE MY LOVE 从此和你分离我会永远永远爱你在心里希望你不要把我忘记我永远怀念你 温柔的情 怀念你热红的心 怀念你 甜蜜的吻 怀念你那醉人的歌声 怎能忘记这段情我的爱再见 不知那日再相见（间奏）（独白）再见了我的爱人 我将永远不会忘记你（独白）也希望你不要把我忘记（独白）也许我们还会有见面的一天 不是吗GOODBYE MY LOVE 我的爱人 再见GOODBYE MY LOVE 从此和你分离我会永远永远爱你在心里希望你不要把我忘记我永远怀念你 温柔的情 怀念你热红的心 怀念你 甜蜜的吻 怀念你那醉人的歌声 怎能忘记这段情我的爱再见不知那日再相见我的爱 我相信总有一天能再见 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~","link":"/kewenlu2023/posts/581c38d3/"},{"title":"荐歌：冬天快乐（李宇春）","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。荐歌：冬天快乐（李宇春） 周末愉快！冬至愉快！ 北方同事早早的下楼去吃饺子了，南方的同事稳稳的在等着晚上吃羊肉。 我，不作选择，中午吃了羊肉馅儿的饺子😊 突然想起了这首歌，大概还是在上大学的时候听到的这首歌，来自现在依然活跃在一线的“超女”李宇春。 这首歌虽然没那么好听，但很应景。更重要的是，它是我回忆里的一个符号。祝大家，冬天快乐！ 晚安！ 12345678910111213141516171819202122232425262728293031323334353637雪让我有点快乐那片白色和伸向远方浅浅的车辙如果这时候飘落钢琴单纯的音色我会对自己说冬天快乐我喜欢没有字的窗透过他天空很晴朗树梢上残留一点月光我喜欢 关灯的球场我独自 听日子回荡黑夜里 凝视一点忧伤习惯你 就把我当作你我们就在一起呼吸 安静而整齐习惯你 就把我当作你所以我唱歌或是沉默都是在对你诉说冬天快乐我喜欢没有字的窗透过他天空很晴朗树梢上残留一点月光我喜欢 关灯的球场我独自 听日子回荡黑夜里 凝视一点忧伤习惯你 就把我当作你我们就在一起呼吸 安静而整齐习惯你 就把我当作你所以我唱歌或是沉默都是在对你诉说冬天快乐冬天快乐冬天快乐冬天快乐 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu2023/posts/1ca9130/"},{"title":"荐歌：千禧新娘（刀郎）","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。荐歌：千禧新娘（刀郎） 最近，沉寂许久的刀郎以一首「罗刹海市」再次引爆江湖。 刀郎，可能年轻的朋友可能已不太熟悉。但他那些年创下的无数歌坛神话不得不让人为之侧目。 这里列一首略微冷门的佳作「千禧新娘」， 1234567891011121314151617181920212223242526272829十八岁的那年姐姐就离开了家 临走的那一天她对我说着 听不懂的话 她说呀 有一天天上的彩虹 如果对你说话 你就去求求它求求它求求它 把你带走吧 在我的家对面的山坡上是牛牛的家 牛牛的家外面开满了 一朵朵红的黄的花 彩虹它绕过来摇动着花叶 染红了我的头发 看着它晃动着我的眼睛 梦想着那个童话 日子它一天天过去我也一年年长大 山坡上花开花落不知又是多少春夏 雨后的彩虹在阳光的照耀下 晃呀晃呀晃呀晃呀晃 牛牛他对我说彩虹它不说话 你就嫁给我吧 姐姐你对我说的话 为何世纪末才给我回答 千禧的新娘是你吗 彩虹我要你做她的婚纱 一朵朵红的花 一朵朵黄的花 一朵朵红黄的花呀 等到了世纪末千禧的新娘 你装点着她的头发 飘飘的云儿 吹吹的风儿 悄悄的祝福她吧 就在这世纪末千禧的新娘 等到了美丽的童话 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu2023/posts/544a3685/"},{"title":"荐歌：又到天黑（告五人）","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 周末愉快！ 告五人发新专辑啦！（就是那个风靡短视频的“宇宙的有趣，我才不在意”的歌曲作者） 第一时间听完了整张专辑，叫《带我飞》，真的是太舒服了。虽然看起来听众褒贬不一，但相比起之前作品的良莠不齐，我觉得这张专辑的一致性得到了明显提升。 今天推荐这首主打歌《又到天黑》。 说来也巧，听这首歌的场景和歌词描述的几近一样——傍晚，稍稍加班，骑车回家。 点睛之笔在“不想要认输就把⾃⼰献给忙碌”。 整个歌词的意境就是打工人的真实心境写照，在奋斗、躺平、无奈里边循环。 最后的 “will be fine” 多次循环，唉，这种对不受掌控的目标的希冀、呼喊，扎心了。 123456789101112131415161718192021222324252627282930313233343536373839404142434445464748作词 : 潘云安作曲 : 潘云安⼜到天⿊出门时路灯都还没醒急着跟黄昏说再见的她朝忙碌里奔去她说晚餐随便吃就好反正到肚⼦里都⼀样⽇复⼀⽇年复⼀年还是没有想法她还是害怕天⿊⼀路上耳机都开到最⼤声她还是拒绝入睡就怕闭着眼⼜想到某个画⾯「She will be fine,Just something changed in the summer time.」她想去解读⼜害怕眼睛变得模糊「She will be fine,Just something changed in the summer time.」不想要认输就把⾃⼰献给忙碌她渐渐不怕天⿊去上班前都会去买宵夜虽然她流下了眼泪但勇气膨胀成⼀个笑脸「She will be fine,Just something changed in the summer time.」她想去解读⼜害怕眼睛变得模糊「She will be fine,Just something changed in the summer time.」不想要认输就把⾃⼰献给忙碌回到住处虽然只是个栖⾝之地但有个⾃⼰布置的⾓落她满是欢喜上完晚班迎来的早晨有的时候会特别孤寂不知是睡意意乱情迷或者⼜想起你She will be… He will be…We will be… We will be fine 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~","link":"/kewenlu2023/posts/e16ed7ab/"},{"title":"荐歌：后会无期（邓紫棋）","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。荐歌：后会无期（邓紫棋） 周末愉快啊！ 这周出差去上海了，但好像没有了刚毕业那会儿的热情，今晚就回四川了。 今天突然脑海里闪过这首邓紫棋的《后会无期》，还有韩寒这部同名的电影。 这首歌是被韩寒填词的，很不错。原歌也很有名，叫《The end of the world》。 123456789101112131415161718当一艘船沉入海底当一个人成了谜你不知道他们为何离去那声再见竟是他最后一句当一辆车消失天际当一个人成了谜你不知道他们为何离去就像你不知道这竟是结局在每个繁星抛弃银河的夜里我会告别告别我自己因为我不知道我也不想知道和相聚之间的距离 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu2023/posts/eb4b457d/"},{"title":"荐歌：在你的身边（盛哲，爱都爱了不怕没来过）","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。荐歌：在你的身边（盛哲，爱都爱了不怕没来过） 周末愉快！ 7 天啊！你知道我这 7 天怎么过的吗？ 这首抖音神曲很好听，但是很多人不知道叫什么名字。因为歌词“爱就爱了不怕没来过”很洗脑，我一度以为这首歌的名字叫《爱都爱了》。 12345678910111213141516171819202122232425262728293031323334353637383940414243444546474849505152535455565758596061安静地又说分开没有依赖却是太多依赖寂寞的广场中央是谁的对白追赶我的空白爱就爱了不怕没来过恨就恨了我从没想过是怕独念一个人太深刻爱就爱了不怕没来过恨就恨了我从没想过到过的地方熟悉曾经的模样我以为忘了想念而面对夕阳希望你回到今天我记得捧你的脸在双手之间安静地看你的眼像秋天落叶温柔整个世界我想在你的身边忘了这路有多长想和你去看季节慢慢变换又来到这座广场听风随落叶已是最后一片爱就爱了不怕没来过恨就恨了我从没想过是怕独念一个人太深刻爱就爱了不怕没来过恨就恨了我从没想过到过的地方熟悉曾经的模样我以为忘了想念而面对夕阳希望你回到今天我记得捧你的脸在双手之间安静地看你的眼像秋天落叶温柔整个世界我想在你的身边我想在你的身边我想在你的身边就让那往事随风让它带走伤带走痛带回那日暮的梦花开落云会走铺满天而你笑着在我的身边我以为忘了想念而面对夕阳希望你回到今天我记得捧你的脸在双手之间安静地看你的眼像秋天落叶温柔整个世界我想在你的身边我想在你的身边我想在你的身边在你的身边 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu2023/posts/da504a45/"},{"title":"荐歌：如果云知道（齐秦）","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 周末愉快！ 成都昨晚下雨了。 晚上下雨总是很舒坦的，只需要静躺在床上听雨声叮铃，不需要因为雨带来的种种烦恼。再在这种惬意中睡去。 今天的荐歌来自齐秦，《如果云知道》。 这首歌虽然是许茹芸的原唱，但不知为何，总是齐秦或某个男声的“如果云知道”在我脑中回响。所以就还是推荐齐秦的翻唱。 印象中这是第一季《歌手》，感慨啊，这都又多少年了。 1234567891011121314151617181920212223242526272829303132333435363738394041424344454647484950爱一旦结冰一切都好平静泪水它一旦流尽只剩决心放逐自己在黑夜的边境任由黎明一步一步向我逼近想你的心 化成灰烬真的有点累了 没什么力气有太多太多回忆哽住呼吸爱你的心我无处投递如果可以飞檐走壁找到你爱的委屈 不必澄清只要你将我抱紧如果云知道想你的夜慢慢熬每个思念过一秒每次呼喊过一秒只觉得生命不停燃烧如果云知道逃不开纠缠的牢每当心痛过一秒每回哭醒过一秒只剩下心在乞讨你不会知道真的有点累了没什么力气有太多太多回忆哽住呼吸爱你的心我无处投递如果可以飞檐走壁找到你爱的委屈 不必澄清只要你将我抱紧如果云知道想你的夜慢慢熬每个思念过一秒每次呼喊过一秒只觉得生命不停燃烧如果云知道逃不开纠缠的牢每当心痛过一秒每回哭醒过一秒只剩下心在乞讨你不会知道每当心痛过一秒每回哭醒过一秒只剩下心在乞讨你不会知道 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~","link":"/kewenlu2023/posts/47291e96/"},{"title":"荐歌：如果可以（韦礼安）","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。荐歌：如果可以（韦礼安） 周末愉快！ 这两天成都突然就降温了，每天温差起起伏伏，衣服也是脱脱穿穿。大家千万要注意防护啊，别在这个时间关头倒下了。好像最近的感冒都会发展的很严重啊！ 记得我周一的时候说过的那事儿吗，上周我姐公司的新入职的小伙儿感冒后，逐渐严重，到刚刚，医生已经在劝家属放弃治疗了😂 今天推荐一首这周不断在脑海循环的歌，韦礼安的《如果可以》。词作者“九把刀”，想起来了吧？那些年我们追过的女孩。 晚安！ 12345678910111213141516171819202122232425262728293031323334353637383940414243444546作词 : 九把刀作曲 : 韦礼安/JerryC你的声音 解开了故事的谜语落下一万年的约定大树下的你 红色围巾 手心里捧的雨哭了笑了 除了你还是你我们 如果又一次错过 不敢牵起你的手我会多么寂寞 等待红线来的时候如果可以 我想和你回到那天相遇让时间停止 那一场雨只想拥抱 你在身边的证据 吻你的呼吸一眨眼 一瞬间 你说好就是永远不会变大树下的你 红色围巾 手心里捧的雨哭了笑了 除了你还是你我们 如果又一次错过 不敢牵起你的手如果没有如果 等到红线来的时候如果可以 我想和你回到那天相遇让时间停止 那一场雨只想拥抱 你在身边的证据 吻你的呼吸一眨眼 一瞬间 你说好就是永远如果可以 茫茫人海千年一眼相遇月光下转身 那就是你红线划过 深藏轮回的秘密 我挥霍运气因为你 才让我 背对命运不害怕靠近了 相信了 到底我们爱得有多狼狈暴雨狂风也不想防备爱了 就爱了 只刻在我们泪光的约定 火开出了花如果可以 我想和你回到那天相遇让时间停止 那一场雨只想拥抱 你在身边的证据 吻你的呼吸一眨眼 一万年 留给我别困住你如果可以 茫茫人海千年一眼相遇月光下转身 那就是你红线划过 深藏轮回的秘密 我花光运气你是我 赌上世界的 决定 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu2023/posts/c8b87dbf/"},{"title":"荐歌：富婆KTV（小何何）","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 周末愉快！ 倒数第二周了，春节越来越近。不过下周要降温，注意保暖啊各位。 最近这一周一直被《富婆KTV》洗脑。 虽然个别方言不太理解，但大体上云贵川渝的朋友在歌词阅读上不会有太大困难。 一首好玩的歌，祝各位周末开心！ 1234567891011121314151617181920212223242526272829303132333435363738394041你说快逮出来喝酒之逮有大趴啦姑娘我胡子没刮像是出克偷狗捉形象有逮夸张我晓得出来玩要穿件西装找了半天不得件称投勒衣裳我吹了个头发昏管哈得件褂褂穿起省到我气宇轩昂我打电话问你在哪个包房给我开门勒是个50多岁勒孃孃我心都好慌和你讲勒不一样你玩我脑筋百十回我竟然哈会上你勒当你和孃孃唱了一首《在水一方》拉夸你体格棒中气足声音昂你讲不想和拉出克喊我帮忙呵呵你选勒了嘛偶像今天你又喊我喝酒唱比昨天还嚣张你捉孤寡还有逮好玩难道腰杆没整劳伤你讲年轻不晓得富婆嘞香错把姑娘当成宝贝心都困是伤你靠在嬢嬢送嘞大奔面前喊我照相我竟然省倒你器宇轩昂我还是跟到你走进了包房给我开门的还是昨天嘞啊个嬢嬢我心都好慌今天心情不一样我大脚趾母抠紧完豆怕之嬢嬢不上我当我喳声卖气嘞唱了一首小芳啦和我喊酒拳猜有无摇骰盅我以为追要走向成功清口水淌哦豁是大梦一场 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~","link":"/kewenlu2023/posts/6f03e642/"},{"title":"荐歌：带你飞（告五人）","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。荐歌：带你飞（告五人） 周末愉快！ 好困啊~我已经睡了一小觉了。 今天推荐告五人的一首《带你飞》。 这首歌其实我也是最近才发现，他歌词所写的内容是一位父亲和他的女儿的故事。 歌词内容非常简单。 再见，我又去睡了。 1234567891011121314我的宝贝 你相信吗相信我是为了你才那么倔强期待有那么⼀天 你能看见我的宝贝 你还在吗隔着电话你⼤概睡着了吧期待有那么⼀天 你能明⽩我要飞 要带你飞你喜欢在⽉亮上⾯吃草莓我是累 是很累草地上⾯蝴蝶花儿追追追带你飞 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu2023/posts/c3d60923/"},{"title":"荐歌：干杯（五月天）","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。荐歌：干杯（五月天） 川足复兴，18年的等待，四川队重回中超！ 干杯！ 1234567891011121314151617181920212223242526272829303132333435363738394041424344454647484950515253545556575859606162636465666768697071727374会不会 有一天 时间真的能倒退退回 你的我的 回不去的 悠悠的岁月也许会 有一天 世界真的有终点也要和你举起回忆酿的甜和你再干一杯如果说 要我选出 代表青春 那个画面浮现了 那滴眼泪 那片蓝天 那年毕业那一张 边哭边笑 还要拥抱 是你的脸想起来 可爱可怜可歌可泣 可是多怀念怀念总是 突然怀念 不谈条件当回忆 冲破考卷 冲出岁月 在我眼前我和你 留着汗水 喝着汽水 在操场边说好了 无论如何一起走到 未来的世界现在就是 那个未来 那个世界为什么 你的身边 我的身边不是同一边友情曾像 诺亚方舟 坚强誓言只是我 望着海面等着永远 模糊了视线会不会 有一天 时间真的能倒退退回 你的我的 回不去的 悠悠的岁月也许会 有一天 世界真的有终点也要和你举起回忆酿的甜和你再干一杯这些年 买了四轮 买了手表 买了单眼却发现 追不到的 停不了的 还是那些人生是 只有认命 只能宿命 只好宿醉只剩下 高的笑点低的哭点 却没成熟点成熟就是 幻想幻灭 一场磨炼为什么 只有梦想 越磨越小 小到不见有时候 好想流泪 好想流泪 却没眼泪期待会 你会不会他会不会 开个同学会他在等你 你在等我 我在等谁又是谁 孩子没睡电话没接 心情没准备天空不断 黑了又亮 亮了又黑那光阴 沧海桑田远走高飞 再没力气追会不会 有一天 时间真的能倒退退回 你的我的 回不去的 悠悠的岁月也许会 有一天 世界真的有终点也要和你举起回忆酿的甜和你再干一杯会不会 有一天 时间真的能倒退退回 你的我的 回不去的 悠悠的岁月也许会 有一天 世界真的有终点也要和你举起回忆酿的甜和你再干一杯终究会 有一天 我们都变成昨天是你 陪我走过 一生一回 匆匆的人间有一天 就是今天 今天就是有一天说出一直没说 对你的感谢和你再干一杯再干一杯永远喝了就能万岁 岁岁和年年时间都停了 他们都回来了怀念的人啊 等你的来到时间都停了 他们都回来了怀念的人啊 等你的来到 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu2023/posts/8006db40/"},{"title":"荐歌：年轮说（杨丞琳）","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 周末愉快！ 最近成都的降温真是让人又悲又喜，难受的是周末出去晒太阳可能都会很冷，开心的是今年的夏天可能不会像两周前的趋势那样热得那么恐怖。 最近，Apple music 上有些关于某个创作者的歌曲合集。其中就有吴青峰作词、郑宇界作曲的这首《年轮说》，由杨丞琳演唱。很好听。不过我觉得，这首歌的编曲有点不那么和谐，而且应该能有人会把这首歌演绎的更好。 12345678910111213141516171819202122232425262728293031323334看 回忆这把刀切开我身体 研究我的风雨这圈是我 那圈是你开过心的开心看 成长的痕迹包裹我生命 篆刻我的章印计算着我 计算着你过不去的过去一是婴儿哭啼 二是学游戏三是青春物语 四是碰巧遇见你了解这个你 沉迷这个你时间暂停 再继续十是寂寞夜里 百是怀了疑千是挣扎梦醒 万是铁心离开你经历这个你活成这个我 细数自己听 远方的信号痛过的美丽 仍将冉冉升起想起的我 想起了你难跨过的难过听 发出的警告余烬的烟蒂 仍将燃烧思念烧毁了我 烧毁了你未到来的未来一是婴儿哭啼 二是学游戏三是青春物语 四是碰巧遇见你了解这个你 沉迷这个你时间暂停 再继续十是寂寞夜里 百是怀了疑千是挣扎梦醒 万是铁心离开你经历这个你活成这个我 细数自己 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~","link":"/kewenlu2023/posts/4526a5e4/"},{"title":"荐歌：情人（李荣浩，Beyond）","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 又到周末了，这周末气温短暂回升，应该是个愉快的周末~ 最近李荣浩的《乌梅子酱》突然火起来了，让我想起来了这张新专辑的另一首歌，重制版的《情人》。 对，就是 Beyond 的那首《情人》的翻唱。编曲几乎原汁原味。 原作其实已经登峰造极了，李荣浩的这首歌憋足的粤语唱出来说实话还是差了一些。 那为什么要推荐呢？是因为最后的那一段吉他 solo 实在增姿增彩了许多。 喜欢吉他的朋友可以听听，有点之前他《爱我还是他》的 solo 的感觉。 12345678910111213141516171819202122232425262728293031323334原唱 : Beyond盼望你没有为我又再度暗中淌泪我不想留低 你的心空虚盼望你别再让我像背负太深的罪我的心如水 你不必痴醉Woo 你可知 谁甘心归去你与我之间有谁是缘是情是童真 还是意外有泪有罪有付出 还有忍耐是人是墙是寒冬 藏在眼内有日有夜有幻想 无法等待盼望我别去后会共你在远方相聚每一天望海 每一天相对盼望你现已没有让我别去的恐惧我即使离开 你的天空里Woo 你可知 谁甘心归去你与我之间有谁是缘是情是童真 还是意外有泪有罪有付出 还有忍耐是人是墙是寒冬 藏在眼内有日有夜有幻想 无法等待多少春秋风雨改多少崎岖不变爱多少唏嘘的你在人海是缘是情是童真 还是意外有泪有罪有付出 还有忍耐是人是墙是寒冬 藏在眼内有日有夜有幻想 无法等待 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~","link":"/kewenlu2023/posts/7a3dec27/"},{"title":"荐歌：想你的365天（李玟）","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。荐歌：想你的365天（李玟） 周末好！ 周三，突发，歌手李玟轻生离世。据传是因为抑郁症。 唉。 李玟老师的《想你的365天》（《宝莲灯》），相信在很多人心中都具有深刻的“启蒙”意义。 另外，这件事也让我觉得有必要更加关心身边人的情绪。这个建议也送给我的读者你。 123456789101112131415161718192021222324252627282930春风 扬起你我的离别夏雨 打湿孤单的屋檐秋夜 飘落思念的红叶冬雪 转眼又是一年在 想你的三百六十五天听 你我最爱的那首歌泪 总是一不小心翻涌 微笑的脸突然我感觉 你没走远怀里 有你紧拥的温度眼里 有你微笑和痛哭心里 有你说过的故事梦里 你在回家的路在 想你的三百六十五天读 你写来的每句安慰爱 圈住你我在同一个圆你的冷热 我能感觉在 想你的三百六十五天海 我多想能看得更远爱 两颗心间不断的长线我的喜悲 都让你包围怀里 有你紧拥的温度眼里 有你微笑和痛苦心里 有你说过的故事梦里 你在回家的路梦里 你在回家的路 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu2023/posts/c1ae8d29/"},{"title":"荐歌：我们俩（郭顶）","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。荐歌：我们俩（郭顶） 周末愉快！ 昨天冲进场内的小伙儿，最终还是被行政拘留了😅终归是给自己的冲动付出了代价。 最近一直在听一首歌，郭顶的《我们俩》，感叹郭顶真是厉害，能把这个风格的歌写的这么脱俗。 爽！ 竟然有点当年方大同的感觉。 123456789101112131415161718192021《我们俩》-郭顶你在左边 我紧靠右 第一张照片不太敢亲密的 属于我们俩的 脸庞太天真了 苹果一样带甜的羞涩太多感触 已不同了 世界变了 还是我改变了 夹在书本这相簿滑落的照片让我变沉默太久 太久 是否过了太久忘了 忘了 开始怎开始的喝醉了小河边唱着歌永远爱你是我说过没有 没有 再没谁能拥有像你 像我 哭和笑都懂得再触摸 我心底藏了好久那最柔软的角落 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu2023/posts/7c2bdf24/"},{"title":"荐歌：日落大道（梁博）","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 晚安！ 雄起成都队！ 1234567891011121314151617181920212223242526272829303132333435363738394041总是梦见云层之上飞过子午线分不清是黑夜还是白天带着装不下的期待匆匆地赶来我再想一遍 想一遍我们寻找着在这条路的中间我们迷失着在这条路的两端每当黄昏阳光把所有都渲染你看那金黄多耀眼我们奔跑着在这条路的中间我们哭泣着在这条路的两端每当黄昏阳光把所有都渲染我看到夜的黑暗晚风吹过金色沙滩海边的晚宴那种味道现在还不习惯拉斯维加斯往返的路上我看见这里无人烟 无人烟我们寻找着在这条路的中间我们迷失着在这条路的两端每当黄昏阳光把所有都渲染你看那金黄多耀眼我们奔跑着在这条路的中间我们哭泣着在这条路的两端每当黄昏阳光把所有都渲染我看到夜的黑暗奔跑着在这条路的中间哭泣着在这条路的两端每当黄昏阳光把所有都渲染我看到夜的黑暗 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~","link":"/kewenlu2023/posts/7b61ceed/"},{"title":"荐歌：明智之举（许嵩）","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 周末愉快！ 成都最近升温，周末也会有冬日暖阳，舒坦~ 跨年晚会上，许嵩又刮起一阵会议旋风。QQ音乐三巨头真名不虚传。 今天推荐一首许嵩的情歌，《明智之举》，来自专辑《寻宝游戏》。 12345678910111213141516171819202122232425262728作词 : 许嵩作曲 : 许嵩你在北方某城 很偶尔下雨我在天南海北 很偶尔想你写不来十八九岁煽情字句孤单喂饱了理性想必你也看过了一些风景才明白什么样的适合自己翻着你朋友圈的幸福合影由衷地为你高兴我曾在意的你想说声对不起年少时的任性有些话伤人不轻也怀疑自己不是理想伴侣你的离开也许是个明智之举我曾在意的你给过太多悲喜承蒙时光洗礼往事已云淡风轻当我们老去品尝丰盛回忆每一道失去都是醇厚的赐予 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~","link":"/kewenlu2023/posts/e2ad2af5/"},{"title":"荐歌：星空（五月天）","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。荐歌：星空（五月天） 周末愉快啊！ 正在看女足的比赛，13：0了，惨案啊！ 最近五月天的这首《星空》总是在我脑海中回荡，给了我很多莫名的力量，分享给各位。 五月天的演唱会票我应该是抢不到了。嘿，省钱。 12345678910111213141516171819202122摸不到的颜色 是否叫彩虹看不到的拥抱 是否叫做微风一个人 想着一个人 是否就叫寂寞命运偷走如果 只留下结果时间偷走初衷 只留下了苦衷你来过 然后你走后 只留下星空那一年我们望着星空有那么多的灿烂的梦以为快乐会永久 像不变星空 陪着我猎户 天狼 织女光年外沉默回忆 青春 梦想何时偷偷陨落我爱过 然后我沉默 人海里漂流那一年我们望着星空从前的从前从没变过寂寞可以是忍受 也可以是享受享受仅有的拥有那一年我们望着星空有那么多的灿烂的梦至少回忆会永久 像不变星空 陪着我最后只剩下星空 像不变回忆 陪着我 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu2023/posts/acfa0de4/"},{"title":"荐歌：晚安（麻园诗人）","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 周五愉快！ 天气逐渐炎热，蚊虫也多了起来。让人又爱又燥的夏天好像真的快来了。 这一周最大的收获，就是认识了“麻园诗人”这支乐队，而他们的《晚安》让我印象深刻。 于是本周的荐歌，就是这首《晚安》。 123456789101112131415161718192021222324252627282930当我遇见你，闪烁的灯光里，舞步飞行，双眼迷离，再次遇见你，你变得很安静，世界安静，是为听清，有时风吹花瓣落成雨，有时想要随便逃往哪里，在海岸，风冰凉，在路上抬头向上望，在天色渐暗，一起说晚安再不安，也不想，就接受命运的暗淡，在星光路旁，再次说晚安；再次遇见你，你变得很安静，世界安静，是为听清，有时风吹花瓣落成雨，有时想要随便逃往哪里，在海岸，风冰凉，在路上抬头向上望，在天色渐暗，一起说晚安再不安，也不想，就接受命运的暗淡，在星光路旁，再次说晚安；晚安，回头向上望，晚安⋯⋯晚安，回头向上望，晚安⋯⋯晚安，回头向上望，晚安⋯⋯晚安，回头向上望，晚安⋯⋯ ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu2023/posts/489d6c64/"},{"title":"荐歌：曾经的你（许巍）","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。荐歌：曾经的你（许巍） 周末好！ 夏天，炎热。 每天在办公室听起这首歌的时候，就会想着远方，想着仗剑走天涯。 许巍的这首《曾经的你》，绝了。 123456789101112131415161718192021222324252627282930313233343536373839404142434445464748495051525354曾梦想仗剑走天涯看一看世界的繁华年少的心总有些轻狂如今你四海为家曾让你心疼的姑娘如今已悄然无踪影爱情总让你渴望又感到烦恼曾让你遍体鳞伤DilililidilililidendaDilililidilililidadaDilililidilililidada走在勇往直前的路上DilililidilililidendaDilililidilililidadaDilililidilililidada有难过也有精彩每一次难过的时候就独自看一看大海总想起身边走在路上的朋友有多少正在疗伤DilililidilililidendaDilililidilililidadaDilililidilililidada不知多少孤独的夜晚DilililidilililidendaDilililidilililidadaDilililidilililidada从昨夜酒醉醒来每一次难过的时候就独自看一看大海总想起身边走在路上的朋友有多少正在醒来让我们干了这杯酒好男儿胸怀像大海经历了人生百态世间的冷暖这笑容温暖纯真每一次难过的时候就独自看一看大海总想起身边走在路上的朋友有多少正在醒来让我们干了这杯酒好男儿胸怀像大海经历了人生百态世间的冷暖这笑容温暖纯真 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu2023/posts/7703d2df/"},{"title":"荐歌：未接来电（杨乃文）","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 5 天小长假，好好放个松吧！ 节前荐歌来自杨乃文，《未接来电》，是我最近一直单曲循环的好歌​。希望也能陪伴你的假期~ 12345678910111213141516171819202122232425262728293031323334353637383940414243作词 : 郑文华作曲 : 张震岳编曲 : 徐千秀想看透 云层的背后是什么走在熟悉的巷子口 你曾陪我风吹信纸的承诺 是一场奢侈的梦别再说 该说的都已经说的太多就算是一句轻轻的 保持联络眼前的天空泛红 像是离别的气候也许你会想我深夜里选择陌生却又眷恋熟悉未接来电或许是你 匿名的提醒在模糊的空气里 深陷过去的记忆也许我会开着收音机听见你最爱的那首歌曲未接来电是你给我 残酷的关心钢琴失去了声音 留下沉默的旋律别再说 想说的都不能再说就算是一句轻轻的 保持联络眼前的天空泛红 像离别的气候也许你会想我深夜里选择陌生却又眷恋熟悉未接来电或许是你 匿名的提醒在模糊的空气里 深陷过去的记忆也许我会开着收音机听见你最爱的那首歌曲未接来电是你给我 残酷的关心钢琴失去了声音 留下沉默的旋律别再说 别再说未接来电或许是你 匿名的提醒在模糊的空气里 深陷过去的记忆别再说 别再说未接来电是你给我 残酷的关心钢琴失去了声音 听着微弱的呼吸 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~","link":"/kewenlu2023/posts/872c97b3/"},{"title":"荐歌：河流（川川）","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。荐歌：河流（川川） 秋风送爽啊~最近这周可真是凉爽，你们那边怎么样呢？ 夏天好像就这么过去了，日历也来到了 9 月，仿佛 5 月才过去不久。珍惜。 今天推荐一首《河流》，来自川川，出自“2023中国好声音”，原唱“厨子和戏子”。 比较炸裂哦，是写给妈妈的。 1234567891011121314151617181920212223242526272829303132333435嘿 你的年纪有多大了却像个孩子一样看着这个陌生的世界嘿 你是否也感到彷徨在这熙熙攘攘的城市里你我都一样每一个苦闷的夜晚我都会在梦中惊醒梦到把我抛离的理想和家乡嘿呀 那儿有筑巢的燕子啊嘿呀 那儿有吵闹的知了啊嘿呀 那儿有金色的庄稼啊嘿呀 那儿有茫茫的白雪啊但是妈妈我弄丢一切吗像你年轻的时候一样丢掉了画画和长发也许所有的日子都会过去但不会被遗忘时光如此清澈像一条流淌的河流嘿呀 那儿有筑巢的燕子啊嘿呀 那儿有吵闹的知了啊嘿呀 那儿有金色的庄稼啊嘿呀 那儿有茫茫的白雪啊但是妈妈我弄丢一切吗像你年轻的时候一样丢掉了画画和长发也许所有的日子都会过去但不会被遗忘时光如此清澈像一条流淌的河流嘿 你的年纪有多大了 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu2023/posts/d7a5b637/"},{"title":"荐歌：波西米亚狂想曲（皇后乐队）","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。荐歌：波西米亚狂想曲（皇后乐队） 元旦快乐！ 视频为皇后乐队在 1985 年拯救生命群星演唱会的现场演唱。 今天刷抖音，刷到了一部经典电影的混剪，同名歌曲，来自皇后乐队的《波西米亚狂想曲》。 这部电影很不错，通过对皇后乐队主唱 Freddie 的一生的演绎介绍了这支伟大的乐队，他们的作品也穿插其间，可以说是很震撼的视听盛宴了。 其中这首《波西米亚狂想曲》最被人议论。初听这歌，是很奇怪的感觉，因为它很乱，仿佛糅杂了很多元素。再了解了 Freddie 的人生经历后，再听此歌，定会有新的感受。相信你也会认为这首歌是皇后乐队的队史最佳。 强烈推荐观看同名电影。 123456789101112131415161718192021222324252627282930313233343536373839404142434445464748495051525354555657585960616263646566676869707172737475767778798081828384858687888990919293949596979899100101102103104105106107108109110111112113114115116117118119120121122123124125126127128129130131132133134135136137138139作词 : Freddie Mercury作曲 : Freddie MercuryIs this the real life这一切是真的吗Is this just fantasy亦或仅仅是幻觉Caught in a landslide被困于山崩地裂No escape from reality无法逃脱现实的牢笼Open your eyes, look up to the skies and see睁开你的双眼 抬头望望天空I'm just a poor boy, (oooh, poor boy)我只是一个可怜的小孩I need no sympathy我不需要同情Because I'm easy come, easy go因为我总是说来就来 说走就走Little high, little low时而高亢 时而低沉Anyway the wind blows, doesn't really matter to me风往何处吹 对我来说已无关紧要To me对我来说已无关紧要Mama, just killed a man妈妈啊 我刚刚杀了个人Put a gun against his head我拿枪指着他的头Pulled my trigger now he's dead扣下扳机 枪响人亡Mama, life had just begun妈妈啊 生活才刚刚开始啊But now I've gone and thrown it all away然而如今我却远走并抛之脑后Mama, oooh妈妈 喔Didn't mean to make you cry我并不想让你流泪If I'm not back again this time tomorrow要是我在明天这个时候未能归来Carry on, carry on, as if nothing really matters让生活继续吧 如同什么都没发生Too late, my time has come太晚了 我的归宿要来了Sends shivers down my spine我的脊梁开始发颤Body's aching all the time浑身上下疼痛难忍Goodbye everybody, I've got to go再见吧 各位 我要离开了Gotta leave you all behind and face the truth我将离你们而去 去接受现实的审判Mama, oooh妈妈 喔(Anyway the wind blows)风往何处吹I don't wanna die我也不想死去I sometimes wish I'd never been born at all甚至有时我希望自己未曾来到这世上I see a little silhouetto of a man我看到一个小小的人影Scaramouche, Scaramouche will you do the fandango?小丑角 胆小鬼 你会跳方丹戈舞吗Thunderbolts and lightning这雷鸣与电闪Very, very frightening me着实惊吓到我了Galileo, galileo伽利略 伽利略Galileo, galileo伽利略 伽利略Galileo, figaro伽利略 费加罗Magnifico-o-o-o-oh贵族大人But I'm just a poor boy, nobody loves me但我只是个穷小孩 没有人爱我He's just a poor boy from a poor family他只是个穷人家里的一个穷小孩Spare him his life from this monstrosity饶了这怪胎一命吧Easy come, easy go, will you let me go我总是被人使唤 你们会放我走吗Bismillah! No, we will not let you go, let him go以神之名 不 我们不会放你走 让他走Bismillah! We will not let you go, let him go以神之名 我们不会放你走 让他走Bismillah! We will not let you go, let me go以神之名 我们不会放你走 让我走Will not let you go, let me go我们不会放你走 让我走Never, never, never, never let me go-o-o-o-oh (Never let you go)不会放我走 (不会放你走)No, no, no, no, no, no, no不 不 不 不 不 不 不Oh, mamma mia, mamma mia哦 妈妈咪呀 妈妈咪呀Mamma mia let me go妈妈咪呀 让我走吧Beelzebub has a devil put aside for me, for me, for me别西卜派了一个魔鬼到我身边So you think you can stone me and spit in my eye?那么你们以为可以拿石头砸死我 唾弃我So you think you can love me and leave me to die?那么你们以为可以爱着我 再让我一个人死去Oh, baby, can't do this to me baby哦 宝贝 不能这样对我 宝贝Just gotta get out, just gotta get right outta here我必须出去 我必须逃离这个地方OooohOooh yeah, oooh yeahNothing really matters什么都没有意义了Anyone can see任何人都看得出来Nothing really matters一切都无关紧要Nothing really matters to me对我来说已无关紧要了Anyway the wind blows无论风往何处吹 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu2023/posts/23784315/"},{"title":"荐歌：泪桥（伍佰）","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 周末愉快！ 开年第一次荐歌，《泪桥》，来自我非常喜欢的伍佰老师。 作为创作者和演唱者，伍佰的情感表达总是那么直接，“一坨爱意直接扔给你”。 歌词简单，唱法直接。但也同他的其他歌一样，久听不厌。适合细细品味。 123456789101112131415161718作词 : 伍佰作曲 : 伍佰无心过问你的心里我的吻厌倦我的亏欠代替你所爱的人这个时候我心落花一样飘落下来顿时我的视线失去了色彩知道你也一样不善于表白想像你的相爱编织的谎言懈怠甜美镜头竟也落花一样飘落下来从此我的生命 变成了尘埃寂寞的人总是习惯寂寞的安稳至少我们直线曾经交叉过就像站在烈日骄阳大桥上眼泪狂奔滴落在我的脸庞 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~","link":"/kewenlu2023/posts/99fdf71c/"},{"title":"荐歌：照花台（郭德纲）","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 终于，一年中最舒适的时节就这么来了啊！！！ 这个周末，高低得找个地方发发呆。 今天推荐的小曲儿来自郭德纲，《照花台》。很多场合都有过演唱，这里放出其中一个。视频后半段还有《点四香》。 很有韵味。经典。 1234567891011121314151617181920212223242526272829303132333435363738一呀嘛更儿里呀月了影儿照花台秋香姐定下了计她说晚傍晌儿来牡丹亭前我们多恩爱但愿得鸾凤早早配和谐左等也不来呀右了等也不来唐解元望苍天是止不住的好伤怀美人呐，秋香哎勾了魂的女裙钗。二呀嘛更儿里呀月了影儿照花前华相府困住了多情的唐解元痴心的才子我风流的汉我在那佛前我求了几千年不见那女天仙呀不见那女婵娟唐伯虎对明月哪顾夜风寒美人呐，秋香哎勾了魂的女婵娟。三呀嘛更儿里明月照当空听谯楼更鼓响檐前铁马声牡丹亭前我空埋怨点点的相思长叹一阵风天边月朦胧亭前恨无穷月下老因何故不来牵红绳美人呐，秋香哎勾了魂的女花容 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~","link":"/kewenlu2023/posts/9dbb2dd7/"},{"title":"荐歌：稻香（周杰伦），缅怀512","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。荐歌：稻香（周杰伦），缅怀512 12345678910111213141516171819202122232425262728293031323334353637383940414243444546474849505152词：周杰伦曲：周杰伦编曲：黄雨勋对这个世界如果你有太多的抱怨跌倒了就不敢继续往前走为什么人要这么的脆弱堕落请你打开电视看看多少人为生命在努力勇敢的走下去我们是不是该知足珍惜一切就算没有拥有还记得你说家是唯一的城堡随着稻香河流继续奔跑微微笑 小时候的梦我知道不要哭让萤火虫带着你逃跑乡间的歌谣永远的依靠回家吧 回到最初的美好不要这么容易就想放弃就像我说的追不到的梦想换个梦不就得了为自己的人生鲜艳上色先把爱涂上喜欢的颜色笑一个吧功成名就不是目的让自己快乐快乐这才叫做意义童年的纸飞机现在终于飞回我手里所谓的那快乐赤脚在田里追蜻蜓追到累了偷摘水果被蜜蜂给叮到怕了谁在偷笑呢我靠着稻草人吹着风 唱着歌 睡着了午后吉他在虫鸣中更清脆阳光洒在路上就不怕心碎珍惜一切 就算没有拥有还记得你说家是唯一的城堡随着稻香河流继续奔跑微微笑 小时候的梦我知道不要哭让萤火虫带着你逃跑乡间的歌谣永远的依靠回家吧 回到最初的美好还记得你说家是唯一的城堡随着稻香河流继续奔跑微微笑 小时候的梦我知道不要哭让萤火虫带着你逃跑乡间的歌谣永远的依靠回家吧 回到最初的美好 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~","link":"/kewenlu2023/posts/d4279062/"},{"title":"荐歌：船长（赵雷）","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 周末愉快！ 不出意外的话，这应该是成都临近夏天前最后一个凉爽的周末了，得抓紧时间出去踏踏青吧！ 清明节、周三这一天假期可以说是非常舒适了，没有调休，纯纯的休息一天。有种上两天班就放假，又上两天班又放假的感觉。再看看五一的假期调休，😂，一言难尽。 所以这一周的节奏就一直围绕着“放松”二字。吃烧烤喝啤酒，骑自行车在公园之间穿梭，舒坦~ 就像赵雷这首《船长》一样，轻松悠闲就应该是生活永恒的追求。 123456789101112131415161718192021222324252627282930313233343536373839404142434445464748请告诉我寂寞的时长那里是否铺满花儿的香在海上漂了很久会觉得岸上很晃雨打湿了衣裳就适应了海水的凉海北的路上没有信号海北的灯光比繁星亮海北的机车妹匆匆忙海北的空调像是冬天一样冷得让我缩成一只小鸟 缩成一只小鸟可是没有人知道我是刚刚经过暴风雨回到岸上的船长会到岸的船长而我却迷失方向像是气球一样四处撞槟榔一定配香烟才够爽海北的男孩讲话有些娘娘腔尽管看上去他们更强壮但是我有胆量去征服海洋上天没有给我华丽的皮囊至今学不会打领结穿西装海北没有适合我的衣裳我喜欢光着膀子露出胸膛吃饱的乌鸦在叫迟到的学生在跑妩媚的夜让我想念我的船和那些被雨淋湿的海鸟哭泣的乌云在飘沉默的大地在摇我开始习惯热流里涌来的爆米花味道我的心总有一些问号我的心总有一些孤傲我的心总有一些潦倒但从来没有任何事能把我困扰我的心总有一些荒谬我的心总有一些寂寥我的心总有一些征兆所以我停靠海北来到海北 在海北这里的人也会因为爱情喝得烂醉一样拥挤的海北璀璨的海北哦 baby我无法入睡 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~","link":"/kewenlu2023/posts/a6d2ea63/"},{"title":"荐歌：蜀道难（张杰）","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 鬼故事啊，周五了，明天还要上一天正班😂 新闻上好像在说哪里连发了几次暴雨之类的气象预警，读者朋友们要多加留意了！至少这会儿成都狂风大作中。 今天的荐歌来自张杰。 这首《蜀道难》歌词基于李白的《蜀道难》，由四川歌手张杰在电视节目《经典咏流传》中演唱。整首歌用的是四川话读音，居然唱出来也很炸裂。 我就出生于蜀道的经典路段——剑门关的所在县，剑阁。五一回家，看到小城毫不意外的被外地游客占满，也是非常的高兴。同样开心的是，在县城，抬头就能看见蜀道的雄伟壮丽，从而心胸开阔。 顺带说一句，很可惜这首歌可能因为某些原因没有完全按照原词来作曲，当然那样的难度很大。毕竟，要是能轻松了唱出来《蜀道难》，不仅高考语文轻松许多，还能免费游剑门关呢！ 1234567891011121314151617181920212223242526272829303132333435363738394041424344454647484950515253545556575859606162636465666768697071727374757677787980818283848586878889909192939495作词：（唐）李白、张杰作曲：刘洲川剧帮腔：李秋华、杨茜、王耀超、宋辛海念白：周礼兵张杰：蜀道难 难于上青天呐川剧帮腔：难于上青天呐张杰：管你天上的神仙兵也难入得我蜀道行念白：尔来四万八千岁张杰：爷爷说过他嗓如峨眉山生在新繁授我鸡的冠独占了鳌头我绕了十几年川剧帮腔：蚕丛及鱼凫哎开国何茫然张杰：西当太白有鸟道哎可以横绝峨眉巅哎问君西游何时还哎畏途巉岩不可攀哎管你天上的神仙兵也难入得我蜀道行念白：连峰去天不盈尺枯松倒挂倚绝壁张杰：管你天上的神仙兵也难入得我蜀道行念白：飞湍瀑流争喧豗砯崖转石万壑雷张杰：蜀道难 难于上青天呐挡住太阳神的山巅排空曲折迂回的川念白：尔来四万八千岁张杰：爷爷升仙都还没出过繁梦回蜀道绕过川的难轮到了下辈讲他们的撼川剧帮腔：蚕丛及鱼凫哎开国何茫然张杰：西当太白有鸟道哎可以横绝峨眉巅哎问君西游何时还哎畏途巉岩不可攀哎管你天上的神仙兵也难入得我蜀道行念白：连峰去天不盈尺枯松倒挂倚绝壁张杰：管你天上的神仙兵也难入得我蜀道行念白：飞湍瀑流争喧豗砯崖转石万壑雷张杰 + 帮腔：难也走诶累也走诶张杰：管你天上的神仙兵也难入得我蜀道行这样的川一样的繁一样的青天别忘了青山留给你的蓝管你天上的神仙兵也难入得我蜀道行 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~","link":"/kewenlu2023/posts/55b71ee6/"},{"title":"荐歌：邻家的龙猫（久石让，《龙猫》）","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 周五愉快！ 昨天是六一儿童节，办公室的同事在商议晚上带小孩去看什么电影，其中就提到了《天空之城》。 回想起宫崎骏的动画，其实我最喜欢的还是《千与千寻》和《龙猫》。 不如今天回味一下龙猫吧！ ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu2023/posts/95f8032a/"},{"title":"贝叶斯：起步（1）","text":"概率论（英语：Probability theory）是研究概率、随机性及不确定性等现象的数学分支，而贝叶斯学派(Bayesians)又是其中有代表性的流派。本文为贝叶斯系列文章第 1 期，回顾一下贝叶斯定理。贝叶斯：起步（1） 文章来自微信公众号“科文路”，欢迎关注、互动。转载须注明出处。 差点忘了我还是个科学类文章作者了，今天开始，启动新项目——贝叶斯。来体会这个流派在当今各类技术中的独到应用。 从这篇文章开始，我将系统性的介绍跟贝叶斯沾边的理论以及应用，发布在每周四的文章中，敬请追更。 要 24：00 了，我先把这个最核心的公式扔给各位，回味一下先~ 贝叶斯定理$$P(A\\mid B)={\\frac {P(A)P(B\\mid A)}{P(B)}}$$ 还记得它吗？ 下一期我们再正式开始，来细品这个神奇的公式。 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~","link":"/kewenlu2023/posts/5ddfdbc9/"},{"title":"贝叶斯：起步（2）","text":"概率论（英语：Probability theory）是研究概率、随机性及不确定性等现象的数学分支，而贝叶斯学派(Bayesians)又是其中有代表性的流派。每周四更新，本文为贝叶斯系列文章第 2 期，回顾一下贝叶斯定理以及相关的术语。贝叶斯：起步（2） 文章来自微信公众号“科文路”，欢迎关注、互动。转载须注明出处。 上周四来了一波儿回忆杀，让各位再次看到了这个贝叶斯定理的公式， $$P(A\\mid B)={\\frac {P(A)P(B\\mid A)}{P(B)}}$$ 为什么说这个公式神奇呢？用流行语讲就是，它支撑起了整个贝叶斯宇宙。什么朴素贝叶斯、贝叶斯优化、最大后验估计等等，这些在统计、机器学习领域司空见惯的术语，都和贝叶斯定理有着千丝万缕的联系。 今天，先回顾一下一些术语，再来看贝叶斯定理是什么意思。 术语（通俗版） 事件，即我们要研究的具备单一发生概率的、可多次发生但之间没有关联的对象，也就是所谓的独立同分布 i.i.d. 先验概率，事先就知道的事情，例如事件 A 发生的概率记作 $P(A)$ 条件概率，事先就知道的事情，例如固定条件 B 下事件 A 发生的概率记作 $P(A\\mid B)$ 联合概率，两个事件同时发生的概率，例如事件 A 和事件 B 同时发生的概率记作 $P(A\\bigcap B)$ 后验概率，一般事先不知道的事情，例如固定条件 A 下事件 B 发生的概率记作 $P(B\\mid A)$ 贝叶斯定理$$P(A\\mid B)={\\frac {P(A)P(B\\mid A)}{P(B)}}$$ 就是说 B 条件下事件 A 发生的后验概率等于 A 情况下事件 B 发生的条件概率乘以 A 条件发生的先验概率除以 B 条件发生的先验概率。 通常，右边这一坨是已知的。 好了，那么这个公式用大白话讲怎么说呢？ B 条件下发生 A 事件的概率乘以 B 条件发生的概率与 A 条件下发生 B 事件的概率乘以 A 条件发生的概率相等。 表面上看，这仿佛非常直观，但这确实是表面上。关键的困难在于，如何理解 A、B 反过来这件事。 下期细说~ ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~","link":"/kewenlu2023/posts/4f6a7427/"},{"title":"贝叶斯：起步（3）","text":"概率论（英语：Probability theory）是研究概率、随机性及不确定性等现象的数学分支，而贝叶斯学派(Bayesians)又是其中有代表性的流派。每周四更新，本文为贝叶斯系列文章第 3 期，用一个完整的例子感受下贝叶斯公式的力量。贝叶斯：起步（3） 文章来自微信公众号“科文路”，欢迎关注、互动。转载须注明出处。 上周四，我们一起品味了这个贝叶斯公式，并且给出了一些术语的解释。 $$P(A\\mid B)={\\frac {P(A)P(B\\mid A)}{P(B)}}$$ 有细心的读者也指出了其中一些问题。这让我感觉有些读者还是不太清晰这些概念，那还是停一停。这里我画个表格，明确一下。 术语再理解假设有两个外边看不见内部的盒子（不多说了，你应该知道啥意思），盒 1 有 5 个球，3 黄 2 红；盒 2 有 7 个球，4 黄 3 红。 下面再看这些概念， 概念 符号 通俗理解 事件 A 某种特定的情况，比如“从盒 1 拿出一个球（这里是确定的），这个球是黄色的”(A) 先验概率 $P(A)$ 当下就知道的某个事件的发生概率，上面说的拿出黄球的概率 $P(A)=3/5$ 联合概率 $P(A\\bigcap B)$ A事件和B事件同时发生的概率；A和B之间是没有关联的；比如“同时从盒1、2中拿出黄球”的联合概率$P(A\\bigcap B)=P(A)\\times P(B)=12/35$ 重要理论 统计独立性 当且仅当两个随机事件A与B统计独立的，这样联合概率可以表示为各自概率的简单乘积 简单讲，就是 A 和 B 的发生没有关联 比如上面，分别从盒1、2中取球，两次取球就是独立的 好了，接下面是重头戏，一般是问题中比较烧脑的部分。 条件概率（后验概率）$P(A\\mid C_\\text{box1})$，$C_\\text{box1}$ 事件发生的情况下，A 事件发生的概率。 条件概率等价于后验概率，这个说的比较笼统，但我不觉得有什么不妥。条件概率是从形式上说的，后验概率是从陈述性表达上理解的。 先来个简单的，“随机（相当于蒙住了盒子号码）选择盒子，选择了盒子1，并从中拿出一个球，这个球是黄色”，可以表述为符号 $P(A\\mid C_\\text{box1})$， $A$ 事件，取出一个球（不管哪个盒子），这个球是黄色 $C_\\text{box1}$ 事件，随机选到盒子1 所以 $P(A\\mid C_\\text{box1})$ 就是说，我随机选择了盒子1（$C_\\text{box1}$），拿出的球是黄色($A$)的概率。因为两个事件独立，所以算这个概率很简单， $P(A\\mid C_\\text{box1})=P(A)\\times P(C_\\text{box1})=3/5\\times 1/2=3/10$ 就是说，随便选一个盒子，这个盒子是盒 1 且拿出来的球是黄球概率是 0.3。 贝叶斯的力量上面那种情况好算吧，但往往我们需要求解另一种更烧脑的情况——反过来。 比如，$P(C_\\text{box1}\\mid A)$，“取出了一个黄球（$A$），这个黄球来自盒1（$C_\\text{box1}$）”的概率。 这种需求很常见，但是怎么算呢？这就要利用贝叶斯公式。 代入贝叶斯公式， $$P(C_\\text{box1}\\mid A) = \\frac{P(A\\mid C_\\text{box1})\\times P(C_\\text{box1})}{P(A)}$$ 右边， $P(A\\mid C_\\text{box1})$ 上面算过了，$3/10$ $P(C_\\text{box1})$，$1/2$ $P(A)=P(A\\mid C_\\text{box1}) + P(A\\mid C_\\text{box2})$ $=3/5\\times 1/2 + 4/7\\times 1/2=41/70$ 体会到神奇之处了吗，对于这个烧脑的问题，居然可以通过贝叶斯“逆向”计算出来，结果是 $21/82$，就是说拿出黄球，黄球来自盒1 的概率是 $25.6%$ 左右！ 时间仓促，不知道写对没有，欢迎斧正！ 下期我们再列几个现实生活中的例子~ ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~","link":"/kewenlu2023/posts/f7d61342/"},{"title":"贝叶斯：起步（4&#x2F;4），三人成虎吗？（附代码）","text":"概率论（英语：Probability theory）是研究概率、随机性及不确定性等现象的数学分支，而贝叶斯学派(Bayesians)又是其中有代表性的流派。每周四更新，本文为贝叶斯系列文章第 4 期，再用一个生活中的例子感受下贝叶斯公式的力量。贝叶斯：起步（4/4），三人成虎，很有意思的例子（附代码） 文章来自微信公众号“科文路”，欢迎关注、互动。转载须注明出处。 上周四，我们通过一个例子认识了贝叶斯公式的力量， $$P(A\\mid B)={\\frac {P(A)P(B\\mid A)}{P(B)}}$$ 这个公式还有一个略显复杂的版本，长这样， $$P(A_i\\mid B)={\\frac {P(A_i)P(B\\mid A_i)}{\\sum_{j=1}^{\\infty}P(A_j)P(B\\mid A_j)}}$$ 这个公式可以这么理解：$A_j$ 是一系列事件，所有这些事件构成了完整的 $A$ 事件，$A_i$ 是其中一个我们想研究的特定事件。比如， 勘误上一篇文章中的 $P(A)=P(A\\mid C_\\text{box1}) + P(A\\mid C_\\text{box2})$ 虽然算的是对的，但实际上应该如上面的分母那样表示为 $P(A)=P(C_\\text{box1})P(A\\mid C_\\text{box1}) + P(C_\\text{box2})P(A\\mid C_\\text{box2})$ 实例一：三人成虎问题：你问三个人一件事的真实性，每个人给你的答复都有说谎的可能性。请问，如果三人都说某个事是真的，这个答案的实际真实性如何？ 列出贝叶斯公式， $$P(A_1\\mid B)={\\frac {P(A_1)P(B\\mid A_1)}{\\sum_{j=1}^{2}P(A_j)P(B\\mid A_j)}}$$ 关注贝叶斯公式右边， 某事件为真（$A_1$）的概率为 $P(A_1)=x$，这将会是一个先验概率； 某事件为假（$A_2$）的概率为 $P(A_2)=1-x$； 考虑三人成虎，三人都说一件事为真 $P(B)$ 的概率，只有两种情况， $P(A_1)P(B\\mid A_1)$，事件为真（$A_1$）时，三个朋友都说该事件为真（$B$）的概率为 $y^3x$; $P(A_2)P(B\\mid A_2)$，也就是说谎话，事件为假（$A_2$）时，三个朋友还说该事件为真（$B$）的概率为 $(1-y)^3(1-x)$ 代入公式， $$P(A_1\\mid B)=\\frac{y^3x}{y^3x+(1-y)^3(1-x)}$$ 实例例如，老家下雨的概率为 0.5，我问了 3 个人，他们都说现在老家确实正在下雨，而这 3 个人说谎的可能性是 0.3，请问确实在下雨的概率是多少？ 代入 $x=0.5, y=0.7$， $$P(确实下雨\\mid 三人说下雨)= \\frac{0.1715}{0.1715+0.0135}=0.927$$ 显然，这比我们事先得到的 0.5 的先验概率要高的多，所以这种情况下三人并不成虎！ 另一个角度：问的人越多，答案越真实吗进一步看上面这个公式，我们思考，如果生活中都是这样的人，我们求证一件事情的时候，是问的人越多越好吗？ 很简单，我们看这贝叶斯公式： $$P(A_1\\mid B)=\\frac{y^3x}{y^3x+(1-y)^3(1-x)}$$ 再抽象一下， 认为每个人的诚实度都一样，为$y$ 认为事情发生的先验概率，也就是历史总结出来的概率，为 $x$ 再确定“三人成虎”画出 x 和 y 的关系 f(x,y) = (x*y**3)/(x*y**3+(1-x)*(1-y)**3)-x，也就是看着两个因素对于事情可信度提升的影响， 可以从图中观察到一些重要的信息， 当 y&gt;0.5 时，即人们比较诚实时 x越小，z越大 也就是说，先验概率发生概率越小，通过问人得到肯定答复，可以得到更高的可信度 当 y&lt;0.5 时，即人们不诚实时 x越大，|z| 越大 也就是说，如果这些人平时就喜欢撒谎，那一件事发生的可能性越大，你从这些人口中得到肯定答复后，这件事的可信度反而更低 总的来说，选择诚实的人去问问题，得到正面答复后，这事的可信度会更高。 代码1234567891011121314151617181920212223242526272829303132333435363738# Import the necessary modulesimport numpy as npimport matplotlib.pyplot as pltfrom mpl_toolkits.mplot3d import Axes3D# Define the function to plotdef f(x, y): return (x*y**3)/(x*y**3+(1-x)*(1-y)**3)-x# Create a grid of x and y valuesx = np.linspace(0, 1, 50)y = np.linspace(0, 1, 50)x, y = np.meshgrid(x, y)# Compute the z valuesz = f(x, y)# Create a figure and an axes objectfig = plt.figure()ax = fig.add_subplot(111, projection='3d')# Plot the surfaceax.plot_surface(x, y, z, cmap='viridis')# Add labels and titleax.set_xlabel('x')ax.set_ylabel('y')ax.set_zlabel('z')ax.set_title('Surface plot of f(x,y) = (x*y**3)/(x*y**3+(1-x)*(1-y)**3)-x')# Add a plate as x=zx2 = x # Use z as the x values for the platey2 = y # Use y as the y values for the platez2 = np.zeros_like(x2) # Use zeros as the z values for the plateax.plot_surface(x2, y2, z2, color='red', alpha=0.5) # Plot the plate with red color and transparency# Show the plotplt.show() ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~","link":"/kewenlu2023/posts/44a806d8/"},{"title":"趣闻：小国寡民，列支敦士登","text":"原答案：有哪些最令人震惊的事实？ 文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 这是列支敦士登（Liechtenstein）。 它是世界上最小的国家之一，面积约 160 平方公里（注：比杭州小100倍）。 它是瑞士和奥地利之间的双重内陆国家（注：指的是本国是内陆国而其周围所有的邻国也是内陆国的国家，世界上的双重内陆国有乌兹别克斯坦和列支敦士登）。 1868 年，该国解散了由 80 名士兵组成的军队，并宣布永久中立，这一立场在两次世界大战中都得到了认同。 2007 年，当 170 名瑞士士兵行进时，意外入侵了列支敦士登。 据列支敦士登政府称，他们甚至不知道，直到瑞士政府告诉他们这件事。 等等。但这些事实如果还不够震惊，请看下面： 列支敦士登最后一次参与军事行动是在 1866 年奥普战争期间。他们派出 80 名士兵守卫意大利山口，没有人受伤。事实上，他们与一名奥地利士兵成为了朋友，后者在回到瓦杜兹的家乡后加入了他们。 80 名士兵离开，81 名士兵返回，抵达列支敦士登时，他们的部队比离开时更强大。 😂 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu2023/posts/cde2684b/"},{"title":"通报：确实不是“鸭脖”","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 江西工职院“6·1”食品安全事件调查处理情况通报针对江西工业职业技术学院“6·1”食品安全事件，省教育厅、省公安厅、省国资委、省市场监督管理局组成的联合调查组，本着实事求是原则开展调查，现将有关情况通报如下。红。 联合调查组经勘察现场，调取监控视频发现，6月1日，学生在食堂吃出疑似为“鼠头”的异物，被涉事食堂工作人员事发当日丢弃。通过查看食堂后厨视频，查阅采购清单，询问涉事食堂负责人、后厨相关当事人、当事学生和现场围观学生等，判定异物不是鸭脖。根据国内权威动物专家对提取的当事学生所拍现场照片和视频进行专业辨识，判定异物为老鼠类啮齿动物的头部。南昌高新区市场监督管理局昌东分局、江西工业职业技术学院未认真调查取证，发布“异物为鸭脖”结论是错误的。 经认定，江西工业职业技术学院对此次事件负主体责任，涉事企业负直接责任，市场监督管理部门负监管责任。 目前，依据《中华人民共和国食品安全法》及其实施条例，南昌市市场监督管理局已吊销涉事食堂食品经营许可证，对涉事企业和法定代表人顶格处罚。下一步，将依法依规严肃处理江西工业职业技术学院、南昌高新区市场监督管理局昌东分局等相关责任单位、涉事企业和责任人，并在全省开展食品安全专项整治，抓好源头治理，切实保障人民群众食品安全。 来源：新华社微博 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu2023/posts/c652f36f/"},{"title":"逛Quora：不可思议的李小龙","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 原答案：@Chukwuebuka Sunday 历史上最奇特的人是谁？ 李小龙，Bruce lee，中国武术家和演员。 他曾进行过一些不可思议的演示。 虽然他的体重只有130磅，但他： 有 350 磅的出拳能力 可以用双手连续做 1500 个俯卧撑 单手连续做 400 个俯卧撑，单手两个手指做 200 个俯卧撑，单手大拇指 100 个。这个纪录至今无人能破 每天练习 5000 次出拳，一秒钟可以出九拳 踢腿动作对摄影机来说太快了，乃至只能放慢动作拍摄 垂直弹跳 2 米 5 另外，他完美、健壮的身体让世人印象深刻。不是这样的大块头， 而是， 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~","link":"/kewenlu2023/posts/b7378fd6/"},{"title":"逛Quora：为什么埃隆·马斯克对中国如此友好？","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 原答案：Shannon Fu，为什么埃隆·马斯克对中国如此友好？ 我想给你讲个故事，这个故事的名字叫《天哪，在德国建特斯拉工厂太难了》。 产能！产能！2017 年，特斯拉 Model 3 量产，结束了特斯拉疯狂烧钱、不盈利的时代。 此后两年，巨大的生产压力一直困扰着特斯拉。如果产能不增加，利润就不会增加。 因为过去做研发时烧钱太多，特斯拉每天的债务利息都是天文数字。如果利润无法覆盖利息，那么特斯拉将处于持续亏损的状态。 一方面是产品供不应求，另一方面是特斯拉资金链濒临崩溃，随时可能陷入债务危机。只要能提高产能，一切问题都解决了，但不能就是提不起来。 于是人类历史上的一大奇迹开始初露端倪。 来到中国2018 年，马斯克来到中国，试图用中国速度打造超级工厂，为特斯拉扩大产能。 仅仅用了不到三个月的时间，马斯克就与上海达成了协议：上海以一折的价格为特斯拉提供了一大块土地用于建厂，同时为供不应求的特斯拉提供了 185 亿元的贷款，年化利率低至 3.9%。 这两个条件相当于给特斯拉送钱，但上海其实也并不亏。因为马斯克在协议中承诺，从 2023 年开始，特斯拉的上海工厂 Gigafactory 每年将向中国缴纳不低于 22.3 亿元人民币的税款，否则特斯拉将归还土地。 中国速度签署协议后，马斯克了解到了什么是中国速度。 2018 年 10 月，协议正式签署 2018 年 12 月，土地整平，施工单位全部进场 2019 年 1 月，特斯拉上海工厂正式开工建设 2019 年 11 月，特斯拉上海工厂竣工，所有设备安装到位 调试一个月后，流水线正式上线，整个工厂开始疯狂运转。 从签订协议到工厂建成仅用了一年时间，其中建设周期仅为 10 个月，远远低于马斯克计划的 2 年建设周期。 Amazing！ 从特斯拉上海工厂销售第一辆车开始，特斯拉的利润就已经超过了利息支出，特斯拉不再有资金链断裂的压力。 中国工厂是特斯拉在海外设立的第一家超级工厂，它帮助马斯克解决了一个巨大的问题。为了庆祝这一历史性时刻，马斯克甚至在公共场合开心地跳起了舞。 德国速度一个人尝到甜头后，第一反应当然是复制自己过去的成功。因此，马斯克决定在海外建设第二座超级工厂。这一次，他选择了欧洲汽车制造中心德国。 然后，他被狠狠的扇了一巴掌。 2019 年 11 月，也就是特斯拉上海工厂全面完工的当月，马斯克宣布将在德国建设超级工厂。该网站位于德国东部勃兰登堡州的 Grunheide，距离柏林仅 24 英里。 勃兰登堡州政府官员非常欢迎特斯拉，因为它将为当地带来巨额税收和数万个就业机会。还能通过产业链带来数十万个相关就业岗位。好处太多了。 于是，他们将一块 300 公顷的土地卖给了特斯拉。 中国仅用 10 个月就建成特斯拉超级工厂？勃兰登堡州经济事务部长 Jörg Steinbach 表示：“德国的特斯拉团队决心在几周时间内击败中国团队。” 看起来似乎一切都在朝着更好的方向发展。然而，马斯克没想到，这是一场噩梦的开始。 森林首先，特斯拉拿的土地很普通，但并没有荒废，上面还种了一些人工经济林。 拿到土地后，需要先平整土地，也就是把这些经济林砍掉，但这又造成了新的问题。环保人士立即出来抗议，并将特斯拉告上法庭，称这些树不能砍伐。 人工经济林也是森林。特斯拉怎么可能随便砍？ 这是对当地生态环境的严重破坏。 经过反复交涉，特斯拉承诺在其他地方补种 3 倍以上的经济林，最终将此事摆平。 这就能开工了？ 当然不会！ 饮水环保人士还发现，特斯拉超级工厂每年消耗约 360 万立方米的水，占当地供水量的 30%。因此，环保人士表示，特斯拉工厂的建立将严重消耗当地的水资源储备。并于 1 月 18 日举行抗议示威。 看起来特斯拉用水量很大，但实际上该地区只有 8,700 名居民，仅特斯拉工厂就有 12,000 名员工在生产。使用 30% 的水似乎并不过分。更何况这是生产用水，不是生活用水。 相反，那 8,700 名居民要 70% 的水，我个人觉得有点过分。 但这说不通，因为水资源话题被一些地方政党视为博取关注和选票的绝佳机会，他们根本不在乎特斯拉死不死。 德国生态民主党主席 Christian Rechholz 在多家媒体发表讲话，声称对德国联邦经济和技术部非常失望： “这证实了我们最大的担忧。现在甚至有更多的土地将在没有提交申请的情况下就被浇筑混凝土。特斯拉试图以牺牲欧洲纳税人的利益来实现自己的利益。 对水、人、自然的保护，正像法治一样慢慢消失！” “彼得·阿尔特迈尔（现任德国经济部长）怎么能无视勃兰登堡市民对饮用水和自然保护区的担忧，让这家美国公司再次自担风险“临时开工”？ 我们不应该忘记，他们的电动车工厂还没有获得最终的建设许可证。” “随着世界上最大的电池工厂的加入，布兰登堡和柏林最终将成为旱地。你不能为了利益而牺牲我们宝贵的饮用水。 这种巨大的狂热正在威胁着人类和自然。” 总之，一些连高中都没毕业的普通德国公民认为，德国生态民主党主席是个好人，真心实意地为德国的未来考虑，下次一定要把他投给他。 于是，反特斯拉的声音变得更大。 怎么办？ 经过反复谈判，特斯拉承诺将减少用水量。 这下能开始工作了吗？ 当然还是不行。 安置蚁群环保人士还声称，特斯拉砍伐的树林是蝙蝠的栖息地。2020 年 1 月是它们的冬眠季节。他们不应该被打扰，否则他们会大量死亡。冬眠结束后，蝙蝠将进入交配季节，然后繁殖婴儿，因此不能被打扰。你需要等蝙蝠宝宝长大后再砍伐树林，给予它们时间移动。 这是没有办法谈判的，特斯拉说什么都会被指责为冷血屠夫。 因此，特斯拉紧急聘请德国环保机构对整个林区进行物种调查。 调查报告显示，整个林区只有2只蝙蝠。 因此，特斯拉声称，该工厂的建设不会造成任何特别严重的影响。 2020 年 2 月 13 日，特斯拉觉得自己已经做好了一切，开始伐木，准备建工厂。 接着，环保人士在物种调查清单中发现，这一地区有狼、蜥蜴，甚至蚂蚁，都必须加以保护。是的，特斯拉必须按照要求在这片树林里妥善安置蚁群。 总之，环保人士绝不会允许特斯拉彻底清理这片森林，而是经过反复谈判和努力，先平整一小部分土地，剩下的留待以后谈判。 2020 年 4 月，终于整理出来第一小块土地。 号称要超越中国团队的特斯拉德国团队，用了整整 5 个月的时间才完成土地平整步骤，而且只平整了部分土地。 拿不到的《施工许可证》哈哈，我们可以开工建设了吗？ 当然，这仍然是不可能的，因为特斯拉必须等《施工许可证》。 特斯拉德国团队预计在 7 个月内获得施工许可证，他们将尽最大努力实现这一目标。之所以要等这么久，是因为特斯拉工厂的建立对一些政府官员来说是政绩，但对一些政府官员来说却是麻烦之源。没有人想因为特斯拉而惹上麻烦。 例如，勃兰登堡州农业部要求特斯拉在施工过程中使用一种特殊材料，以保护地下水源。关于这个地下水保护的问题，特斯拉花了一个半月的时间才获得施工许可。 例如，德国环保部门认为，在特斯拉工厂建设过程中，打桩机的震动可能会对周边铁路造成影响。因此，特斯拉必须提供安全的施工方案，并提交审查。这个项目又花了一个月。 还有各种施工许可审批，特斯拉需要满足各个政府部门的要求。总之，到了 2020 年 11 月，耗时 7 个月办理手续的特斯拉仍未拿到全部施工许可，被迫推迟开工日期。 2020 年 12 月 7 日，剩余的施工许可证都还没有拿到，环保人士就又在特斯拉的林地地下发现了一条冬眠的蛇…… 哈哈，棒极了！怎么能因为建造一个破工厂就干扰蛇老师的休眠呢？你必须等到蛇老师的冬眠结束才能开始工作。 于是，2020 年 12 月 8 日，环保组织收到法院的紧急施工禁止令……特斯拉的开工梦想再次破灭，截至年底，这块地还是一片空白。 直到 2021 年 2 月 21 日，蛇王终于苏醒了。特斯拉德国团队的负责人激动得几乎要哭了，于是下令尽快进行伐木。 但是…… 2021 年 4 月，水务局发现特斯拉部分自来水管道存在未经许可安装的情况，责令特斯拉停工整改 2021 年 5 月，德国监管机构发现特斯拉工厂 4680 电池生产线的建设许可证缺少可用作动力电池的所谓许可证，责令特斯拉申请特别许可证 2021 年 6 月，环保组织提出抗议，怀疑特斯拉无法控制施工过程中产生的有毒气体，环保部门要求特斯拉对此作出解释并停工整改 2021 年 7 月，有人在特斯拉工地发现了一些被曝光的所谓化学罐，但它们并没有在申请文件上，也没有得到政府的批准。因此，工作被暂停、罚款，并责令整改 之所以这么容易叫停特斯拉的工作，是因为特斯拉直到今天都没有拿到完整的施工许可证，各种审批都没有完成。特斯拉德国队在许多活动中只获得了临时施工许可。 因此，任何政府部门都可以阻止特斯拉超级工厂的建设进度。 最后2022 年 7 月，马斯克已经确定了工厂的最新完工日期。 (光是申请环保许可证，资料就厚达一万一千页。） 因此，特斯拉的德国工厂仍然严重延迟。 从 2019 年 11 月开始拿地，到 2021 年 7 月，一共过去了 20 个月。别说竣工了，特斯拉甚至都还没有拿到德国政府的正式施工许可！ 特斯拉偷偷摸摸地搞了一个小项目，几乎没有盖上建筑外壳，但里面完全是空的。 在德国建特斯拉工厂实在太难了。 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~","link":"/kewenlu2023/posts/78ef1508/"},{"title":"逛Quora：传奇毒枭刘招华","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 原答案：@Forrest-Harris-11 历史上最聪明的罪犯是谁？ “我从不卖毒品给中国人，只卖给国外人。外国人用鸦片打开了中国的门，我就用毒品去打开他们的门。”——刘招华 警方：“还得表扬你呗？” 他叫刘招华，上学时曾获化学竞赛二等奖，自学自制 31 吨毒品（甲基苯丙胺），纯度高达99%，成为中国最大的毒枭（他只有9年的学历）！ 直到现在很多毒贩都在暗中打探，刘招华用什么方法制造冰毒，用的是什么结晶方法。 用各种常用化学试剂合成，不以麻黄素为原料生产。 他在 1999 年改变了反应的底物和催化剂，采用了连续生成+连续结晶的方法。从日产量来说，他一天可以轻而易举地结晶出 1 吨甲基苯丙胺，如果能卖出去，一天五吨也不成问题。 在转化率方面，他声称自己的转化率达到了90%。 这么高的产能，这么高的转化率，毒品质量仍然能得到保证。而且生产过程非常环保无污染，甚至比一些制药厂还要环保，这让很多顶级化工和化学专家、学者不敢相信。 直到今天，世界上没有一个制药师，包括一些教授级的，能够达到刘招华所生产的冰毒的整体质量（纯度、结晶度、外观）。 他们可能在理论方面没有问题，但他们掌握的工艺技术却做不到。 他有很高的智商和极强的心理素质。他在警方满城围堵的情况下，骑着自行车逃离广州，并在其藏身的山洞上刻下“刘招华，到此一游”，令警方震怒。 当时，刘招华正入住广州总统大酒店 818 房间。民警迅速出动，赶往广州总统酒店，而此时刘招华刚从外面回到酒店。危急时刻，刘招华没有立即扭身逃离现场，而是做出了惊人之举。他和侦查员乘坐同一部电梯，见侦查员按了 8 楼，刘招华立即按了 7 楼。 在 11 月 4 日当天，广州警方部署大批警力，对全市各出入境关口和主要交通要道实施戒严。特别是对离开广州的可疑车辆进行了检查，查得很紧。公共汽车、出租车、私家汽车沿着运货车被逐一检查。走出总统酒店的刘招华心里很清楚，在广州各大交通要道，都会有检查站对他进行抓捕。警察肯定会对进出广州路口的车辆进行检查，于是刘招华选择了一种谁也没想到的逃跑方式–自行车。 对于刘招华来说这自然是最好的伪装，刘招华于是在警方的重重包围下骑着自行车逃离广州。而这已经是刘道华第二次从警方眼皮底下溜走了。 他同时拥有三位妻子和四个孩子，他的金句在情感市场大受欢迎：“大老婆是我最喜欢的，二老婆是我最疼的，三老婆是我最爱的。” 在 2000 年，刘招华以李森清之名定居广西桂林全州县，并结婚生子，在当地颇有名气。 这位“李先生”的邻居说，他待人和善，但有点小气，是个有钱人，有一副小市民的样子。 这次刘招华伪装得很成功。事实上，逃亡期间刘招华也成为当地政府的重要客人。他在桂林临桂县凤凰林业租赁了 2.4 万多亩土地，声称要用 3 年时间完成一个总投资 3 亿元的项目。那么，他为什么要租这么多林地呢？刘招华自称，自己做冰毒没有成就感，而种植红豆杉却让他有成就感，因为他种植的面积是世界上最大的。 刘招华既狡猾又傲慢，他不按常理出牌，认为最危险的地方反而是最安全的。这是他几次成功逃脱追捕的重要原因。 在广西桂林的几年里，刘招华大秀自己的生意。最重要的是，他毫不避讳地让自己上了报纸，甚至成了当地的名人。2013 年 2 月 6 日，《桂林晚报》用整版篇幅报道了一位居民勇斗小偷的故事，而这位勇抓三贼的居民就是改名了的刘招华。 被抓后，他在监狱里对警察说：“你可以问你想知道的，列一个清单，但别和我玩智商，你玩不过我。” 在法庭上，他幼稚地辩解说：“我从不卖毒品给中国人，只卖给国外人。外国人用鸦片打开了中国的门，我就用毒品去打开他们的门。” 在警方眼中，他是一个误入歧途的化学天才，多次巧妙地逃脱警方的大规模逮捕；在制毒贩毒界，他是一个不可复制的传奇；在他妈妈的眼里，他是个好学生；在他的三个妻子眼中，他是“时间管理”高手；在孩子们眼中，他是一个只关心生而不关心养的冷血父亲。 有人曾将刘招华形容为现实版的中国“沃特·怀特（绝命毒师）”，业内人士并不认同这种说法，因为即便是有着主角光环的沃特·怀特，无论是制毒技术（包括冰毒品质）还是生产规模，都比刘招华低了好几个档次。 就影响力而言，虚构的沃特·怀特更是无法比拟。刘招华在全球贩毒、制毒圈非常有名。2002 年，墨西哥大毒枭“矮子”古兹曼刚出狱，就立即派帕尔斯打听在逃的刘招华的下落，并欲出重金寻求合作。 在人生经历上，刘招华也比影视剧中沃特·怀特的更富传奇色彩，他当过兵，当过法警。 他立了功，受到嘉奖。 在任期间，他是每个领导都想重点培养的骨干。如果不从事贩毒，他前途一片光明。 当然，在社会危害性上，刘招华罪恶滔天，因为他制造了 31 吨甲基苯丙胺。甚至，凭一己之力影响多个行业的规范，例如一些企业工厂、科研机构、学校等使用盐酸都需要先报备。 翻译基于腾讯交互翻译 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~","link":"/kewenlu2023/posts/8a642a9c/"},{"title":"逛Quora：有哪些“命运不公”的例子？","text":"原答案：What are some good examples of ‘life isn’t fair’? 文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。图说：有哪些“命运不公”的例子？ 既然你可能已经认出了右边的那个人，那就让我向你介绍一下左边的这位年轻人吧，他是我的高中同学贾斯汀-杨（Justin Yang），他是我 12 年级 AP 微积分班上年龄最小的学生（当时 14 岁）。 贾斯汀在 14 岁时就展现出了惊人的数学天赋–当其他同龄人都在为解决平方根问题而苦恼时，他却在教室的角落里和可怜的 Cacchione 先生一起深入探讨数论及其应用。 缺课有一天在学校，我发现贾斯汀不在。这不是他的作风。自从我认识他以来，他从没缺过课。我回家告诉了妈妈。第二天，妈妈告诉我贾斯汀刚做了心脏搭桥手术。 “手术很成功，他应该很快就能回学校了”，母亲说。 但他再也没回来。 手术确实很顺利。然而，在术后护理期间却出了大问题。回家两天后，他突然中风，口鼻喷血。他立即被送进了不列颠哥伦比亚省儿童医院。 第二次手术后，他活了下来，但他的生活从此一去不复返。偏瘫、吞咽困难、痉挛、失语症、行走步态改变……由于不可逆转的神经损伤导致手部僵硬，他从此再也无法拉他心爱的小提琴；无论他如何努力，说话都含糊不清。这对他这样的聪明人来说，简直如同困在监狱。 丧母一年后，贾斯汀的母亲，也是我母亲最好的朋友，死于病毒感染引发的多器官衰竭。为了减轻巨大的经济负担，贾斯汀的父亲设法在美食广场的餐馆打了两份零工。 尽管中风留下了后遗症，医生也做出了悲观的预测，但贾斯汀没有遵循“他将终生与轮椅为伴”以及“他的认知功能极有可能退化到 5 岁儿童的水平”的说法。他不会让这种事情发生。 后来……一年过后，这个年轻人参加了第 59 届美国数学竞赛12（注：面向 12 年级及以下学生） ，获得了满分 150 分。 贾斯汀目前正在不列颠哥伦比亚大学（UBC）攻读数学博士学位。他的研究兴趣在于数论，尤其是解析数论、岩泽理论和伽罗瓦表示，以及自同构形式和算术几何。 我祝愿他一切顺利。 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu2023/posts/db442ab6/"},{"title":"逛知乎：一位博士的求职经验谈","text":"原答案：大家能分享一下当前博士就业的情况吗？ 文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。逛知乎：一位博士的求职经验谈 我是中国科学技术大学的博士，毕业的时候基本拿到了各大厂的 top offer，包括华为天才少年、阿里星等，最后我选择了华为，以下是我求职经历的分享。 博士毕业，学术界还是工业界，创业还是大厂博士毕业的时候，就涉及到工作的选择，我大致划分为 5 种：学术界、自由职业、创业、国外大公司、国内大公司。 首先是学术界，虽然我很喜欢科研，但是如同我一开始读博时的顾虑一样，我不喜欢理论，喜欢能够实用的研究。我觉得学术界的研究，即使是网络系统领域，也经常脱离实际需求。例如我博士期间整个团队花了几年时间研究的心血，虽然发表了很好的论文，但也只是探索了一些可能性，并没有在任何一个生产系统中商用。今天，我仍然希望把工业界的成功实践总结成论文发表出来，就像我喜欢写博客分享自己的生活一样，但不希望 “为赋新词强说愁”，为了写论文而专门做一些短期内不可能商用的东西。 其次是自由职业，虽然黑客精神本质上是鼓励自由职业的，但目前基于知识的利益分享机制还不健全，除了个别大 V，只靠咨询服务、知识付费、个人网站的广告收入来养活自己是很难的。对于大多数自由职业者来说，自由职业能赚到的钱远远少于给大厂打工。因此，我自由职业的想法逐渐被消磨。羡慕 LUG 选择自由职业的小伙伴们，用自己的人生践行着理想主义的精神。就目前而言，还是需要先保证自己不饿死，再谈自由、分享、开放的黑客精神。 然后是创业。创业公司的优点在于效率高，可以像鲇鱼一样钻进细分市场。分析目标市场的规模和当前玩家情况，就会发现公司挣钱都很不容易。像微软这样体量的公司，10 亿美金以下的市场根本入不了法眼。因为大公司要立项做一件事情需要复杂的流程，需要一个多功能的团队支持，一个小团队三五个人搞定的事情，大公司可能需要几十个人的团队。大公司开发流程复杂，代码生产率 300500 行 / 人月，产出的代码也是经过严格的检视和测试的；小公司可能代码生产率高达 30005000 行 / 人月，但代码质量未必这么高。因此，大公司比较适合 to B 的、对质量有严格要求的市场，而创业公司比较适合小步快跑、快速迭代的市场。 我所在的数据中心网络研究领域就比较难创业，因为数据中心都是大公司才有的，大型公司要么自研智能网卡，要么采购其他大公司的智能网卡，谁会去买一家名不见经传的小公司的网卡呢？因此，这个典型的 to B 领域虽然有很多创业公司，但都是功成名就的大厂大佬们出来创办的，并不适合年轻人创业。如果要创业，可能就得去做区块链、元宇宙、隐私计算、人工智能等比较 “新兴” 的领域，而我在这些领域并没有积累，也不希望放弃在数据中心领域已有的积累。 我认为数据中心领域还是比较适合去大厂工作。相比自由职业或者创业公司，大公司的条条框框更多。这些条条框框一方面体现在规章制度、项目管理和开发流程上，另一方面体现在选题立项上。用我导师的话来说，就是要遵从公司商业上的事实与选择，尊重公司在产业中的位置与产品的现状；研究的问题一定需要有可以落地到产品的途径，而不是解决 “人类的问题”。 在国内或者国外工作对我来说没有什么不同，但是我女朋友今年才博士毕业，如果我 19 年就出国的话，就从异地变成异国了。异地的时候我们还能每个月见一次面，异国的话就没法这么频繁了，甚至还会有时差，就更麻烦了。因此我很快就排除了出国工作这个选项。2018 年初，我突发奇想，报名裸考了托福，还考了 103 分，其中口语和写作是最差的，分别是 22 和 24 分，如果经过一定的准备，也许可以提高。但后来我并不打算出国工作了，就没有刻意学习英语。 大厂面试，主要就是做题、讲研究成果和聊天这么综合看起来，就只剩下国内大公司或者独角兽了。大公司招人一般有几种渠道，大佬邀请，内推，或者海投简历。因为我们在 MSRA 的圈子里，很多从 MSRA 出去的大佬自然就成为我们的重要选择，他们也会主动联系我们，这种大佬邀请的方式拿到顶级 Offer 的概率最高；内推则是找朋友内部推荐，我的联培博士好友聪老师就帮我内推了好几家公司；海投简历一般来说不太建议，首先是简历被 “捞” 起来的概率不大，其次是匹配到的部门也不一定合适。大佬邀请或者内推的方式相当于利用推荐人的背书，在面试前给了面试官较好的第一印象。不过，内推一定要找靠谱的朋友，曾经有人给我推荐候选人并说了坏话，我就说要么就别推荐，由于个人恩怨说人家坏话总不是好事。 我一共面试了 12 家公司，分为三类： 国内大厂，包括阿里、腾讯、字节跳动、美团、华为国内独角兽，包括 Pony.ai、第四范式、寒武纪、地平线外企，包括 MSRA、Xilinx、VMWare大部分公司的面试形式都差不多，前两轮是技术面，大多数公司会让讲一讲所做的研究，做一些算法题。后面是主管面，以及更高级的总裁面，有的还有 HR 面。这些高层面试就以聊天为主，主要是看研究成果的影响力，未来的职业规划，公司价值观的匹配程度，高层领导也会借此机会宣传公司，吸引候选人。有些高级领导也会在面试中要求写代码。 比如阿里星就包括两轮技术面试、一轮主管面试、一轮交叉面试，以及一轮阿里星终面。阿里星终面是部门的 P11 总裁和其他部门的两位大佬，加上高级 HR 主管一起面试，先让做 30 分钟学术报告，各位大佬再提问 30 分钟。当时我不知天高地厚地大谈起正在做的批流一体处理的数据库项目，没成想 P11 大佬就是数据库的资深专家，被喷了一顿。不过我的很多不成熟的项目就是这样利用给大佬汇报的机会来接收反馈的。在 MSRA 实习的时候，有一次（并非面试）图灵奖得主 Butler Lampson 来 MSRA 访问，我就给他讲了讲全序消息传输的想法，他给了非常有价值的反馈，这个工作在被拒了 4 次以后终于发表在 SIGCOMM ‘21 上。 阿里的交叉面试也令我印象深刻。交叉面试的面试官来自其他部门，是一位从 Intel 跳槽过来的专家，问了我很多 CPU 体系结构的知识，他说我在同龄人里算懂的比较多的，但对于细节了解还比较少。我说，在公开渠道很难了解到 CPU 微体系结构的细节呀。他颇有些深意地说，这就是工作经验的价值呀。这一席话让我意识到，一定要加入到有核心技术的团队里面，并且有尽可能宽广的技术视野，才能在短暂的青春里学到尽可能多的 know-how。 面试字节跳动的郭传雄老师时，郭博士给我出了一道数学题。那道题是给定一个递推公式求上下界，是从他的 DCell 论文中得出的（随着 DCell 级别超指数级增长的服务器数量），而我并没有认真读过这篇论文。其实数学上这个上下界并不难求，但是我当时的确没做出来，郭博士给我讲了才豁然开朗。郭博士说，他喜欢的研究就是数学理论优美，同时又有实用价值的类型，但这样的研究可遇不可求。面试字节 CTO 杨震原的时候，他让我当场写代码，还聊了很多我研究工作中的细节。他说，好久没有聊这么底层的东西了，他在百度的时候就做这种底层优化，有种当了几年将军又回到当年侠客切磋剑法的感觉。 面试 Pony.ai 的时候，如愿见到了传说中的楼教主。见到楼教主之前有两轮代码面试，每场面试有两三道不算难的算法题，跟 Google 的面试很像。楼教主给我出了几道智力题，我都没有见过： 用一个每次抛出正面朝上概率为 p 的硬币，允许多次抛出，实现一个等概率的 01 随机变量，要求尽可能减少抛出次数的期望。这的确是很漂亮的一道题，现场我想出了最优策略但没算出期望来，后来我才搜到期望是 1/H(p)，其中 H 是熵函数。n 维立方体的顶点数和面数。三维正方体的六个面上任给起点和终点，求虫子沿面爬行的最短距离。把一张长方形纸的一条边三等分、五等分。楼教主现场给了一张 A4 纸让我折，我折腾半天，给出一种方法，教主以为对了，我自己发现错了；然后我改了改，找到一种他没见过的三等分方法，但比较复杂，其实教主的方法非常简单，也很容易推广到任意等分。当时我还问楼教主，怎么看端到端的自动驾驶流水线，他说生命攸关的东西完全交给神经网络这种黑盒子，他不放心；深度学习的可解释性和可调试性不强，就算效果好，万一出了事很难向公众解释，也不一定能符合法规的要求。 MSRA 的面试轮数可能是最多的，有两轮代码面、研究员和主管集体面试、交叉面、副院长面、HR 面等，其中每轮代码面是两道算法题加一道系统设计题，号称是 “一票否决制”，因为代码面不通过的不管主管怎么说情都没法录用。MSRA 的研究员和主管集体面试和华为的研究员和主管集体面试、阿里星终面比较类似，都是先讲学术报告，然后是提问交流。交叉面主要是考察知识面的广度和思维的开放程度，曾经有位候选人在面试时大肆攻击交叉面试官的研究领域，这就不太合适了。 面试华为的时候，谭博问我，对 FPGA 在数据中心里的应用怎么看。如果仅仅站在为自己的研究成果辩护的角度，大谈 FPGA 的优势，这个回答就狭隘了。不同的公司有不同的选择，其中有技术路径依赖的原因，也有商业上的考虑。公司更希望候选人能客观地分析各种不同智能网卡体系结构的优劣。我自己做面试官的时候，也希望候选人能从自己的研究工作跳出来，有新的独立的思考，最好能升华一层，而不是像复读机一样把几年前做过的报告再讲一遍。 事实上，这些面试我都没有怎么准备，因为我觉得大厂的算法题都不难（除非是考到数学或者脑筋急转弯类的问题）；研究成果已经讲过很多遍，不需要 PPT 材料都可以讲出来；聊天就更不用准备了，我的职业规划就是成为系统架构师，我也比较喜欢奋斗，跟国内大厂的价值观比较匹配，同时我对计算机也保持着浓厚的兴趣，希望持续探索巴斯德象限的前沿。有些面试官还是会问一些跟计算机基础知识相关的问题，我就知之为知之，不知为不知。比如 C++、Java 我没用过，我就说不会；虽然我做过一点内核开发，但都是最简单的内核模块，没有研究过网络协议栈。我自己做面试官的时候也喜欢考察候选人的计算机基础知识，例如操作系统、网络、分布式系统、数据库等，以及候选人惯用编程语言的语法语义和编译链接运行时的知识（例如垃圾回收），经常发现很多候选人在问到理论性的问题时回答得头头是道，但追问一层就答不上来了，因为他们并没有真正用过这些系统，只是背了一些面经。有的候选人甚至试图欺骗面试官，如果面试官是这方面的专家，这是很容易被发现的。 直到今天我自己做了面试官，才发现跟我当年做候选人的时候一样，候选人的水平和经历跟面试官越接近，面试起来就越舒服。遇上高手就像是朋友聊天，比如遇上打 ACM 的就聊聊擅长哪些数据结构和算法，哪些题是天坑，比赛的时候怎么打配合；遇上折腾网站的就聊聊用了什么框架，CSS 和 JS 有多少坑，运维的过程中有哪些血泪史；遇上稚晖君那样折腾嵌入式系统的就聊聊玩过（烧坏过）哪些单片机，PID 控制的参数怎么调的；遇上搞区块链的就聊聊共识机制和智能合约，顺便让他给我科普科普已经多年没看过的币价；遇上玩过信息安全的就让他讲讲黑了哪些网站，找到了哪些漏洞的 “光辉历史”；就算遇上自己不懂的领域，也能虚心请教，听候选人讲讲他的故事，能学到不少东西。 大厂 Offer 的选择承蒙各位面试官和领导的厚爱，在这些公司我都拿到了不错的 offer。国内大厂的 offer 之间是会互相 match 的，例如我拿到阿里星的 offer 之后，其他几家大厂都会参考这个 package。因此学弟学妹如果想找大厂工作，一定不要只投一家，否则就等着被宰吧。 为了选 offer，我就像审论文一样，给每家公司写一段 Summary（概要总结），列出 Strengths（优点）和 Weaknesses（缺点），将面试过程中和各方面收集来的信息放到 Comments to the Author（评论）里面。同时，我也会记录公司里的大佬、直接主管、新入职的优秀员工和实习生。就像顶会的每篇论文审稿意见都很充实，我给每家公司也写了上千字的点评。在此基础之上，我做了一张电子表格，从多个方面给每家公司打分，包括： 入职薪酬 长期预期薪酬 Offer 在同龄人中的相对档次 业务匹配度 成长空间 工业界影响力 学术界影响力 Work-life balance（工作轻松度） 领导熟悉度 工作稳定程度 公司文化 公司品牌 部门前景 领域前景 技术积累 大牛老板 大牛同学 工作地 / 户口 每一项都像论文审稿一样 1~5 打分，然后计算算术平均值、几何平均值、方差等统计指标。根据这些统计指标，再对各家公司进行排序。就像审论文一样，论文中不中不是单看评分，但第一轮筛选中可以把评分过低的先行过滤。平均分 3 分以上的公司有 7 家，也就是第一轮过滤掉了 5 家。因为最后只能选一家公司，“中稿率” 只有 8%，这确实是个很残酷的筛选。对于第一轮被筛掉的公司，为了避免吊着招聘 HR，浪费主管的一片真心，我就早一点直说了。就像论文第一轮被拒之后早点告诉作者，作者还可以早一点转投其他会议。我这个人不擅长拒绝，在拒绝每家公司的时候都要深思熟虑好久。 这 7 家的平均分最低为 3.78 分，最高为 4.11 分，其中前 6 家的平均分都至少为 3.94 分，因此真的是难分伯仲。我也很难对上述这些指标进行加权。论文投稿中，也不是根据分数来决定最终的录用，而是经过 PC（程序委员会）会议讨论，如果有人 champion（支持）并且没有人反对，这篇文章多半就能中。换到选择公司的语境中也是如此，如果有明显的优点并且没有明显的缺点，就是更好的选择。 最终，因为我的博士启蒙导师在华为，而且华为有软硬件结合设计的优势，我做出了艰难的选择。拒绝这 7 家公司中的另外 6 家就更难了，因为每家公司都有广阔的前景、优渥的待遇、充足的成长空间、成批的大牛老板和同学等。在那时看来，也许选择哪家公司并没有很大的不同。 毕业前不久，遇上了 “516” 美国制裁事件，一时间人心惶惶，很多人说华为快不行了，劝我不要去华为了。一位老师对我说，人最宝贵的是时间。如果你想支持华为，可以花钱，买一部手机都是支持华为。但是如果选择加入一家公司，投入自己的绝大部分时间，那就不一样了。钱学森等大科学家可以放弃优渥的待遇回国做默默无闻的工作，但他们再也不能像杨振宁那样做世界前沿的研究、拿诺贝尔奖，而且一辈子的生活条件也没有很好。但我经过实地调研和访谈，确认华为并不是像外面传言的那样不堪一击，整个公司还在正常运行，该做什么项目还做什么项目，在食堂吃饭的时候电视机上就在播出与制裁相关的新闻，而大家都已经习以为常。因此，我力排众议，坚持认为加入华为跟钱学森回国完全不是一个性质，并保持了我的选择。这也是我一生中遭到反对最多的重大选择。 新员工入职培训的时候，我们跟人力资源部的一位总裁座谈，我就提出，可否效仿 “阿里星”，搞一个系统性的吸引优秀人才的项目。2019 年 8 月，公司恰好启动了 “天才少年” 计划，我也很有幸成为其中的一员。公司层面的 “天才少年” 计划当然跟我随口提出的建议无关，但我能够预判到公司对博士等优秀人才招聘越来越重视，而不是像某些人想象的那样受到了制裁就要收紧优秀人才的招聘。3 年过去，在领导和各位同事的关怀下，我承担了越来越重要的项目责任，发挥了越来越大的价值，也说明当年的这个选择没有错误。 尽管我只有很有限的工作经验，想告诉学弟学妹的是，在上述 “打分项” 中，领导和部门的重要度高于公司和研究领域的整体状况。一个人过得舒服不舒服，在工作中能不能受到重视，很大程度上要看领导，尤其是直接主管。跟领导的 vision（愿景）一致，合作起来会更顺畅。这就像是在读博过程中，导师的重要程度远大于学校和学院的名气。部门的重要度其次，主要看部门的业务和氛围，也就是业务的基本盘是否稳固，是否有想象空间，团队氛围是否和睦。在大公司中，公司股价的下跌可能会影响收入，但是短期内对个人工作的影响是不大的。研究领域的热门与否更是一个缓慢的变化过程，如果哪一天自己的研究领域垂垂老矣，再换也不迟，很多大佬都经历过研究领域的切换。 发布于 2023-08-04 13:41・IP 属地北京~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu2023/posts/e40b167d/"},{"title":"逛知乎：中国人吃饭太麻烦了","text":"原答案：为什么说老外一个人能带宝宝，而中国人要一家子？ 文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。逛知乎：做饭真的很费时 在美国生活过几年，现在国内带娃，发现最大的问题是中国人吃饭太麻烦了。 炒菜这个东西真的是非常耗时间和精力。洗菜切菜这个基本没差，但架不住炒菜配料多啊，葱姜蒜各种辣椒香料都现配。开炒了还得分先后，家庭小灶一刻不停地翻啊翻。最后三个人还得整四个菜，一个人得一刻不停干一个小时，还产生了大量的脏盆子，太麻烦了～ 老美的普通晚餐，一人一块煎牛排，配点生的或焯过水的西蓝花，再吃个一块面包，营养就没问题了。大部分煎烤食物不需要全程关注，其他复杂玩意也是炖得居多，放个大锅煮啊煮，一人一碗完事了。 发现很多人理解错了。 在国内你也可以吃得简单，但大家的习惯就是吃小炒配米饭啊。大部分人自己做饭会消耗大量精力，带孩子自然也就累了。 我自己和老婆工作日每天单位吃完，最早也得七点到家，加个班还得九十点。我妈一个人带半岁孩子，根本照顾不过来，只能吃外卖了。价格适中的外卖那个水准大家应该也都清楚不可能长期吃。我爸这时候就得来帮忙买菜洗菜配菜了。吃小炒，他们平时得两个人对付一个孩子，还没很多空闲时间。 周末我们自己带孩子，吃吃肯德基麦当劳，偶尔煮个火锅。这样我们还能有点自己时间轮流娱乐下。 能接受吃得简单，一个人可以对付，两个人轻松应付。要是顿顿吃小炒，一个人没法对付，两个人可以对付，三个人也没有更轻松，四个人的话做饭那个可能更累。 编辑于 2023-05-31 12:49・IP 属地浙江 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu2023/posts/165ae18c/"},{"title":"逛知乎：为什么中国实现不了免费医疗？","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 原答案：为什么中国实现不了免费医疗？ 干过干部保健，照顾过各种档次的老干部，基本排名是离休的最厉害，固定床位固定医生，实报实销，去医院一坐就有人来服务，只需要抽血的时候伸手就可以，护士也不整那些什么找血管的幺蛾子，一针下去必然见血 更高一档次的我们碰不到，除了必须亲自做的检查，基本上是下人们干，送血液样本，拿药什么的都是司机在做，有一次司机把一管血打碎了。颤抖着哭泣着问护士能不能一管血多测几个实验。得知可以之后司机如释重负。这类干部住 301，是一护士一医生 24 小时陪护的，中间有换班，陪护不许说话以免打搅干部休息 下一等级就是在职的干部，只需要垫付住院费和目录外药品，基本上能做到全部报销，他们的家属比如孩子，药物报销 80%，检查全免 每年到了年终就有几个幺蛾子，非要做 64 排增强 ct…… 好像打造影剂不伤身似的，这几个基本上不是干医疗的，可能是看着别人做心里眼红吧。做派特 ct 的也有，需要医院保障干部医疗的领导签字。还有吃伊马替尼，一盒 2w 的，也是签字就能免费 再后面一档就是退休干部，根据职位高低分等级的，比如我姥爷是团级干部待遇。胆管癌从发病到走只出过人血白蛋白的钱。不过我觉得我姥爷参加过西藏平叛，对他免费医疗是理所应当 我爸是副军职待遇，实际上他啥级别我不想了解，反正他对我腰板可硬挺了，为啥啊，因为他生病有小护士伺候呗，但是也是做做样子，前几年胰腺炎还是腆着脸让我和我妈照顾。操他大爷的，我心肌炎住院的时候他半夜蹦迪也不来看我，胰腺炎的时候已经和我妈离婚了，我妈还偶尔守着他 地方干部我确实不太了解，因为不对口。部队的话现在好像是普及了全面免费医疗。前几年是部队对口医院，先去部队医务室看病拿药，解决不了了才去指定医院。所以有不少泡病号的 泡病号的新兵才是最烦人的，本来当兵的身体就很好，我见过最荒唐的是普通感冒被转诊出来的，还有每年夏天必然有的割包皮的。最扯的是有一年圣诞节，一对情侣手挽手拿着一张感冒的转诊单要看病的。因为没盖章不起效果被我拒绝了，结果平安夜过后这对情侣施施然又来了，拿的还是那张转诊单………… 又超过转诊单时效而且还没盖章，他们扬言要投诉我，我说你去。结果他们十几分钟后悻悻地离开了 最扯的还有拿自己免费医疗待遇招待朋友的，一女战士请了个小男友去医院看病，因为用她名字检查和拿目录内药物免费。还有一个营职干部让朋友拿自己孩子的名字去看病，医生比较警惕，把孩子年龄写了下来并被我们发现了。被处理后竟然跑我们这来贴大字报对我们良心谴责 工作第一年，有个离休干部肺部感染，去呼吸科就诊结束后顺便买了个呼吸机，回头要我们负责给他报账 对于这些人，免费医疗不光免费，还能优先插队和检查，手术他们挑医生，病房还得住在干部病房里。最恶心的莫过于医院床位紧张时必须去盯着科室不准让军人病床给普通人住 所以你说这免费医疗的口子能开吗？？？？开了那不是医院成养老院都把家里老人送来颐养天年了？？？ 当然开我觉得也可以，但必须严格执行分诊制度，能在社区医院看的病就在社区医院看，去更高等级医院就自费。出现社区医院医生打蚊子，三甲医院教授看肺癌也看感冒的现象是严重浪费优质医疗资源！ 发布于 2023-01-02 13:40・IP 属地重庆 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~","link":"/kewenlu2023/posts/7a58f48d/"},{"title":"逛知乎：公司来了一位“卷王”后","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 怎么看？坐着看啊。我举几个例子阿里系人才来到我司后的变化 hr， 增强了考勤，增加了工作时长，比如每天工时不能低于 10 小时 增加了周报、月报、季度报。原本只有 kpi 的，增加 okr， 绩效自评增加了价值观体现，必须要写一个小故事说明自己是符合公司价值观的 增加了半年度的述职汇报 增加了晋升难度，技术晋升有一半是业务评委，这些评委分不清楚客户端和 web 前段，甚至分不清前端和后端。因为对他们来说，都是开发 增加了面试通过率的难度，技术主管都觉得没问题了，来个候选人价值观有问题 增加了每年年底人才能力评估环节，给每个人贴标签，对于所谓低潜力的人进行淘汰。你要问什么事低潜力? 就是那种低头干活，不会说话，几年都晋升不了的老实人 张口就是组织架构，变革，优化，效能，甄选，自上而下 产品 白天看不到人，晚上各种拉你开会，开会也是小弟来。 美其名曰，坐镇后方，掌握大局 权利把控极为敏感，有任何问题，你必须找他本人，由他本人安排小弟和你确定。群里反馈问题相应非常积极，然后拉群，at 小弟跟进。 一种你们都是乐色，我就是来拯救你们的这种姿态，3 句话离不开 阿里怎么怎么样 的口头禅 产品稿基本上什么内容也没有，甚至有些直接截图竞品的界面。 特别擅长做汇报，比如没做的，就是规划内待排期。比如增长数字小的，就用百分比。 张口闭口，拉通，对齐，抓手，对标，量化，复盘，体感，心智，布局，精细化，组合拳。。。 技术 大体上和产品差不多，但技术岗基本不怎么写代码，或者压根就不写代码，纯管理，下面人想向上反馈，必须要有他参与，或者必须他来，基本参照传话筒，如果你有意见，那就是你的态度和工作方法有问题 通常，如果他的老板问他问题，大概率他是不清楚，然后到处拉人 各种心安理得的拿来主义，有多夸张？连晋升 ppt 都要让一帮小弟来写，然后他进行汇总缝合，看不懂的地方会让小弟来给他上课 你沟通上刚说一句什么，就以 “你说的不就是那个 xxx 么，这个很简单的”。然后过渡到自己熟悉的领域，你就算发现他胡说八道要纠正回来，他也会再兜回去 面向高 p 工作，无论你一年工作怎么样，只要在最后能让他好过，你绩效就高。无论你做的多牛逼，反之亦然 一样的白天见不到人，晚上各种群里 at 人刷存在感，朋友圈里秀加班，但凡高 p 在群里放个 p，第一个回应的永远是这帮人 经常设计里提一些莫名其妙的词汇，嗯，自创的， 说白了就是把中文转成英文，然后取英文首字母，然后就是 xxxx 方法论 追求结果，给你定指标，怎么做到不管，能不能做到不管，合不合理不管，反正完不成你自己看着办。 和产品不同的是，张口基本是量化，协同，矩阵，赋能，转化，闭环，生态，体系，倒逼，颗粒度。。。 说白了，拿着高薪，但不干人事的，三天两头在那忆往昔峥嵘岁月稠。为自己的无能创造各种突破口，996 是怎么来的？不就是因为内卷之下，产生不了业务价值，只能通过卖惨，卖苦力来博取同情。 但本质上，还是管理制度的问题，上层领导实在没啥能力，想不到做什么，就【倒逼】下属，下属再【倒逼】下属，无意义的人力耗费，最后就拼工时，拼奉献。 这种制度下，就培养了一批卷逼。 看完评论，我来着重回答一下高频回复 业务情况 高成本低收益的需求多了。大部分都是人情世故的需求，利益交换。当一帮人以为靠努力奋斗就能拿绩效的时候，这帮人绩效老早就勾兑好了。 比如，A 所在团队用自己的资源做了 B 的需求，于是 A 在绩效上大笔一挥，跨团队协作。 B 在绩效上写，主动推进落地。 然后这俩下一次交换。 再比如，A 邀请原公司同事来公司做个分享，绩效上大笔一挥，促进公司间合作交流，提升团队影响力。 再再比如 A 刚来，为了站稳跟脚，投入巨量成本给 某业务 B 做个需求，需求大概就是，原本需要 B 点 2 下，变成点 1 下。 你要问需求怎么过的？ ppt：业务有 N 个人，每天要操作 X 次，所以换算下来，每个月可以节省人力成本 xx 人日 / 月。 实际上这功能可能几个月都没人用 可能是疫情 3 年，可能是行业不好。反正流水连 3 年前一半都不到。当然了，从用户评价来看，喷的更多就是了。 虽然每家公司可能都有，但这帮人是真的很会做数据和 ppt。反正数据怎么看都是一片大好，但加起来就是对不上 福利 原本人人都有保底奖金，绩效高的可以多点。现在，hr 说，不允许吃大锅饭，凭什么别人辛苦加班努力，你 6 点下班就能享受人家的成果。现在强制 361, 绩效不好没奖金，没年终，没普调。还得 pip （干的多拿的多没问题啊，但干的多凭啥要从我这里匀过去?） 月奖变季奖。季奖变半年，半年变年底。美其名曰，合起来给幸福感更高。（离职的人什么都不会有） 取消了团建，取消了下午茶，增加了 hr 和你 one by one 谈话的项目 取消加班费，改调休，调休有上限。达到上限不是不加班，而是让你在家里 “值班”，值班是“自愿” 的 技术 有人说上面都是高 p，低 p 不这样。嗯，确实不这样，因为级别不够，想不写代码也得下面有人才行。所以低 p 都是卷时间，比如大半夜 at 人审批工单、周六日 at 人联调、评估工时的时候按晚上加班，以及周六或周日加班来评估。不要觉得老实人不会向上管理，老实人加班卷起来，简直夸张。这种评估先自己砍自己一刀的，你说其他职能咋办 总觉得阿里有什么平台基建，这里没有。阿里某某怎么设计的，这里居然不是。然后大搞基建，阿里有什么就做什么，做出来就晋升。当底子掏完，没有作业可以抄的时候，技术优势荡然无存 pua 我觉得你不够追求结果，你明明已经迈出了那一步，但是结果没有呈现出来，所以。。。 你的数据是怎么得来了？你怎么证明你数据是科学且可靠的？你怎么证明，你证明的方法是科学有效的？好了我不想听这些，我就想知道数据结果是什么 你没有业务 sense 你的目标是什么？你的目标和公司战略有什么关系？所以是自发的还是自上而下的？你怎么能保证你你的目标能达成？我完全看不到你的目标有什么价值？ 我现在在说你的问题，你不要跟我扯别人的事情，先说你自己。我不希望听到任何有关破坏团队的话 （原话，和徐汇中学没关系） 最后，不是我不走。就杭州现在这情况，往哪走？你倒是给我说哪家公司没有这种卷王，要不是没找到好地方，要不是我还是个文明人，真的，我特么能干死这帮人 万幸，我所在的团队里，目前没有卷王 编辑于 2023-04-21 23:56・IP 属地浙江 都看到这儿了，不如关注每日推送的“科文路”、互动起来~","link":"/kewenlu2023/posts/6513d4d3/"},{"title":"逛知乎：关于杰青的几则八卦","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 原答案：杰青是如何评选的一般什么人能被选上? 某教授，妻儿均在国外，自己独自一人赚人民币换成美元花，堪称夫界楷模。 闲来无事就 push 学生，鲜有按时毕业者，导学关系远近闻名。 发文章讲究实用主义，业绩要求 IF&gt;5 的话，给你搞一大堆 5 点几。 最近，评上杰青了，范进中举似的言行，响彻整栋楼。 230516：不好意思，我楼歪了，我不知道怎么评上杰青，有人喜欢听八卦，我就再讲个 二某教授，能力很强，工作很拼，待人很好（以示与前述教授之不同），奈何数年评不上杰青，马上临近年龄大限。后西南某大佬 A 与此教授团队之大佬 B 关系甚密，有意招致麾下，遂许之杰青宝位，前提是先跳槽，大佬 B 为了年轻人进步，“忍痛” 放行，该教授得偿所愿，感激不已。 事后一年，大佬 B 在 A 的支持之下，登顶。众人才知，大佬果然是大佬。 三某教授，长相比较可爱（参照近日西安那位网红副教授的描述），但行事颇有铁娘子风范。数年前，终登杰青。大喜，决定给自己放假休息一段时间。某部委邀请其参评项目，推脱不去。团队大佬得知，面斥之，意思是 “自己如愿了就不考虑团队”。该年度，大佬团队的项目在该部委全军覆没。 0517：八卦果然魅力大，还好我日常积累多。写文章也是如此啊，朋友们，拿个小本本，把有用的想法记下来。 本文所述请勿过度联想哈，事情都是听来的，人物描述我都已经做了无害化处理，如果当事人刷到，请相信，世界上没有两片一样的叶子，但存在雷同魔幻的人生。 四某海归教授，入职国内 TOP 二高校，做人做事激情满满，常以荒野求生、高速飙车之类事情为酒后谈资。因与本单位行政领导闹掰，准备到别的单位另起炉灶。某大佬欲延揽之，听说包邮区有高校亦有意向，特提出，可以先为其解决杰青，教授欣欣然同意。果然，杰青到手。大佬、杰青把酒言欢，共谋大局。然而，杰青乃自作主张，未取得老婆同意。老婆死活不肯去，帝都待不下去也就算了，包邮区的便利难道都享受不到？杰青又不能达到本文（一）中所述之人的境界，因而犹豫不决。大佬亦察觉，多次催促，不能成行。后事情再起波澜，杰青的单位换了一把手，与杰青促膝长谈，多次挽留。杰青因此下定决心留下来，大佬那边，不知如何处理。 五某杰青，同单位大佬嫡传弟子，为人豪爽，经常语出惊人，上至院长，下至保安，常受其指摘。一日，偶见学院的留学生，在办公楼尽头的阳台做宗教活动，心厌之，说，好好一个学校，在这装神弄鬼！不料，该学生竟 - 然 - 会 - 汉语！转头怒视杰青，杰青强装镇定，避走。之后，大楼保安收到指示，加强杰青办公室楼层的巡视。 编辑于 2023-05-17 13:04・IP 属地浙江 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~","link":"/kewenlu2023/posts/31c58288/"},{"title":"逛知乎：同样人口众多，为什么中国比印度发达？","text":"原答案：为什么中国拥有世界上人口最多的国家却比印度更发达？Why is China more developed than India despite having the world’s largest population? 文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。逛知乎：同样人口众多，为什么中国比印度发达？ 我是中国人，我在印度工作过一段时间，也去过印度的一些城市和乡村。 我个人认为，未来10到20年，印度和中国之间的差距只会越来越大，而不是越来越小。 首先，印度错失了工业化的黄金机遇从 1989 年冷战结束到 2008 年全球金融危机爆发，这 20 多年来是全球经济全球化的黄金时期。 近二十年来，西方发达国家将制造业转移到发展中国家，中国抓住了这个机会，而印度却没有！ 2008 年次贷危机后，西方国家已经感受到制造业空心化带来的危险，并严格控制制造业外流。 就在那时，印度开始专注于制造业，但好时光不会再来了。 近年来，印度制造业发展，外资也进入印度。 然而，印度的外商投资与中国的外商投资有很大不同。外国投资印度的目的是抓住印度的内需；外资来华投资，目的不仅仅是为了占领中国市场，而是为了满足世界的需求！ 外资在印度投资，更多是为了满足印度政府的市场准入要求。所以很容易判断，印度制造的产品不具有全球竞争力，而且在印度以外很难看到任何印度制造的产品。 其次，印度可能会错过第四次工业革命很多人把高速通信、新能源、新材料、生命科学、人工智能等领域的突破称为第四次工业革命。 但印度人仍然热衷于IT，对第四次工业革命的投入很少。 我不是说印度不投资，而是很少，不到中国的十分之一。 未来，科技水平将决定一个国家的实力，甚至决定一个国家的命运。 第三，印度的环境危机作为一个中国人，我亲眼目睹了工业化对中国环境的破坏。 破坏环境容易，修复却很难。如今，中国每年在环境保护方面的投入远远超过教育经费和军费开支的总和。 但修复环境需要几代人的时间，有些人永远无法修复。 不幸的是，我在印度也看到了类似的环境破坏，印度的人口密度比中国高，环境承载力却比中国低。 印度必须解决环境问题，这可能会造成社会不稳定和动乱。 最后，印度的教育危机尤其是教育不平等。我个人认为，印度有 20% 的人受到了良好的教育，但另外 80 %的人的教育质量和环境却很糟糕。 教育的不平等导致生命发展的不平等，印度应特别关注大众教育的质量并大力投资。 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu2023/posts/9dd409e3/"},{"title":"逛知乎：在外企上班是一种什么体验？","text":"原答案：在外企待时间久了，会有什么弊端吗？ 文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。逛知乎：在外企上班是一种什么体验？ 因为比较丢脸，只敢匿名回答 个人工作背景：德企四年，美企三年，日企两年。一直以来工作都挺顺利的，从毕业就被提前录取，和老板同事们相处融洽，也慢慢地发展，经历了好几个职能的成长。去年的时候，大概是中年危机来了，也不知道听信了什么身边的邪，说外企在国内要没发展了，还是民企有前途，就一冲动之下去了一家上市民企，结果就被毒打了 当时谈的薪水是七十万，但试用期前三个月薪水打八折，奖金放了十五万，不过一进去当老板给我做考核时，写了一堆没有数据没有实现路径，全是概念空洞的KPI之后，我心里就有谱这个奖金估计要看老板（直属领导）心情怎么打分了，如果不跪舔他大部分可能拿不到了。入职时谈好的房屋补贴，进去后才发现是要住在特定的地方才有，说好的假期调休，非常随意，依然按老板心情，出差完全没有任何补贴，住宿上限300，老板要你明天出差就明天出差，一出差就是一两周。。周末还要开各种无聊的会议，没有产出，完全在消磨时间。各类人员都以加班为荣，有的还赶着飞机晚上九点到和另一个公司的同事来吃饭（他们吃饭都吃到10-11点），完全不明白这样的应酬有什么必要。另外作为一个女性，还被副总当着所有人面说招我是因为我的外表之类，还被同事言辞轻薄。呆了大半年，发现了太多坑，算了下时薪，直接裸辞了。多呆一分钟，我都会觉得自己在倒贴上班， 离职后不久，直接回到了我现在的企业，一家跨国外企，因为之前的不快，薪水也没怎么谈，直接加了十万的总包就过来上班了。出差每天除吃饭外，还有固定的补贴，每个月有手机费补贴，车补贴，补充医疗，年假，病假，偶尔项目上要加班，平时上满八小时就可以走了。最近疫情公司发了好多口罩药品防疫品，各种关怀。开会有同事发烧连线，老板都会体贴地说项目可以由别人汇报，让他好好休息。老板和同事很多都有海外留学经验，本科也很多清北复交或985的，没人会开不合时宜的笑话，也不会费尽心机让你跪舔。一句话，不和那些小镇做题家一起工作我太愉快了！ 在当中找工作的期间，像华为字节什么其实也找过我，但我感觉我不是他们需要的人，在长期外企的培养下，我尊重专业，不喜欢表演勤奋，有一套自己信奉的正确的商业价值观，讨厌机会主义和华而不实的夸夸其谈，也不吃PUA和画大饼那一套，聊业务的时候大家的想法价值观都不一样，而且我也烦透了对公司不信任，时时要想着还有什么坑等着自己的感觉，不论是待遇上，还是工作上，坦率地说，合同写得再规范，我也不相信那些民企。因为我知道，为了压榨我们这些员工和获得利益，他们什么事都干得出来。希望规范的外企们活得越来越好，至于卷王们，他们爱怎么卷怎么卷，不要再出现在我的视野就好。 ———————————–快乐的分割线 工作之余上来摸个鱼，前段时间和前同事聚会（八卦）的时候听说好多消息，包括怎么裁员，包括怎么想尽办法克扣年终奖，幸好和我相熟的一些前同事早早做了准备，有的进了非常有名的头部外企，开启了新的职业生涯 (顺便还拿了笔赔偿），有的换去了更有发展的其他行业，那些卷王和恶心人的，也被开了不少，很多都是被自己领导当了弃子，灰溜溜地走了，不知道又去哪里霍霍人了，哈哈哈 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu2023/posts/b70637a6/"},{"title":"逛知乎：我在体制内（一）","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 原答案：为什么进入体制后这么累？ 其实吧，实话实话，我是工科的，体制内再怎么累，也还是比私企强。 我曾早八晚九扫码给别人测核酸，也曾半夜三点算绩效录入，最累的一次，搬了一下午党史学习材料，堆满了半个大厅。 男同志吗，可能也就体力活多点，再累能到哪儿去？干完活你还可以歇会啊。 但是我这专业，在私企能干什么呢？ 去各种气体泄露的化工厂，戴着防毒面具戴着安全帽背着检测仪器，一边忍受着让人眩晕的化学毒气，一边系着安全绳小心翼翼的爬塔生怕一个不小心踩空了，一边还得拿仪器去去测泄露气体的浓度。 每天检测完我脑袋都晕，每天我都想找个地方去吐去，我庆幸自己手脚麻利，没有做出一脚踩空的操作。 我这还算好点的。 你看看那些土木工程专业的，那工作绝对比我还累，每天那工程量，工地那个环境，各种打灰啥的，大猛子你们看过吧？多好一个小伙被摧残的不行了。 有时候我也后悔啊，当年我也是一个认真学习的好学生啊，我理综分挺高的啊，就因为我专业不好，我就得在这个环境干这活，对比没有我学习好的同学，我有时候真的是羡慕嫉妒恨。 要是当初报个师范多好，你说再怎么累，好歹是学校，那环境是人呆的环境啊，这特么化工厂，你放条狗过来，我保证一个月就被这里的泄露的毒气给毒死了。 工科就是遭罪，就像古代徭役，干活的就没有不累的。 我也承认，某些体制内领导煞笔，总是要一些没用的台账，然后层层加码，最后大家也很累也很无奈。 但我感觉，至少比我私企好多了。 感谢体制，至少让我续命二十年。 发布于 2022-09-28 00:37・IP 属地辽宁 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~","link":"/kewenlu2023/posts/92941c94/"},{"title":"逛知乎：我在体制内（七）","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 原答案：为什么体制内的年轻人都不热衷于晋升了？ 我们单位最近来了个 98 年的小伙，普通人家，父母一个月收入加起来七八千左右，他刚入职，我们又没有司法补贴之类的，一个月算上车补将将 4000，年底就一个十三薪，加上可能的精神文明奖千把块，公积金都算上一年也才勉强快六万。 但是人家就非常佛系，该干的任务一点不差，多的一点不干，到点就下班，直言自己不想提，聚餐领导喝酒人家就是饮料。吃饭时聊天，听他给我算了一算，我要是有这个条件，我也不想提。 先说家庭，就普通家庭，但父母收入一个人的就够日常开销，另一个人的就是存款，兼具各类应急。往上爷爷有退休金，奶奶没有，但足够老人日常生活和慢性病药品了，外公外婆那边也一样的情况。父母都有兄弟姐妹，都在家附近，轮流去看老人。这个家庭状况，去一线城市凑首付要伤筋动骨，但在我们这边，普通地市的房子，全款凑一凑也够，但没必要，首付一给，月供自己还足够了。 再说他现在，简单算个账：工资一个月到手不到 4000，我们这离他家有个百来公里，自己租个小房子，房租水电网话费八九百，还剩 3000；单位中午一顿 3 块，早晚周末自己解决，小伙自己会做饭，一个月算上和朋友下馆子，1000 吃喝足够，还剩 2000；小伙没有球鞋呀什么的费钱的爱好，平时就打打球玩玩游戏，一个月自己说是三五百游戏充值加球馆，取个平均 400 还剩 1600；衣服他就是优衣库之类的平价牌子，一件一百上下，平均一个月一件，还剩 1500。 到此为止，他日常的大开销已经没了，剩下一些偶发的消费，但一个月一千多的余额也足够他用的，最近他还在琢磨二手车，想买个两万左右的，代步练手，但按他的日常，估计一个月也就一箱油，还得说他开车经常回家。 当然这种生活也不是完美的，现在在找对象方面，日常开销太大的女生就不行，不过人家也不急，说自己反正还年轻，他也不会选工资不够日常开销的女生。 各位，自行带入一下，如果有这么样的生活，你还会去盯着晋升不放吗？为了收入多 20%，每天开会开到吐，手机 7x24 不关机，人家根本看不上。至于更多的灰色收入什么的，人家原话 “伸一次手，以后见到纪委就打颤，这种日子有什么意思，我可不想知道监狱伙食什么样”。 年轻人不热衷于晋升，不是因为他们傻，反而是他们太聪明，知道自己再怎么努力，上限也就在那了，赔本的买卖，他们才不干呢。 编辑于 2023-02-18 20:02・IP 属地黑龙江 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~","link":"/kewenlu2023/posts/8021b37a/"},{"title":"逛知乎：我在体制内（三）","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 原答案：在南瑞集团（国网电科院）工作是怎样一种体验？ 每年南瑞都会启动校园招聘，每年都会有无数电气新人和曾经的我一样，心中充满疑惑： 1、国网电科院，跟中国电科院、各省电科院什么关系？ 2、看公司的宣传介绍好 NB 啊，是不是满怀一腔热血的我进去就能一路披荆斩棘，成就一番事业? 3、南瑞是不是真的在外出差一年超过 300 多天，完全没有生活可言？ 4、周围的同专业同学都毫不犹豫选择了电力公司、供电局，我该不该坚定选择南瑞，签下南瑞 offer 作为保底? 现在就业这么难，要不将就一下？先签着，再去考个电力公司？ …… 作为没有背景的电气人，面临着南瑞这个市值 1000 亿 + 巨无霸，即将做出人生的重大选择，不断陷入纠结迷茫，该不该、要不要、好不好？ 有背景的电气人从你身边路过，嘴角扬起一丝微笑，心里一句：呵呵。 作为一名过来人，想告诉萌新们：可以选，但千万慎重。打工人的青春年华是最宝贵的，一去不复返。目前许多留在南瑞的人，不是不想走，是没有能耐跳出来了。老学长跟大家分享一些个人的看法，不喜勿喷，请自行忽略： 1、国网电科院号称国家电网旗下自属科研 + 产业单位，但科研能力已在走下坡路。南瑞里面很多高层领导，都自诩产业大佬，觉得自己 NB 坏了，做的都是接地气的，不玩科研那套花架子。但其实不是不想玩，是没有能力。过于自负、觉得自己 D 炸天的领导，算是一个好领导吗？由于背靠电网爸爸，不缺项目不缺钱，领导们都忙于各种 “项目落地” 事宜，无暇要坐冷板凳的科研了。最典型的就是，里面的高层领导普遍都是硕士生导师，但懂的都懂。他们根本不会在意自己学生的科研质量，因为自己就不太会呢（论文都靠买）！除了 X 院士等少数仍有所坚持的大牛。所以这些年南瑞在新能源、电力物联网、电动汽车等领域都无法再现当年电网调度自动化的辉煌，是时代变了？还是人变了？ 2、国网电科院市值高、体量大，是因为当年能人领导将大量电力三产公司合并为集团，但这么多年来依旧无法很好地解决内部斗争。公司内部非常内卷，同质化业务非常多，利益博弈非常激烈。尽管近些年一直在努力的走集团化、集约化管理道路，但触动利益太多，改革很难。当然，如果有志之士愿意参与这些斗争，抱紧某些领导大腿，也是有发展机会的。 3、如果要进入南瑞，一定要选实打实的技术岗位。不要选那些花架子岗位，比如编制可研、售前技术支持等等。最好多问问里面的有经验人士，部门岗位怎么样，再做决定。人的青春短短几年，如果萌新们确实有志于从事电网设备的研发，南瑞也算是国内为数不多的舞台了，有搞硬件的，也有搞软件的，有搞高级应用的，也有搞基础开发的。不想去小地方供电局碌碌无为一生（没有黑的意思，搞设备开发确实对个人的能力要求更高），没有别的更好去处，可以选择南瑞，苦心钻研，并为自己随时可以离开做好充足准备。 4、做电网设备的，不想出差，are you kidding？你可以年纪轻轻就去争取南瑞里面那些从不出差的岗位，但要么是有背景有资本躺赢人士，要么就是你本人还太年轻，老想毕业就退休、躺平（可能吗？）。靠写写文档、美貌身材什么的上位的人有，但终究少数。南瑞是个普通打工人内卷激烈的公司，鼓励宣传加班出差文化，所以别想了，只要你选择了跟设备调试、项目实施相关的岗位，那就当年轻多去见世面了吧，就当旅游似的。总有人适合这样的岗位。 5、工资？已经有很多答案说过了，电网的工资就那水平，不高不低。做多了项目有没有额外奖金？这只跟你在领导心目中的地位有关，领导觉得你辛苦了年终奖给你多发点，我想这在哪儿都一样。但工作本身确实会比较稳定，用里面人资的话术讲，我们有一套制度，能保证普通打工人 “躺平不可取 躺赢不可能”。 6、南瑞三大强：稳定、保护、调度自动化。也就是部分二次设备。进去了就好好混进这些小圈子，这几大业务至今在公司内部还很强势，如果去到了边缘业务一定要慎重，新行业其他公司不香吗。 7、别听 HR 忽悠什么有无编制影响不大，工资一样的鬼话了，如果编制不重要国网为什么卡南瑞名额？没有编制你都不算个南瑞人，只有极少概率通过努力最终转正（有名额），但实在可以忽略不计。 最后，普通打工人的青春是最宝贵的，但在某些人眼里就是可以利用的廉价工具而已。祝萌新们遇到好的领导。虽然很难，但还是要心怀希望不是。 编辑于 2022-11-10 15:49・IP 属地四川 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~","link":"/kewenlu2023/posts/ef9c531e/"},{"title":"逛知乎：我在体制内（九）","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 原答案：为什么体制内的年轻人都不热衷于晋升了？ 因为工作太特殊，所以匿了。 某直辖市正科，30，手底下带着几个小兄弟，基本都是躺平状态，带不动，也能理解。 先说收入，月到手 9k，公积金 5k，这几年疫情对铁饭碗影响也很大，绩效、精神文明奖、13 薪等各种杂七杂八的年底集中发的一波钱，以前加起来大概有 4w 左右，现在基本以各种名义被取消的差不多了，甚至有的名目以 “以前算法不对”为理由，从每月工资倒扣补回去的狗血情况，这收入虽然饿不死，但生活也没有太多从花钱上面找到的 “乐趣” 可言，况且物价房价都很高，该买的必须买的还是买不起。 再说工作，因为内容特殊所以不作说明，但绝不是像老百姓印象中的 “喝茶看报”，每天工作很辛苦，夜里和周末加班是常态（都是无偿），还需要经常到处出差喝大酒，总之真的很累很累，但再累每月到手的收入也没有任何变化。另外权力这方面，因为不是对外，所以没太多实际影响力，更没有 “额外” 可言（懂得都懂） 再说晋升，每个部门领导职位有限，所以年轻人上位竞争非常激烈，每个部门也总有几个一心往上猛爬的主儿，一个个都是卷王，内卷到你不敢想象，跟他们竞争就更加难，所以晋升其实普遍比较难。且职务和职级是两个概念，职级是随着工龄走的，工资也是以职级为标准发放的（本人本科，后一届有个研究生小同志，没有职务，但研究生算工龄，所以人家职级比咱高，工资比咱还多）。另外，每晋升半级，自身所需承担的责任和压力都是呈指数级增长的（别跟我说什么自己想这样，到了这个环境由不得你躺平，除非你真的油盐不进彻底摆烂，但你如果那样，大老板真的敢分分钟给你卸现职且他有那个权力），但是每升半级，收入增长多少呢？答案是每月增加二三百，副科到处会稍微再多一些，但也非常有限。晋升过程的投入与回报，完全没有可比性。 综上所述，在这个自由自我的精致利己主义社会，没有多少年轻人愿意真正拼所谓的仕途，晋升这个事儿，至少在我们这儿，既没有足够吸引人的预期收入，也没有足够吸引人的预期权力，有的只是更多的压力。 所以至少我身边的这些年轻人，尤其是最近一两年新来的，大体都是躺平状态，你要我干啥，我就干啥，好在总体素质还不错，差不多能完成交派的任务不至于有奇奇怪怪的脾气，工作质量勉强算是有保障，但他们绝不会真正自己动脑去思考如何更好的做工作做出成绩，如何通过工作和自由时间提高自己，更不会想着如何搞好人际关系如何去把领导舔舒服。 总结就是：反正端着铁饭碗，只要不犯原则性错误，只要不违法乱纪，你能奈我何？让我努力工作、努力往上升？凭什么？是多发了多少钱？还是有什么其他实际利益？这会儿领导普遍会讲些上纲上线的话，但是，你跟我讲政治站位要高？对不起那东西真不能当饭吃！ 编辑于 2023-03-12 01:02・IP 属地天津 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~","link":"/kewenlu2023/posts/d87ba66/"},{"title":"逛知乎：我在体制内（二）","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 原答案：你在体制内工作最大的感悟是什么？ 体制内六年，坐标苏南，科级单位小科员。 最大的感悟就是，原来在体制内，拼命往上爬的人占绝大多数，只想把公务员当成一份工作做的人是少数。 原来以为自己是那个随大流的大多数，没想到心甘情愿平庸的自己才是少数。 讲讲自己的经历，出生于北方一国家级贫困县，凭借一点点的聪明和努力考上 985，但是由于成绩不够高被调剂到冷门专业，大学毕业后留京打拼，起早贪黑的服务与各种刁蛮的客户，一个月只能休息一天，当时走在下班回家的路上，看见个卖菜的都十分羡慕，后来实在忍不了，辞职回家跨专业考了法硕，同年通过司考，研究生毕业之后考入公务员。 坐在我那个小小的座位那一刻起，我觉得这辈子我可以了。 我终于有了一份稳定、收入还行、不那么累不那么压力大的工作了，我太高兴了。 我每天按时完成科长安排的工作，和同事保持着一定的距离，只聊不敏感的话题，不说别人坏话，然后下班时间就各种享受生活，看书、写字、喝茶➕折腾家。 还结交了一批和我一起进入体制但是不是一个单位的公务员，各种聚会各种玩，他们讲到领导或者晋升我自动屏蔽，因为我丝毫不想晋升。 就这样过了六年，我发现好像有点不对劲了，好像以自己的资历一直是个科员，真的说出去不太好听，关键是，我心中晋升这种东西应该是论资排辈，如果轮到我但是不是我，那真的会很难受，我开始注意观察同事和朋友，发现他们对体制内这些门道真的门儿清，只有我是个傻子，啥都不知道。 我发现其实什么能力也需要培养，虽然我工作没摆烂，但是不去表现不巴结领导，我发现我已经丧失了和领导打交道的能力，我见到领导能躲就躲，不知道该如何跟领导讲话，既然不知道如何说，那我就干脆不说，其实这样领导压根不知道你做了什么工作，你有多努力，在体制内其实就是相当于摆烂。 所以我现在也开始不开心了，有时候甚至会睡不好，要知道在此之前，我好像一下班就已经把工作这种东西抛到九霄云外去了，我压根不会想起工作的任何事情，睡眠更是好得不得了，现在也开始有点不开心了。 其实我觉得一个小小的晋升，也没什么大不了，一年也就多个顶多一万块，但是就是似乎过不了内心这关，我甚至有点开始怀念起之前无忧无虑的日子了，现在不知道如何拜托自我内耗，希望有经验的朋友开导我一下。 这是一条分割线 想不到昨天晚上睡前发的几句牢骚有这么多朋友留言，其中不乏一些自动被系统删除的留言，我也搞不清我写的这篇回答有什么可攻击的，可能有很多人就是这样的？ 说说遴选，其实我身边的朋友也有遴选到市级机关的，但是我不想参加，因为在这个单位，我好像过得也还好，除了和领导说不上话之外，和同事相处还算融洽，甚至可以说已经是朋友的关系，也几乎不用加班，工作还算比较轻松。 省里不考虑，因为孩子读书买房什么的，真的太烦，市里的话，我感觉我这种傻瓜在区级都混不好，去了市里，那里的人应该更厉害，我应该更比不了吧，而且这几年感觉就像是白干了，一切要从新开始。 还有副业的话，暂时还没有想到比较好的副业，其中一个很大的原因就是因为自己太懒了，但是我对很多东西都很有兴趣，比如软笔书法，还有写作，其实有些事情看开了就好了，与其精神内耗不如另辟蹊径，大家共勉。 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~","link":"/kewenlu2023/posts/a282f04c/"},{"title":"逛知乎：我在体制内（五）","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 原答案：为什么好多人都在喊体制内的工作很累？ 21届应届毕业研究生，异地无根基，去年刚刚入职某县税务局，成为此单位唯一一名全日制研究生。 一开始工作非常积极，为人友善，每天都在思考怎么把工作做好，维系好人际关系。 工作精益求精，师傅基本上教我什么都是一遍就会了，干活也是又快又好。 过了段时间，很明显的就是带我的这个师傅，很多东西不愿意教我了，我时常没事做，反而他忙的要死，我每天上班都问她有没有事情要做。有好几次他把工作做完让我用我的账号报送，前几天写了一个函件，他写完以后让我报送，函件还有错别字，落款写的也是我的名字。 另外很多行为就明显让人感觉到只想让我背锅，而不是让我分担工作，比如他自己做好了一份工作以后，跑到我这边来让我做什么什么，我打开电脑他快速教我一遍，语速非常快，我都来不及理解，如果停下来问他（我口气非常好很客气），他脸色会非常难看，对我口气不好甚至有点大吼大叫，然后就是不肯再教一次而是让我直接报送。现在回想起来这种行为就是他对自己做的东西可能没把握，然后让我背锅。 有次市局领导让我们报送一个任务，他就是用的如上的方法让我报送的，结果出了好几次问题，市局领导也没直接找我，都是找的他。 我这个领导也未曾在分管领导前介绍过我，或者介绍分管领导给我认识。有种我要用你但是又要防着你的感觉，平时他们说着本地话，对我而言是有事有人没事没人。另外他也是刚刚调来我们部门的，什么都不会，也不懂，平时还不学，上班就是去茶水间喝喝茶抽抽烟。我请教他问题他能答的莫名其妙，被忽悠几次以后我心里也有数了。 领导可能还把我当傻子在忽悠，单位里面有什么福利一概不提，比如高速值班能补休假一天。之前我谈男朋友，他还让我找本县社会上的人，另外要求我不要进展太快，要我向本单位另外一个大龄剩女学习，他称这位大龄剩女要求非常高，一直剩着，说这话的时候这位女生就在对面坐着，我觉得尴尬，我笑了笑说了句她很漂亮。 分配的任务也是莫名其妙，我刚刚来几个月居然股室的本年年度报告让我来写了，年度报表以及分析数据也是我来写的，分管领导的讲话稿也是让我来写的，我一个刚来的懂什么啊，也是很奇怪。 我在单位不忙的时候请事假2天，分管领导不批，和我说影响转正，我真的很想和他阴阳怪气的说，你影响一下试试，我想看看你怎么影响。 这段时间新冠肺炎阳了，一开始单位规定有咳嗽，肌肉酸痛，发烧等新冠肺炎症状的就需要居家隔离，我在居家轮班的那几天（第一周周四周五）上报领导，然后到了周六我舍友发烧，我虽然当时没有马上发烧，但是我依旧症状明显并且按照单位规定舍友阳了我也要被隔离，我就请示了一下领导。结果我领导硬要求我去上班，即使我周一头疼了一天，周二头疼又咳嗽了半天，至到周二下午我才真正发烧，回去休息。期间这个领导还说什么即使发烧也要来上班。 其他同事可能看我热情努力，有部分想办法打压我。有个同事一来就各种试探我的能力，搬弄是非胡说八道，问东问西，明白我是个威胁以后拉小群体孤立我，但是其他同事没跟他这么干，我看见他基本上都不正眼瞧他。现在他发现我不好惹，也收敛很多了。 总结一下就是，工作本人有心无力，同事领导让你背锅。 现在彻底躺平了，前几天测出来是中重度抑郁焦虑，轻度强迫症。 家里很远有事领导也不肯我请事假，说我上班不积极，这几天有项工作，他休假没做，也没让我做，之前还说我做的不好他自己来，结果一到休假他居然倒打一耙说我没做完工作。不是你不让我做的吗？ 懒得和他解释了，一切都有留痕。准备转正以后去医院打个假条好好休息了。 今天，人事找我说我科室七月份考勤不对，我顺口说了句七月考勤表不是我做的，我九月头才来这个科室，然后这个领导就说什么让我别急着推卸责任，请问都不是我做的，我哪来的责任怎么推卸？ 谢谢各位的关心，原来这么多朋友支持和鼓励我，着实很感动。系统删了不少朋友的留言我没看到，非常可惜。 今天2月21日，目前我的情况还好，渐渐接受现在的状态了，我现在很佛系，工作有事我就做，没事的话我就练练字，另外学习执法资格考试，考试我也没有很拼，慢慢来，慢慢考，及格即可，既然以后要考走，也不想太卷了。 偶尔心情也会反复，但是基本上都能自己调节过来，身边两种人，一种是嫉妒我想踩着我往上爬的，此人考了非全日制研究生，而单位一把手明确说了不认非全，所以此人一直在试图拉帮结派想排挤我，工作上也处处喜欢抢我风头，比如来了个纳税人咨询我问题，我还没回答他就开始抢我的话，明明他自己也不懂最后还是别的同事给他擦屁股。这种行为非常幼稚，无聊，平时也经常能听到一些尖酸刻薄背后讥讽其他同事的话语从他嘴里出来，一名男性还这么做足以可以见心胸多么狭隘。另外一种就是想办法给我挖坑的，比如我的这个师傅，现在已经好很多了，他也明白我工作都在留痕，自保。 编辑于 2023-02-21 16:02・IP 属地广东 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~","link":"/kewenlu2023/posts/372f8f3c/"},{"title":"逛知乎：我在体制内（八）","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 原答案：如何劝男朋友不要考部委公务员？ 在职部委公务员，出差途中，在高铁上无聊，刷到这个问题答一下吧! 先说结论:，非常不建议来部委。 首先，很多人考部委，其实是奔着将来能分房子 (分是分，但首先你得熬到副处级以上才有资格参加分房(注意不是分到，是有资格而已）——俺都进来7年了，一级主任科员，分房仍遥遥无期……就算排到你，也不是白给你，是要拿钱的，价格从以前的几千元一平到这两年已经过万一平，听说现在在园博园附近建的那个中直机关小区，分的时候价格将达到1.9万/平! 这跟之前几年分房的价格比高的太多了，家庭条件稍差点的买怕是很吃力了。 而且各部委分房子平均等待时间基本都得将近十年。 再说分到了也是共有产权房，不能出售) ， 而你们俩已经买了房子，这点好处对你们来说就没啥意义了。 再说前程，你男友主要是奔着这个想来。其实对于一个没有啥背景的普通人来说，在部委真的没啥大前程可言，其中少数特别优秀的，也就干到处长顶天了 (至于司长、副司长，那可不是我等普通人能够得着的），而处长在部委啥也不是，就是带头干活的。绝大多数人一辈子干的都是虚职，部委唯一好处是职级的天花板高，如果不是那种人太多竞争特别激烈的部委，大概率能熬到二巡退休，就是地方上副市级那个级别 (本人很不幸进的就是大部委，七百多人，估计二巡没多大希望，保底一调吧！）。 你男友去了之后，按照他的年龄估算，如果是研究生毕业的话，考虑在央企的工龄，顶多定个二级主任科员(转正一年后才定级，二年晋一级）。 说到收入待遇，按题主介绍的你们俩的收入水平，恐怕是金融央企吧？你男友如果来部委那就亏大了，前面说过，他最多能定二级主任科员，每月工资收入最多也就8000多不到9000，而且，部委没有年终奖，只是每年1月有个第13月工资。 所以他如果进部委收入会减少2/3还多，要还不起房贷了。 再说工作状态，绝大多数部委都非常忙，忙得让你怀疑人生: 每天8点上班(央企应该是8点半或9点) ，租的房子在远郊的，你最晚早上6点半就得从家里出来挤地铁。每天都加班，晚上8点下班是早的，常常要干到10点11点。 周末有时还要加一天班。留给家庭的时间几乎完全没有，将来你俩结婚后家里的事他是啥也指望不上。 综上所述，我认为，你男友如果真考进部委，百分百会后悔。 我如果是他，打死我也不会放弃金融央企来跳部委这个火坑。 (我研究生毕业那年也不知道抽了什么疯，非要留京，可我学的专业进不了金融行业，而我家的家底连五环外首付也拿不出，所以也只有进部委等着分房。不过如果现在让我重新选，我宁肯去个二线城市呆着，也不想遭这个罪。) 编辑于 2023-03-20 10:40・IP 属地辽宁 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~","link":"/kewenlu2023/posts/774a9b39/"},{"title":"逛知乎：我在体制内（六）","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 原答案：人才引进进入事业单位的人才们，有多少人后悔了？ 此帖终结，离职了。去济南重新开始。 在 2022 年的最后一天写下这个回答，也算是对工作这几年的一个回顾。 武汉某 211 本毕业，山东人，人才引进到邻市区直单位工作，至今已经三年有余，同时我的年龄也已经 26 岁了，过完这个年马上 27 岁。 总体而言，对于这个决定是后悔的。 一是工资待遇低。很难想象，工作三年到手工资连 5k 大关都没突破，甚至还不及我刚毕业的时候在青岛企业的到手工资。去年和大学室友聊天，他的年终奖已经快赶上我全年的到手工资了，要说不羡慕那是假的。很多时候我都在想，这四千五百块够我干什么呢？父母要是生个病，我有能力去照顾他们吗？以后结婚了，能让妻子小孩过得好吗？很显然，答案都是否定的。 二是人际关系复杂。曾经大学的时候也读过《中县干部》，深知在闭塞的小地方是最讲家族政治的，但真正面对了还是大吃一惊。你单位里的这个哥，和其他委办局的那个姐，指不定就是什么亲戚。等你看到领导干部的家庭成员关系表，往往会发现的他的亲戚遍布于各个单位，上到市直下到乡镇街道。对于一个异地的毫无关系背景的人来说，只能说谁都得罪不起。 三是上升渠道窄。普通地级市的区县，单位基本都是正科级，甚至有的单位仅仅是副科级。可以很明确的说，我这辈子的都不会当上单位的领导，当然我也并不想当什么领导。提拔使用，是公务员应该考虑的事情，事业编说白了只是打工的罢了。这三年，一直干的是类似于办公室的工作，各种各样的杂活碎活，对于个人的能力成长可以说是没有任何的作用。 我也一直在复盘，是什么原因导致我最终处于这样一个进退两难的处境？ 父母和我本人的短视。当我在青岛的时候，我看到青岛的高额房价和我的工资单，我退缩了，我认为我这辈子都不可能在青岛有立足的地方。当时的我迫切的想找到一个一劳永逸的地方，一个工作上比较有性价比的地方。父母是 60 年代的人，他们幻想中的体制是一个社会地位高、福利待遇好的地方，说实话他们并不能为我指引什么方向。就这样，我报名了某地的人才引进，进了体制内。 个人规划不清晰。体制是一条单行道，进来了就很难跳出去。在这里面你只学会了怎么写那点材料，怎么组织个会议，这些能力说实话再到体制外是不适用的。我现在时刻在关注各类国企的招聘信息，很遗憾，适合自己的岗位非常的少。 执行能力差。和自己的惰性做抗争是非常痛苦的，但是要想跳出去就必须要做抗争。这三年我的日常生活，就是在工作、加班、备考中度过。有时候加完班回来，脑子里想的是再学一会习，但是身体却躺在床上一动也不动。有时候好不容易有个周六周日，但是却一点也不想学习。 27 岁了，然而工作还是没有稳定下来，父母催的婚恋自然也无法开始。我知道未来要么在济南青岛，要么在老家，用三年时间想明白以后的道路，这个代价不可谓不沉痛。过完这个年，如果还是没能实现骑驴找马的规划，我打算辞职了，敲定一个城市，安定下来，不论是体制内，还是体制外，毕竟确实没有什么时间了。 编辑于 2023-02-26 10:51・IP 属地山东 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~","link":"/kewenlu2023/posts/5221c4e5/"},{"title":"逛知乎：我在体制内（十），加班","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 原答案：军工研究所加班问题求问？ 这行真是表面光新。 我外面面试，面试官都不理解，航天军工这么好，为什么非要跳槽出来。还反问我：是不是你跟领导关系处不好，是不是跟同事关系不好，别人都羡慕你，你还想跳出来，你说的我们都想去了。 我告诉你航天加班是因为啥。 手机里的一个文件需要打印，从手机传到办公电脑。在非涉密单位，你只需要连上无线，登录微信，文件传输，电脑打印。使用完毕扔垃圾桶。 在涉密单位，你需要以下几步： 在办公电脑提一个上传申请，等待部门领导审批通过； 拿着一张空白的光盘，拿着员工卡，去一个单位仅有的一个互联网机，将员工卡发到上网读卡器上，在本子上做好上网记录。 在互联网机登陆邮箱，下载你要打印的文件，刻录到光盘。 将光盘拿到文印室，通过中间机杀毒，工作人员将文件导入办公电脑。 将文件进行加工，如果在原文件增添了涉密信息，这事就复杂了。在办公电脑提交定密打印申请，领导审批定密，去文印室打印。 拿着身份证到文印室打印输出。 使用完毕后要提交清退流程，领导审批 每周只有一天可以清退，所以也需要排队。 这只是打印这一个小小的环节，外面 1 分钟，航天军工至少一上午。 同样的工作量，因为这些繁琐的流程，对于单位来说，涉密规定，不得不遵守。但对于员工而言，体验度极差。 再加上 xp 的系统，office2007，十几年不换一次的全国产化办公设备，将员工的加班时间又无限放大。 一个电脑，开机需要半小时，点一下鼠标，转十分钟。要是非涉密单位，自己的办公电脑太慢，一怒之下，哪怕自费换新的，加内存都是可行的。但是军工涉密单位，你的电脑慢，只能忍着受着，你也换不了。 国企里所有的官僚主义、形式主义、表演式加班，航天里都有。加上涉密单位独有的繁琐流程，几乎与世隔绝的工作环境下形成的眼界、思维，对一个人认知的局限在是难以想象的。 里面还在用 xp，外面的世界已经连 win7、win8，win10 都不用了，新电脑直接使用 win11 系统了。这不是技术发展太快，而是航天主动选择拒绝融入时代。 在那一亩三分地圈地自萌，加班时间只会越来越长，永无止境。 编辑于 2023-03-31 23:50・IP 属地北京 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~","link":"/kewenlu2023/posts/3950458c/"},{"title":"逛知乎：我在体制内（四）","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 原答案：我想辞职公务员，矛盾中？ 我自己。 一开始做得程序员，一个月两万左右。 后来觉得在一线城市漂着买不了房，看不到未来，就回老家了。 老家沿海的县，找不到程序员的工作。开始做电商，帮人做店铺、做渠道，一年能比以前程序员稍微挣多一点。 后来 20 年初，疫情原因闲了几个月，觉得得稳定一点，考了县电视台。 进去之后才发现扯淡，天天跑外面拉光缆，立光交，半年不到晒成黑鬼。经常下班了因为机房有报错被喊回去。就这，一个月基本工资两千五，月奖一千，年终一万。 劳动和报酬严重不等价。唯一提升空间是做主任。可我看部门主任也天天各种出去跑，我做十年，也最多做到他那样…… 最可惜的是，我考事业编的时候，曾经有个同学，做医护用品的，想趁 20 年的风口挣一笔，拉我去跑渠道，那时没去，错失了二十几万。 做了半年我从电视台辞职了。同时去问了十几个做公务员的同学，大致明白薪酬之后，不准备再考。 我们这县级市，并不算落后，房价 2w 加，我没家庭背景，去做公务员没出路。 不过也有个收获，20 年下半年，我和一个朋友合伙做公考培训，半年多的时间，就挣了十几万。考公魔障的人太多，这钱特别好挣。 现在还是做回电商，打算跑跨境的渠道，要学一大堆东西。 更新一下吧: 评论里很多问题，原来的回答里就有答案。 一开始做程序员，虽然月薪两万，但是很辛苦，在外包公司做安卓 app，基本吃住都在公司里，比 996 还惨。整个开发部门十几个人，十天左右就要出一个 app。可想而知压力多大。即使套皮做程序，时间都很紧张。能拿两万，是因为给老板创造了大于两万的收益。 后来做电商，是因为我们这县城，找不到程序员的工作，要么去制造行业，去一线车间。要么来钱快就得做电商。我做的不是开店卖货，而是给一些中小商家开店、做活动、拉销量等，有的是一口价，有的是提成，比以前做程序员好点，朝 9 晚 9，一年多时间赚了三十左右。 后来考电视台，是因为疫情影响收入，再加上亲戚推荐说电视台有 7k 左右。去考了，也顺利考上了。结果……7k 是: 主任级别 + 中级职称 + 二十年工龄，才有的待遇。新人也就三千多。那些临时工更惨，工资一千四，还得抽去几百交社保公积金之类，月奖也只有八百。（最让我受不了的，是有个小姑娘进来半年，临时工，啥都不会直接就中层副职，还有个小姑娘 19 年进的，现在已经是下属集团副总） 呆了不到半年辞职了。 也去打听过公务员。最后还是放弃了。一是不喜欢单位那种人际气氛。二是我觉得自己没背景，进去了完全没有议价权，一切的都是领导说了算。进去了就是做螺丝钉的。 虽然我看了很多马列，但是进入现实我也得朝钱看。一进社会，就能感受到那种压力。没有养老金的父母，自己将来结婚可能要买房，稍微买个好点的车也得十万，如果有孩子开销更大，我不想连产房的钱都出不起。以前我也觉得只要躺平就不会被剥削，但是出了大学之后，我才知道没钱寸步难行。普通人根本没法躺平。 做公考培训，是在事业编考试的时候认识的人。那天去早了，早到了两个小时。坐车里玩手机，有个年轻人来发传单，比我还小两岁。因为没人就聊天，后来加了微信，隐约知道了做公考培训很挣钱。电视台辞职后发了条朋友圈，这个人回了，让我去一起做培训。细节不详说了。 现在，不上班，手里有钱能让我有底气学习一段时间。学了一些招投标的东西，以及报关、通关和国际物流这些。有空就去各种认识不认识朋友的厂里，看看现在什么热门，主要是脸皮厚。曾经被保安赶出来过…… 有些厂是真的能看见未来几年必定挣钱的，比如有个做光学材料的厂，可惜门槛太高我做不起。 编辑于 2021-09-25 01:49 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~","link":"/kewenlu2023/posts/58b14a7b/"},{"title":"逛知乎：是不是腾讯内部的贪腐比国企还严重？","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 原答案：是不是腾讯内部的贪腐比国企还严重？ 干过干部保健，照顾过各种档次的老干部，基本排名是离休的最厉害，固定床位固定医生，实报实销，去医院一坐就有人来服务，只需要抽血的时候伸手就可以，护士也不整那些什么找血管的幺蛾子，一针下去必然见血 我作为一个在央企省级单位工作近 10 年的人，对于所谓贪腐这种东西，真觉得无论国企私企，只要领导控制了资源，还能两袖清风，概率极低。 其实很多人压根不知道贪腐是怎么一回事。都是按电视剧的剧情，一个豆腐渣工程的老板，拿着一沓钞票装信封里，塞给领导行贿。实际上绝大多数哪有这么傻，或者有必要这么操作吗？ 真实的情况是这样子的：公司立项要搞一个项目，预算给了 200w。然后招投标，无论谁中了，为了之后工作顺利开展，以及明后年别的项目，这 200w 里面最少得拿出 10%-20% 给甲方相关拍板者和管理者。如果是个中小公司，层级简单，自然这些拍板的人和管理的人就是老板，公司就是老板自己的，当然不存在贪不贪的问题，你给我回扣有啥意义，直接砍项目金额完事了。但是一个超大型公司，通常这种拍板的东西别说最大的老板了，连管理层其他领导对细节都不是很清晰，只要在预算范围内，你能完成任务就够了，这项目到底是 200w 能完成还是 160w 都可以，大老板也不是那么清楚。所以能够向管理层汇报申请项目，拿到项目预算的人，理所当然可以吃了这笔回扣。 所以现实情况不是说某些人收了贿赂，然后就让一些豆腐渣工程进来。而是无论谁中标了，这钱乙方都得作为 “业务费” 花了。否则后面合作过程中，人家那边各种不配合，各种挑毛病（毕竟甲方有这个主动权），到时候各种理由扣乙方项目款，那你乙方咋整？如果乙方把甲方那边管事的领导给安排妥当了，这下变成甲方的小兵得老老实实干了，敢跳出来找事的话反倒是侵犯了甲方管事领导的利益。 现在有几个点得说一下： 1、那做出来的东西是豆腐渣怎么办？首先大型超大型企业不会和一些不知名小公司合作，能进他们招标范围，或者长期合作方就那些。所以如果搞出个豆腐渣工程，对这些承接项目的公司长期利益也不好，毕竟跑得了和尚跑不了庙。 2、如果工程必须确保质量，那只剩 160-180w 的钱够花吗？我可以告诉你就算没有那回扣，纯 200w 给到承接的乙方，做出来的东西也不会比拿了回扣的强多少。因为乙方老板不会因为你没拿回扣就提高自己的用工成本，只要勉强能做出个应付过去的东西，你不吃回扣这钱就是乙方老板赚了。如果报价低于项目成本价，那么就是乙方老板自己得想的事情，要么不抢标，要么就期待着先占了坑，以后别的项目合作中再捞回来一些。而作为甲方那边负责申请项目的领导，肯定也是千方百计希望把项目往大的吹，多拿钱，毕竟钱多了他才有机会多吃回扣，多刷政绩。所以现在大家明白为什么到了领导层面基本都是搞 ppt 和假大空的东西。 3、这种情况能不能防住？不能！只要企业或者单位大到一定规模，层级较多，控制的资本金额又非常巨大，无论是国企私企还是体制内，这种情况都很难避免。首先层级多，就注定了上面的人想管也管不了那么细，只能抓大放小。你能在之前预算的范围内完成，没有超支，该完成的任务也完成了，那就行了。其次控制的资本金额巨大，比如说批一个项目动辄百万千万的话，就算吃个 5%，这数额都很巨大，这种回扣才有诱惑力。如果一年到头就是那么一万几千找个乙方公司给你干点事那种，当然吃不了多少回扣，冒着被开的风险吃个一百几十的回扣吗？之所以一直都是说国企、体制内这情况比较多，因为以往民企就没有那么大的规模啊。现在一些大型民企控制资本的规模，还有内部层级甚至比一些大国企还厉害，自然这种情况就出来了。 =================================================== PS1：吃回扣套利这东西本身就是广泛存在。比如大城市停车难，找个月保停车位还得给保安送烟，订团餐、公司组织团建什么的肯定都广泛存在套利空间。说白了除非老板什么都一手抓，否则下面拿了钱去干活的一定有空间套利，当然套利的空间和风险是个问题。有些人套利空间是几万几十万一笔，有些人套利空间是一包烟。 PS2：风险才是最大的问题。回复里很多人讲的什么老板自己掏空公司跑路，业务员倒卖公司一些资料之类的。这种通常风险都很大。基本赚一两把你就得跑，不然迟早东窗事发。这种和我说的心安理得收个十年二十年回扣的风险根本不是一个级别。这种心安理得收回扣是各方利益的深度绑定，只要没人跳出来破坏行业默认的规则，就是皆大欢喜的情况，谁干跳出来破坏，那也是鱼死网破自己也好不到哪去。 编辑于 2022-12-25 12:53・IP 属地广东 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~","link":"/kewenlu2023/posts/5d6295b/"},{"title":"逛知乎：研究生导师讨厌什么样的学生？","text":"原答案：研究生导师讨厌什么样的学生？ 文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。逛知乎：研究生导师讨厌什么样的学生？ 首先声明有虚构成分，拒绝对号入座。知乎里啊，主体用户是学生，高赞的那些答案居然都是学生写的，还有些外行人的臆想。 表明身份：某大学教授，事业在上升期，论文比较好，有自己的实验室，实验条件也比较好。我自然是希望能收到脾气对付，能力好的学生了，能够互相成就一番事业。 带了好几届学生了，加上替别人带的，还有对别人的学生比较了解的，见过几十个学生吧，也有了一些经验。我知道知乎上大部分都是学生，我说的有些话你们也别不爱听，反正我也匿名了。 总的来说，大部分学生品性在根上都是好的，但普遍也都有各种各样的毛病，作为老师的责任，就是发挥学生的长处，培养学生的专业能力和良好的工作作风，对于学生的各种小毛病有指导和批评的责任。这个小毛病基本分为两种，一类是专业知识上的结构性欠缺，另一种是思想和作风问题。虽然不太准确，按照我指导过的学生，大致来说，可以分为如下几类： 游刃有余大神型。这种特别难遇到，几届都不一定有一个，大神什么意思就不用多解释了，重点说下啥叫游刃有余，那就是除了交代的科研任务，还能自行的延伸拓展，而且是出自内心热爱做的，到了后期很多技术细节和发展的方向比我还好还全面。而且这种对于技术全身心投入的和我对脾气，很好相处。能遇到的那真是缘分，人家那么优秀那肯定不是因为我培养的好，而是人家父母和过去的老师们给培养出来的。 个性强烈大神型。这种不是说一入校就是大神，而是说非常有成为大神的潜质。包括上一个类型的，本质上刚来读研的时候，相对于我的知识和技能，那就是小白，只是在同龄人里面相对的优秀和突出。你们不要和我犟，本校的最顶级的本科生我也都带过，我当年上学的时候就是你们嘴里的大神，而且我毕业后又修行了十几年，所谓牛逼本科生到底啥水平我非常清楚。这种学生吧，技术和知识都没问题，主要是个性强烈，觉得自己牛，有一套自己的技术思路和作风，就举个这么个例子啊，他一入学就知道 1+1=2，但是你告诉他 0.5+1.5=2，3-1=2，1.1+1≈2，他就绝对不认可，非要逼得你承认只有 1+1=2。要是遇到一个能包容他、在技术上做好指导引导、在做事做人风格上能劝导他的好老师，那就能发展的很好，最终能接近 1 型；次一点的，遇到个佛系导师，自己也能痛快的度过几年研究生生涯，最后毕业的时候洋洋得意的说，我老师什么都不会，也什么都不指导我，我有今天的成绩都是靠我自己学习奋斗的；差一点的，遇到个不会业务又四处什么项目都接的，那这种大神和导师之间可就难相处了，充满着压迫与反抗，学生就会说这个 SB 老师，明明该这么干，他非要我那么干，老师就会说这个学生真难用。 野心勃勃计算型。这种多见于小学校保研大神。反正都匿名了我也豁出去了，不怕地图炮得罪你们这群学生。很多双非的本科学校（无所谓你们争辩的一本二本）保研政策非常的扭曲，除了学习排名之外，什么科技竞赛倒也罢了，三下乡，论文，党员，班干部，学生会干部，参加活动，等等，都要加分。最后学习成绩第一名的，往往保研不成。能保上的，都是那种学习前几名，又攒了一大堆材料的，什么竞赛和社会活动一大堆，可能有十几项都不止，简历非常的吓人。 我一开始不知道现在的行情，收了些这样的学生才知道，这种学生是让人又爱又恨，非常考验老师的领导能力。因为啊，人的精力都是有限的，都用在学习上了，竞赛就弱，社团活动就弱，起码我们学校是这样的。那些小学校的保研大神，只所以成绩还好，简历还可怕，那是因为充满了计算和优化，对着保研这个目标函数，把时间和精力（甚至还有金钱）那是发挥到了极致，选课的时候一定要选老师给分高的，学习的时候不求理解知识但求考高分技巧，至于竞赛和社团活动那是能蹭就蹭，把投入产出比那是计算到了极致。 所以到了读研阶段，本科那一套不管用了，因为研究生要做深入的研究了，八面玲珑四处求雨的做法不好使了。他们这种功力型的选手，就开始寻找新的目标函数，比如说啊，要是安排的课题还好做，还能快速的发论文，他们就会爆发出非常高的战斗力，而一旦发现课题吃力不讨好，就会开始磨洋工另寻出路。 我说的可能有点过，因果关系也可能有点牵强，但是不可否认这样的情况绝对是不少见的。这种孩子吧其实也都是好孩子，也都是积极向上的，就是以前穷怕了，就看老师怎么引导。引导的好也是能接近 1 型。 中规中矩听话型。顾名思义，这种类型不多解释了，也是最多的。我其实很喜欢这种，但凡是中人之资，只要是人品良好，勤奋好学，我都负责到底，给安排好的学习机会，毕业的时候都有着好的成绩和出路。 ———– 不太喜欢的学生类型的分割线 —————– 无欲无求躺平型。这种也顾名思义不多解释了，最高诉求就是拿个毕业证。和 4 型有一定接近，有时候也互相转化，但也不一样，这种是叫干啥都磨磨蹭蹭不爱干，所以也干不好。人各有志按理说我也不该强求，只是我这种事业上升期的年轻老师就不该和这种搭配，所以不太喜欢。 另有事业过客型。这种也特别有意思，不仅是我的学生，包括我的同学，朋友，也有这种类型的，他们在另一专业领域有专长，或者有明确的诉求，来读研不是为了学习导师的专业能力的。比如有的学生来了工科专业，目的非常的明确，复习了几年考公，最后如愿以偿考上了，科研任务那是能混就混；再比如有些强人，自己年纪轻轻本科毕业就已经开创业公司了，一边应付着老师给的任务，一边忙着自己的公司业务。这种也是人各有志，我只能说也特别的不适合我，适合放羊型导师。我招生名额有限，招来这种算不上累赘把，也基本上是废了我的招生名额，对我自己的科研没什么帮助。 志大才疏抱怨型。这种啊我还不算特别烦，两个原因：一是内心还是向上的，二是不依赖别人还是想靠自己。虽说当老师的工作任务就是教给学生本事，但是有些学生就是教不出来。有很多 4 型的虽然基本功差，但是勤奋刻苦，学习方法得当，毕业的时候还真有了很大提高。但是这种 7 型，要么是思维方式和本学科不符，要么是学习方法就是改正不过来，有的是眼高手低，反正就是怎么也教不好，他又非常的雄心壮志，想要的论文啊奖学金啊之类的总也拿不到，久而久之就开始怨天尤人，在别的方面找原因。 精明算计搭车型。这种是我最讨厌的，这种和 3 型有一点本质的区别，那就是 3 型能自己搞定任务，而 8 型则想空手套白狼，去蹭别人的成绩，甚至是想着占有别人的成绩。恶劣一点的啊，甚至想着靠拉关系送礼那一套去吃定自己的同学。这种身上充满了满满的负能量，就算是对他付出一片真心想叫他自己学点本事，他也会自以为圆滑高明的告诉你，因为种种客观原因和不可抗拒力，这也没学会，那也没学好，完了还想着论文专利奖学金，等等的好事。遇到这种除了长叹一声，还得想着法子送毕业让他赶紧滚蛋走人，还能干啥呀。 各种不正常人类。这种我还没有遇到过，看见别人遇到过（包括在兄弟院校见到的），那可真是。。。倒了八辈子血霉！比如某些 “大神”，天天神龙见首不见尾，或者宣布自己有各种生理或者心理上的疾病，然后家长还天天给老师打电话，要求老师对他孩子的病情负责。还有些更奇葩的，到处劈腿乱搞之类的，最后女方都打到实验室来了，在那骂渣男，老师也十分的尴尬。还有些心术不正的瞒着老师瞎报账的呀，甚至有传说生化环材类的有些学生在瞒着老师合成一些不可说的东西（在国外留学时候听说的），诸如此类。 以上不是绝对的，也不能给学生贴标签硬分类，对于绝大部分学生来说，都是以上的混合体，所以请老师们同学们不要对号入座。作为老师呢，我觉得绝大部分学生都是好的，有着很多的优点，但也都不可避免地有或多或少的缺点，优点该鼓励鼓励，缺点该批评还得严格批评，就是这样。 ———————————分割线——————— 我再说说一些知乎上关于研究生和导师的话题，有着非常不好的风气，那就是编故事写爽文。在故事里面，导师们一个个化身为大魔王，不学无术，对学生颐指气使，然后学生们凭借着自己的勇敢机智和过硬的业务能力打败了大魔王，各位看官看的是热血澎湃。愚以为啊大家看看就好，现实中这样做受到伤害最大的还是学生，你们的业务水平真的没你们想象中的好，大家来上学主要目的还是为了学本事的，只要能学到真才实学，其他的各个方面就互相多体谅吧 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu2023/posts/70f9dd93/"},{"title":"逛知乎：科研的本质就是一堆人炒概念？","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。逛知乎：科研的本质就是一堆人炒概念？ 原答案：有哪些东西是你读博士以后才懂的？ 科研本质就是一堆人炒概念。一个圈子的人一起骗国家经费。 很多新的概念其实是几十年前做烂的东西改个高大上的名字，包装，炒冷饭。 所谓多学科结合就是一个领域搞不下去了。把另一个领域的东西加进来，排列组合，继续灌水。 学术圈典型的劣币驱逐良币。真正十年磨一剑搞科研的人过不下去了，灌水炒作发流水线文章的人过得很舒服。 学术同行间流行互相鄙视，甚至一个课题组的成员互相也会。 科研人员应该有个更合适的名字：论文写手 师兄师姐本质就是同事关系，要把他们当作资源好好相处。学会利用，有时候别人一句醍醐灌顶的话可以让你少走很多弯路。 所谓审稿人就是同行。当自己的文章被别人审时天天烧香祈祷别人网开一面，当审别人的文章时，化身恶魔重拳出击。 论文作者挂一堆人，有实质贡献的一般就一作 投稿好期刊如果通讯作者不是大牛，你的文章大概率可能被编辑毙掉，见不到审稿人。而如果碰巧你的老板就是某个期刊的副主编的话，你会发现投这个期刊会很顺利。 大部分论文根本不可复现。修改数据或直接造假成本太低，收益太高。试想一个博士生辛辛苦苦做了一年的东西，他会因为最后一步的实验效果不好而放弃这些付出吗。导致的结果就是改数据。稍微有点良心的，做十次实验选最好的一次，胆大的便直接操作数据，高明一点的手段，审稿人很难看出。 学术会议的目的就是社交，没人会老实讲正在做的东西。傍上一个大佬就是赚到。 导师只懂他博士做的东西，早已经远离一线科研，新博士切勿听老板画饼和傻傻等待老板给 idea。自己做主是真谛。 科研如果没兴趣，会过得很痛苦。 科研只是生活的一部分，祝大家漫漫学术路愉快！ ———————————— 没想到这个回答的关注度，居然是我所有论文引用数的好多倍。唉～竟有点心酸呐。写这些不是想攻击谁，毕竟大部分就是混口饭吃，我也是其中一员。只是看不惯那些揣着明白装糊涂的人，想撕开伪装的面具（虽然没用）。在这里继续补充一些个人想法。 科研（学术) 本身没有错，即使没实际用途，能提供新的视野和见解也是有益的。遗憾的是，大部分文章离这相去甚远。 不要轻易相信论文结论里的东西和大佬在讲座上侃侃而谈的东西。如果他们说的都是真的，人类早就离开太阳系了。 做真正科研需要理想主义者。但讽刺的是，理想主义者不太适合这个圈子，除非你能力极强。把搞科研当做养家糊口的生存手段，一切会释然。 博士群体是一个无限放大人与人差距的地方。你可能读了四五年，快 30 岁了，手上只有可怜的一篇低分 SCI, 毕业遥遥无期。而比你小好几岁的师弟师妹，可能第一年就成果多多，国奖拿到手软。 不同领域，天差地别。有的方向，影响因子十几的期刊只是别人灌水的。而有的方向，行业顶刊影响因子不到 5。可怜的是，找工作时，你往往要和不同领域的人一起比较。 一个好的导师可以当你在学术的森林打怪升级时，背后默默给你助力。而一个垃圾导师意味着，你每天科研已经很累了，回家还要忍受他（她）的 PUA。 导师的工作理念大概分三类：遇到能指导学生的导师是上辈子修来的福分。遇到完全不管，放手让学生自己做的也正常。最可怕的是，导师啥也不懂，还要瞎指挥，俨然一副老子天下第一。 如果你已经决定一辈子从事学术行业，你以为博士毕业是解脱，却发现仅仅是拿到了入场资格。 学历与人品从来没有关系。博士里面烂人奇葩很多，读书读傻，以为地球围绕自己转，情商极低的人有的是。等这些人媳妇熬成婆，拿到了高校教职，他们就成了新的 “变态导师”。 读博的不易只有经历过的人才懂得：曾经的好友同窗，基友闺蜜，早已结婚生子，渐行渐远。每天陪伴自己的，是枯燥的论文，是冰冷的数据，是老板的喜怒无常，是审稿人的不屑，是亲戚的‘拷问’，是看着朋友圈里的阖家欢乐，却还独自忍受在冰冷的实验室补实验的孤独。看着日益增长的年龄，日渐掉落的头发，你渐渐开始孤立自己，抵触社交，拒绝聚会，难受时找不到人倾诉，只有当夜深人静时在被子里偷偷抹眼泪。如果你实在坚持不下去了，退出就好了，这里不是什么神圣殿堂，此处不留爷自有留爷处。不要去做傻事，别被执念束缚！ 祝大家顺利。 （看着三天之内这么多点赞收藏，没想到在知乎让我第一次体验了发表‘高被引’论文的感觉。下面是另一个相关问题下我的一个更全更精炼的回答，里面几乎包含所有我读博士以后才懂的东西。就像发跟风论文一样，我也得蹭蹭自己的热度！） 为什么越来越多博士逃离科研？ - 知乎 https://www.zhihu.com/question/291597382/answer/3097617160 编辑于 2023-06-30 19:10・IP 属地中国香港 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu2023/posts/cf465a2b/"},{"title":"逛知乎：程序员再就业，书法老师","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 原答案：今年失业的程序员兄弟姐妹们，你们都去干什么了？ 37 岁的后端程序员，php 和 python 搞了十来年吧，去年失业，已经在大深圳躺平了。 计算机已经卷得一点性价比没有了，三四年前行业膨胀的时候，是个人都可以进来，三个人干一份活，后面一直降本增效，现在哪个大厂不是一个人干三个人的活，一个盖子要盖三个壶。我离开的时候，一个人要负责维护四五个项目。这个年龄找也是外包，要被那些小年轻 pua，加班也加不过他们。工作也不好找，我上一份工作做了五六年，再找工作，算法八股得刷几百道，这东西很烧脑子，我有这个精力，放在书法研究上，估计中书协证书都拿得到了。 今年在小区下面的底商培训机构找了一个书法老师的工作，书法是小学到大学的爱好，毕业后工作忙也撂了十来年了，从来没想到会靠书法这个手艺来恰饭。 比跑滴滴跑外卖强一点，一周是 16 节课，八个班有 180 个学生，一般是晚上和周末有课，白天没什么事。下午 5 点去幼儿园把娃接到班上，他没课就在我的课上写字，有课就去上其它培训课。现在做得还算不错，学生每天是爆满的，反正我做事情向来是又完美又认真的。 钱是少了些，好在没有每天把时间浪费在上下班的公交车上，工作内容比起以前 996 还是太轻松了，不过天天在家，家务做得多，每天在家里做饭菜，钱赚得少了也偶尔和老婆吵架，每天在学习，等经济形势好一点再做打算吧。 一年后等娃在深圳上完幼儿园，打算退回长沙，去长沙继续搞书法培训算了。 编辑于 2023-05-26 13:05・IP 属地广东 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu2023/posts/5bef466d/"},{"title":"逛知乎：第一代移民的烦恼","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 原答案：匿名说说你最近的烦心事吧? 很想回国定居，但又身不由己。出国从留学到工作定居一晃眼十五年有余了，当年出来时还是少不更事的 19 岁少年，如今已成为中年大叔。我是独生子，家在某二线省会，我从小性格内向敏感，而我妈这人性格强势，当年我出国是她安排的。但在这边我过得并不那么开心，十年前曾经有跟我妈流露出回国生活的想法，被她极力反对，当年一起来留学的同学早也走的七七八八了，时常会觉得孤独。 我孩子 2019 年出生，再后来疫情爆发，我和老婆孩子一家人整整三年回不去，孩子出生第一年，父母过来照顾孩子，疫情缘故，被困在这边回不了中国，帮我带了一年的孩子。但是看得出，我爸妈其实很不习惯这边的生活，嘴上说着这边好，身体却很诚实，后来还是因为我妈签证到期续不了才让她们回中国的。 去年实在想家，11 月一家三口回国了，一家人机票就花了 3 万人民币，哪知道没多久中国就疫情完全开放了，机票也降价了，冤枉买了那么贵的机票。我在国内待了一个月就又回来了，毕竟还得工作，老婆孩子目前还留在国内岳母家。 有时自己在想，自己就是块耗材。我出国这么多年，没找过我父母太多麻烦，23 岁工作之后，没找过父母要一分钱。房子也是自己和老婆自己存钱买的，装修家具家电花的都是我们自己的钱，现在孩子也基本是我和老婆自己带在身边。我父母也都 60 岁了，再过个十年估计需要我回国照顾了，这些我都是有思想准备的。让他们来这边养老那是不可能的，我父母骨子里很不适应这边的生活，他们只想让我待在这边好好赚钱。我和中国社会脱离了那么久，我又没有兄弟姐妹，以后哪天父母病了，突然叫我回去照顾他们的话，感觉自己真的会无所适从。 我就感觉啊，我自己真的是完全和中国社会脱节，回国立马变小白，啥事不懂。去年回去，我第一次办了国内手机流量，第一次使用支付宝付钱，第一次在国内叫外卖，感觉中国生活确实挺方便，我妈就连买菜都是网上买，人家送到小区，啧啧啧，这种生活在国外真是难以想象。对了，我活到 35 岁还没开过车，很想回国考个驾照，买辆属于自己的车。 第一代移民真的不容易，移民这条路父母自己也没走过。自己买房以前也是租房，和老同学合租一间房（租金太贵，一个人租住一个房间太奢侈），没什么隐私，就这样租房子住熬了十年。现在买房了也算是苦尽甘来，绿卡也是自己工作后申请拿到的。 像我孩子属于第二代移民，比我当年幸福得多，一生下来就有了这边的永居身份，有爱自己的爸爸妈妈围在身边，有自己的家。如果孩子一直在这边接受教育，大概率将来回不去中国了，而我和老婆以后是会回中国生活的，毕竟还是喜欢自己的国家。 第一代移民，作用就是承上启下。牺牲自己，不给父母经济上添堵，也没让父母成日带孙，压榨父母晚年生活。我孩子作为第二代移民，我们已经给他打好了基础，他也很容易融入当地。 可我自己呢，回中国不适应，在这边也没归属感，落着个里外不是人。真的很想回国定居个几年，回国生活消费也算是给国家经济作贡献了，但是回去就业是不可能了，肯定卷不过国内年轻人，自己有多少斤两还是拎得清的，也实在不想去挤兑国内同胞宝贵的就业资源，更何况国内企业还有 35 岁劝退机制。 我是我的爷爷奶奶一手带大的，可他们走的时候我都没能回国送一程，很想再回去看看爷爷奶奶当年的故居，再去看看自己年少时走过的路，小时候觉得要走很久的老街，玩耍过的公园，一切都会是那么熟悉亲切。 人生其实很短暂，如今觉得自己也不年轻了，有太多想做的事没有去做，可人到中年有太多责任，不可能任性妄为，等把孩子养大了，父母也需要照顾了。每当想到这些，时常会很感慨，也算是一种烦恼吧。 ———————————————————— 看了大家给我的评论，每一条都认真看了，真心感谢大家给我的建议。 想给大家分享一件事，关于我工作中的一位同事。这位同事是马来西亚华裔，也算是共事多年了，虽然交集不多，但平时这人也还好，并没有什么特别不好相处，平时性格也软绵绵挺腼腆的样子。直到有一天，和我比较要好的另一位同事（也是马来西亚华裔）把他 fb 上面的留言截图发给我看，我真的是惊掉了下巴。他真是一位狂热的 F 华人士，他特别喜欢关注中国的新闻，而且常年留言，骂得特别难听，什么中国 JB 之类的留言他都写在上面。我多次托人委婉的告诉他，注意一下中国同事的感受，哪知道，他回复人家这不关我的事，想写什么是他的自由，让我不要多管闲事。fb 都是真实姓名挂在上面，他居然还摆出一副有恃无恐的样子，骂了你中国人你又能拿我怎样的态度。再后来，我忍无可忍，在公司和他大吵了一架。当时我什么也不想管了，哪怕是丢工作，我发疯似的对着他大声怒吼咆哮，他第一次看见我是这个样子，吓得脸色苍白，跑去老板的办公室，而我追在后面，当着老板的面，指着他的鼻子，破口大骂…… 这件事，让我想起了一首唐诗： 一自萧关起战尘，河湟隔断异乡春。汉儿尽作胡儿语，却向城头骂汉人。 长着黄皮肤黑头发，讲着中文的人，却在网上打着中国字，用恶毒的语言大骂中国人，内心实在是五味杂陈。久居南洋的华裔们，也许早已忘记了那个祖先的国度，但是，我不希望自己的孩子也变成这样。然道我辛辛苦苦养大的孩子，长大后就做一个数典忘祖的香蕉人？ 孩子长大以后，无论他选择去哪个国家，选择怎样的生活，我都会尊重他自己的选择。但是，做人要饮水思源，知道自己打哪来，知道自己的根在哪。 一代移民除了要面对精神和文化方面的冲击以外，也有很多现实生活的烦恼。很多留言表示羡慕润在外的人，其实大可不必，现在国外也一片惨淡，新加坡的制造业非常萧条，到处在裁员，物价却一直在涨。 编辑于 2023-04-29 22:29・IP 属地新加坡 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~","link":"/kewenlu2023/posts/38e10cc4/"},{"title":"逛知乎：警方抓获卖淫女后，会不会用交易记录寻嫖客？","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。逛知乎：警方抓获卖淫女后，会不会用交易记录寻嫖客？ 原答案：警方抓获卖淫女后，为何不用交易记录寻嫖客？ 会倒查，奉劝所有人洁身自好。 19 年郑州 9 月付了 400 块，20 年 4 月被上单位带走了，单位性质属于国企央企这一种，场面真是社死，一直就审问我，但也没进那个讯问室，就在大厅保安坐的那个地方审讯我，还和我说没关系，已经过时效了，就是做个证人。 但我就害怕这个承认也不好，单位太特殊了，我解释说我明天要去别人婚礼随礼，手里没现金，我是换零钱和小姐才有的付款记录。说实话挺尴尬，因为警察看我跟看傻子一样，我感觉我的行为早就被看透了，大家都心知肚明就我嘴硬罢了。 然后晚上让我走了，我以为就没事了。 但后续 6 天后，警察电话给我让我过去，说如果不去就接着去家里单位传唤，我就去了，这一回进讯问室了，我就按照上次那个对话大概又说了一遍，还是没承认，做了笔录，然后签字手印了。 然后没让我走，下午送拘留所了，15 天拘留再加 5000 罚款，送拘留所的时候我问时效的事，警察给我解释了，大概意思就是对方 2 月份就被抓了，时效没过 真的忏悔，真的悔不当初，对我的人生影响确实太大了，事业家庭都因为自己冲动改变了 发布于 2023-07-08 18:58・IP 属地河南~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu2023/posts/f5f6fbb2/"},{"title":"逛知乎：计算机专业就业谈","text":"原答案：搞研发的进了国企是不是就废了? 文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。逛知乎：计算机专业就业谈 计算机专业。本科毕业后： 在事业单位几年，做信息技术。单位搞 IT 的就我一个人，能自己开发小系统、小网站、管管新闻发布、简单的运维……。锻炼：独立开发简易项目（不懂高并发）、写文章改文章、简单处理一些办公室内事务。期间在职读了个双证水硕。 这是个劳务派遣合同工，不是事业编，不然也不会有下面的故事第二份工作，互联网中厂几年，做后端研发。因为上一段工作经历，我的水平还不如应届生（他们基础扎实、leetcode 写的更溜）。技术负责人面试我时，觉得我技术一般，但能说会道。就要了我。实际工作中，能力果然是团队垫底。但大家都喜欢我。尤其大领导多次表扬过公司 wiki 里面那个文档写的最详细的人。但部门主管不太喜欢我，觉得我技术菜。锻炼：看过更好的代码规范（虽然也只是屎山）、从策划到上线的协作、千万级用户的后端的服务架构（其实也就是一堆服务器、各类数据库、缓存组件的搭配应用，因为架构并不好，经常要做线上运维）——看过猪跑，就够了。 第三份工作，到传统行业国企做信息总监（怎么描述呢？这是个中层管理岗位，部门负责人不一定到达中层这个级别，但中层一定是部门负责人或位列班子。骄傲点讲 — 级别仅次于几位领导，谦虚点讲 — 直接手下也就几个干活的人仅此而已。但可以充分调动各类资源做事情，比如几十家子公司的信息部也需向我这个条线汇报，我也需要向上面各种条线做汇报）。将互联网看过的那些东西，拿到这里做数字化转型（虽然我很讨厌这个时髦的词），是绝对够用的。平时也会自己研发一些小型 IT 项目——综合前两份工作：有独立开发系统的能力、在某些技术方面有特长、知道先进的东西怎么搭起来、也能充分引入各种组件（比如随便拿个 Grafana 就一天搭好了数据大屏）；同时管理部门、沟通上下级单位、项目管理、写报告等。技术不会再提升，但体系框架很多年都不会过时，变成了一个比较综合的 IT 管理者角色。目前喜欢这份职业。 工作中有许多特定的偏专业的领域，在互联网也很难遇到，比如：网络信息安全（防护、测评、……）、数字化转型的方方面面、数据库和其他基础设施的管理、引入一堆软件过程中的项目管理、IT 做预算和成本控制的经验能力、自行研发的辅助工具改进工作流程，…… 再小的单位也能拎出几十个项目，最终都成为经验丰富的 IT 老兵。 以前有一位大学老师的航天高工，他讲：“在这个世界上，谁能估算，谁就会发光”，我的大概理解是：在这个行业深耕后才能知道新做一个项目要花多少钱，行价是多少，实施要花多久，可能出现什么问题，…… 将来的职业方向，要么在本单位继续（包括到本单位或子公司高半级管理岗位、或上级单位继续从事 IT 工作），或同行业、或其他传统国企、500 强私企等信息技术部，从事管理一类工作。再不济也能去小单位做这种工作。肯定是没本事回到互联网了。 感觉也就是 IT 行业总是讲技术提升，因技术变幻。其他如建筑土木机械一类的，毕业后都是在叠加经验。回答几个问题： 一、社招很难进国央企吗？ 地区不同，差别大。比如北京那些偏体制的单位，社招可能难——所谓注重校招生的培养。但从校招生的专员助理，一步步培养到主任总监，这中间又有多少职级的槛要跨越。即便如国企也是急需用人，有时候员工可以躺平、但总有要能负责能干事的人，他们适合做各个条线负责人（你要相信只是写文档也可能让你天天加班到深夜）、或是某些市场化的国央企需要优秀的市场人员。社招通过招聘、猎头、调动、推荐等考察招聘形式都有。诚恳的建议是，当你在私企已是一个很有能力、比较受欢迎的人，你想去国企担任不错的岗位，可能需要多留意各种平台的招聘，或仅差某人的一句美言 “我有个前同事很靠谱，要不要叫来面面”，有些美言是对 hr 说的，效果 10%；有些是对领导说的，效果 90%+。所谓 “关系户”，也可以是靠自己后天取得的。但比如北京有些单位和户口强挂钩的，没有户口就没有应聘资格。南方更为宽松灵活。 二、技术理想 这里确实没有技术理想。我在第一份工作时，总想着现在做的东西只为了百千人服务，自己的价值仅在单位内部。希望能做千万人用的东西，才是给世间的价值。后来参与那些大项目，仅仅是短暂的快乐，因为自己的屎山很快就被替换成别人的屎山，你找不到存在过的痕迹。如果非要留下点啥，可以写几篇论文，可作为学术垃圾永垂文献史。 编辑于 2023-07-12 17:41・IP 属地上海 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu2023/posts/6f5c5492/"},{"title":"闲聊：AI讲笑话","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 无聊，也不知道今天该写个什么主题。索性分别用 ChatGPT 和 BingGPT 讲讲笑话看看谁的更好笑。 出题讲一个笑话。故事的主人公是梅西和詹姆斯，故事发生在中国的贵州乡镇。 ChatGPT以下是梅西和詹姆斯在贵州乡镇的笑话： 梅西和詹姆斯来到贵州乡镇，想尝尝当地的美食。他们走进一家铺子，看到橱窗里有一盘看起来非常好吃的小吃，于是点了一份。 这时铺子老板送上来一盘看起来非常像蚯蚓的东西，用英文告诉他们：“这是龙虫。” 梅西和詹姆斯顿时愣住了，不知道该怎么吃，于是他俩犹豫了半天。老板见状，就解释说：“这可是当地的特产啊，不吃一下怎么能算来过贵州呢？” 于是梅西和詹姆斯就鼓足勇气大口吃起来。吃着吃着，梅西忽然皱起了眉头，非常不喜欢这个味道，而詹姆斯吃得津津有味，说道：“梅西，你怎么不吃了？这可是贵州的美食啊！” 梅西十分犹豫，最终无奈地回答道：“算了吧，不吃了。我的胃口实在是太梅西了。” BingGPT好的，我会尝试创作一个笑话。故事的主人公是梅西和詹姆斯，故事发生在中国的贵州乡镇。请看： 梅西和詹姆斯是两个来自美国的旅行者，他们想要体验中国的乡村风情，所以他们来到了贵州的一个小镇。他们在一家客栈住下，然后去镇上逛逛。他们看到了很多有趣的东西，比如苗族的服饰、银饰、刺绣，还有各种各样的美食。他们很好奇，就想要尝试一些。 他们走到了一个摊位前，看到了一些黑色的圆形物体，上面有白色的芝麻。他们问老板这是什么，老板说这是糯米糍，是当地的特色小吃。梅西和詹姆斯觉得很新鲜，就买了两个。他们咬了一口，突然觉得嘴里一股辣味，眼泪都快出来了。原来这不是普通的糯米糍，而是加了辣椒酱的麻辣糯米糍。他们连忙找水喝，但是水却越喝越辣。他们问老板怎么回事，老板说这是花椒水，是当地人喜欢喝的饮料，可以增加食欲和消化。梅西和詹姆斯觉得自己被坑了，气得不行。他们决定不再尝试任何东西，赶紧回客栈休息。 第二天早上，他们准备离开这个小镇，去下一个目的地。他们打包好行李，下楼结账。客栈老板很热情地送他们，还给他们每人递了一个纸包。梅西和詹姆斯问这是什么，老板说这是他们的早餐，是当地的特色食品。梅西和詹姆斯觉得老板很好心，就接过纸包，打开一看。里面竟然是两个麻辣糯米糍！ ~~ 好吧，我真的有点无聊。他们讲的也不好笑。。。 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~","link":"/kewenlu2023/posts/f9a4596a/"},{"title":"闲聊：IC国家队，中国电科与中国电子","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 周末闲聊，整理一下两个电子类、体量相当的大央企，中国电科和中国电子的介绍资料。 CETC中国电子科技集团全称中国电子科技集团有限公司（CETC），简称“中国电科”。 CETC 成立于 2002 年 3 月 1 日，以原信息产业部直属研究院所和企业为基础组建而成，是国务院授权国务院国有资产监督管理委员会管理的中央企业，主要业务包括通信设备、计算机、电子设备制造、软件开发及应用、电子技术研究及服务、投资与资产管理等。 目前，中国电科拥有包括 47 家国家级研究院所、17 家上市公司在内的 700 余家企事业单位；拥有员工 20 余万名，其中 55% 为研发人员；拥有 41 个国家级重点实验室、研究中心和创新中心。~CETC集团简介 二级单位 中国普天信息产业集团有限公司 中电网络通信有限公司 中电科技集团重庆声光电有限公司 中电科电子装备集团有限公司 中电海康集团有限公司 中国电子科技网络信息安全有限公司 中电科仪器仪表有限公司 中国电子科技集团公司电子科学研究院 中国电子科技集团公司信息科学研究院 中国电子科技集团公司第三研究所 中国电子科技集团公司第七研究所 中国电子科技集团公司第八研究所 中国电子科技集团公司第九研究所 中国电子科技集团公司第十研究所 中国电子科技集团公司第十一研究所 中国电子科技集团公司第十二研究所 中国电子科技集团公司第十三研究所 中国电子科技集团公司第十四研究所 中国电子科技集团公司第十五研究所 中国电子科技集团公司第十六研究所 中国电子科技集团公司第十八研究所 中国电子科技集团公司第二十研究所 中国电子科技集团公司第二十一研究所 中国电子科技集团公司第二十二研究所 中国电子科技集团公司第二十三研究所 中国电子科技集团公司第二十七研究所 中国电子科技集团公司第二十八研究所 中国电子科技集团公司第二十九研究所 中国电子科技集团公司第三十六研究所 中国电子科技集团公司第三十八研究所 中国电子科技集团公司第三十九研究所 中国电子科技集团公司第四十三研究所 中国电子科技集团公司第四十六研究所 中国电子科技集团公司第四十七研究所 中国电子科技集团公司第四十九研究所 中国电子科技集团公司第五十一研究所 中国电子科技集团公司第五十三研究所 中国电子科技集团公司第五十四研究所 中国电子科技集团公司第五十五研究所 中电科技国际贸易有限公司 中国电子科技财务有限公司 中电科投资控股有限公司 中国远东国际贸易总公司 中电科数字科技（集团）有限公司 中电科航空电子有限公司 中电科芜湖钻石飞机制造有限公司 中电科海洋信息技术研究院有限公司 中科芯集成电路股份有限公司 中电科资产经营有限公司 上市公司 国睿科技股份有限公司 广州杰赛科技股份有限公司 杭州海康威视数字技术股份有限公司 太极计算机股份有限公司 上海华东电脑股份有限公司 安徽四创电子股份有限公司 卫士通信息产业股份有限公司 凤凰光学股份有限公司 CEC和 CETC 感觉很像的另一个大央企叫中国电子信息产业集团有限公司（CEC），简称“中国电子”。切记别混淆了。 CEC 成立于 1989 年 5 月，是我国民族电子工业的摇篮，是党领导下的人民军事电子工业的开拓者，是中央直接管理的以网信事业为核心主业的中央企业。近年来，中国电子主动服务国家战略，持续优化产业结构，围绕以数字技术支撑国家治理体系和治理能力现代化、服务数字经济高质量发展、保障国家网络安全三大核心任务，着力发展计算产业、集成电路、网络安全、数据应用、高新电子等重点业务，打造国家网信事业核心战略科技力量。 目前，中国电子拥有 19 家上市公司，687 家成员企业，21 余万员工，总资产 3993.4 亿元。~CEC集团简介 直属（控股）企业 南京中电熊猫信息产业集团有限公司 冠捷科技股份有限公司 中国电子财务有限责任公司 中国中电国际信息服务有限公司 彩虹集团有限公司 中国电子进出口有限公司 中国长城科技集团股份有限公司 中国振华电子集团有限公司 深圳长城开发科技股份有限公司 华大半导体有限公司 中国电子系统技术有限公司 中国软件与技术服务股份有限公司 上海浦东软件园股份有限公司 中国瑞达投资发展集团公司 成都中电锦江信息产业有限公司 中国信息安全研究院有限公司 中国电子信息产业集团有限公司第六研究所 中电长城网际系统应用有限公司 中电数据服务有限公司 中电智能卡有限责任公司 控股上市公司 上海贝岭股份有限公司 深圳市桑达实业股份有限公司 深圳长城开发科技股份有限公司 中国长城科技集团股份有限公司 南京华东电子信息科技股份有限公司 南京熊猫电子股份有限公司 中国振华（集团）科技股份有限公司 彩虹显示器件股份有限公司 中国软件与技术服务股份有限公司 中电光谷联合控股有限公司 晶门科技有限公司 中国电子华大科技有限公司 冠捷科技有限公司 彩虹集团新能源股份有限公司~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~","link":"/kewenlu2023/posts/441f22c0/"},{"title":"闲聊：什么是内卷？","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 看到一则很搞笑的解释“什么是内卷”的段子， 你有个仇家，你想弄死他，但是你俩的武功都差不多，谁也耐何不了谁，突然有一天你看见书店里面有本葵花宝典，你就买了，回家一咬牙就把自己的小弟弟给嘎了，神功练成了。 你的仇家知道后吓坏了，也去买了一本葵花宝典，也把自己给嘎了，结果你俩武功还是差不多，你还是没报仇成功，但是你俩都废了，这就是内卷。 虽然有偷换概念，倒也是让我们打工人释然了一些。 最近看了几个简历，其中有一个硕士毕业两年的大厂同学让我一度陷入了思考。因为这位应聘者在个人简介里赫然写道“能加班，每周、每天能从几点干到几点”云云。业务方面也和我预想的一样，面试范畴的八股文问题门儿清，一问到基础、理论就抓瞎。哎。 所以，什么时候“内卷”这一特质也开始悄悄的占据简历空间了呢？我很不解。“内卷”的结果不才是我们应该拿出来说的东西吗？ 联想到成都的就业市场，“初级”的应聘者已然一片红海，想要脱颖而出已不再是十年前那么容易。实在也不知道会是一个什么走向。作为公司，各种经验的人都要配置，但显然绝大多数人都停留在了“初级”工作的“内卷”+“重复”阶段，就业市场的人力资源难以均衡。 就想了这么多，假期闲聊一把。 另外，今天看到两位读者在公众号里回复错了索取“矩阵”学习资料的关键词，特此表示敬佩，祝一切顺利！如果有有意思的问题，欢迎找我讨论。 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~","link":"/kewenlu2023/posts/1334130f/"},{"title":"闲聊：少不读水浒？看看浙江省教育厅教研室怎么说","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 “少不读水浒，老不读三国”是我们比较熟悉的俗语了。 近日，一则“关于把水浒相关内容从中小学课文和课外读物中清除出去的建议”在浙江省民呼我为统一平台上引发了关注。 这一则问答非常有意思，各位也应该有过类似的疑虑。所以今天这里也摘出来供各位观摩，尤其是浙江省教育厅教研室的答复，非常值得了解。 来信详情标题关于把水浒相关内容从中小学课文和课外读物中清除出去的建议 内容描述尊敬的领导，您好！ 近来在电视剧栏目看水浒，感到震惊，虽然电视剧已对原本做了很多修改，删除了完全不合逻辑的情节，但由于电视剧与水浒原书千丝万缕的联系，还是会导致很多人去看原书，客观上导致水浒这本毒小说毒害更多人。看百度贴吧里，对此书的抨击之多就是明证。另外美化宋江丑化方腊尤其不能容忍（这点跟原书一模一样） 回想起我中小学时是通过学中学课文才去看水浒原书的。所以我对中小学选此书内容做课文深感不安，中小学不能给毒小说做推广宣传。 此书恶毒污蔑丑化女性（其恶毒程度到了令人发指地步），情节极其不合逻辑（108人的大多数完全没有上梁山的逻辑，就是作者大笔硬勾进去的），无原则歌颂滥杀无辜（作者有越坏越好的反道德观），毁灭人类三观的程度刷新了人类下限；作者心理极其阴暗变态（咋恶心咋写），给武松、李逵、宋江这些人渣安排善终，给予它们无限的同情，歌颂它们滥杀无辜的恶行，是我见过的最毒小说。古代把它列入禁书是有道理的。 把水浒列入四大名著（按我回忆，就是从八十年代开始的），是只看文笔不看情节的荒唐做法，应该把此书从四大名著中踢除，从中小学课文剔除，不要再糟蹋名著一词。它是名著中彻头彻尾的水货。名著不一定要四大，三大也可。几大名著的提法也不必盲从某专家，现在很多人已经对把水货（水浒两字恰如其分的谐音）列入名著强行推广深感不满。 《武松打虎》等两三篇课文确实好，但原书中武松、晁盖之流却是彻头彻尾的人渣。文笔好的小说多的是，不需要从毒小说中找课文素材。更要禁止任何学校向学生推荐水浒做课外读物。 鉴于八十年代以来水浒的毒素散布已久，建议一段时间内向学生推荐《黑水浒》全部和《荡寇志》的部分内容，以逐步肃清水浒的流毒。《荡寇志》和《黑水浒》一定程度化解了水浒的反逻辑反人类内容，歌颂了惩恶扬善，文笔虽差些，但可由当代专家做润色修改。 八十年代我第一次看水浒时，看的洁本水浒，虽然做了大量修订工作，但原书反逻辑反人类情节过多，难以像毛氏父子修订三国演义那样通过全面修订来完善。洁本是比原本好些，但不管怎么改，宋江形象难以改善，它是一个贯穿始终的、极大的败笔，无法靠局部修订解决。 水浒电视剧拍摄也应结合荡寇志和《黑水浒》（两本书各取一部分）来设计结局，以体现惩恶扬善的人类美德，而不是做相反的努力。不要怕颠覆已形成的对宋江一伙的认知，还原宋江一伙的真面目是文化界的责任。从正史资料可知，宋江一伙不是任何形式的农民起义（其实是一伙盗匪，宋江更与农民八竿子打不着），它与同时期方腊起义（反压迫）有本质的区别。水浒电视剧却反其道而行之，跟原书一样无耻吹捧宋江、恶毒污蔑方腊，这是对历史的极大歪曲，如此颠倒黑白，在青少年中产生很大的思想混乱。 回复详情答复单位省教育厅教研室 答复意见您好！ 您的来信我们已经认真阅读，感谢您对中小学生成长的关爱。孩子是祖国的未来，阅读又是教育的基石，中小学生读什么书，怎么读书，备受社会关注。您认为中小学生不适合读《水浒》，关于这个问题，自古就有“少不读《水浒》，老不读《三国》”的说法，著名学者刘再复先生也认为《水浒》“蕴含着毒气和血腥气”，可见您的顾虑与担忧是有一定道理的。既然如此，那么为什么将《水浒》收入中小学课文，甚至提倡整本书阅读？我想教材编写是一件非常严肃的事，关乎国家下一代接班人的培养，关乎国家的前途与命运，作为教材的编写者绝对不会草率为之，肯定是经过好几番讨论研究才能确定，而且教材的审定也是要一关一关慎重审查的。最后《水浒》内容能被选入教材，我们认为主要有以下三点考虑： 第一，《水浒》文学价值巨大。《水浒》是中国历史上第一部用白话文写成的长篇小说，开创了白话章回体小说的先河。即便是刘再复先生，他也不否认《水浒》“是有才艺、有艺术魅力的大才子书”。可以说《水浒》是一部非常接地气、最能反应现实与人性的文学作品，书中很多创新之处，被后世文学争相模仿。仅从文法角度来说，全书“行文如行兵”，谋篇布局非常纯熟，将草蛇灰线法运用得淋漓尽致。明代文学家金圣叹曾指出，水浒书中的十五种创新文法，包括倒插法、夹叙法、大落墨法、绵针泥刺法、弄引法等，这些写作手法直到今天，我们仍能常常看到。中学生通过阅读，可以从文本的语言、人物塑造和情节设计等方面赏析作品，提升语言技能和鉴赏水平。 第二，《水浒》是批判性阅读的好载体。《水浒》价值取向与现代文明不合拍，是阅读《水浒》不可回避的问题。但阅读《水浒》是否必会造成中学生误入歧途？目前并没有证据表明当代青少年误入暴力犯罪深渊，与《水浒》有直接的因果关联。就算退一步来说，如今阅读的渠道太多太多，但单靠“堵”的方式是解决不了根本问题的。堵不如疏，疏不如引，惟有理性地引导才是解决问题的关键。与随心所欲、听之任之，让学生个体“偷摸着自由阅读”相比，从另一个角度来说，《水浒》内容被选入教材，又何尝不是明智之举？正如华南师范大学教育科学学院教授、博士生导师张敏强所认为的，“《水浒》内容很有价值，应在中小学课本中保留，但是中小学生心理发展不成熟，授课老师有必要进行引导。”我们不能一味地强调其经典性而完全忽略对学生困惑的引导，也不能因为其充斥“暴力”等元素而因噎废食，应该让学生理解中国古典小说中的“精华”和“糟粕”，要以理性的态度来解读它，通过解读，实现解“毒”。所以，我们也要求老师在教学中能够用准确的方式引导中小学生实行批判性阅读。批判性阅读能力，是未来的核心竞争力，实际上很多老师在教学中已经注重批判性阅读与思维习惯的培养，也积累了一定的教学经验，这对学生阅读思维乃至个人发展是十分有利的。 第三，《水浒》蕴含着丰富的教育价值，这其实是前面两点的延伸。《水浒》没有给我们展现一个“正确”的世界，而是一个多样的世界。有善，有恶，有善与恶之间的种种不得已，幻想、隐忍、挣扎、妥协、反抗……一言一行背后都镌刻着人性的复杂。丰富且深刻的内核，是《水浒》被列入名著的理由，也是值得我们（包括中小学生）一读再读的根本原因。中小学生该怎样阅读《水浒》这部名著呢？教学中，教师会引导学生读故事、读人物、读社会、读人性，如“庙堂失序与江湖理想”“个体失路的偶然与必然”“快意恩仇与暴力滥杀”“水浒女性的是是非非”“侠义与忠义”“江湖聚义的善与恶”“反叛与归顺”等专题探究，学生带着这些思辨性的专题，并在教师的引导下去开展深度阅读，不仅能够进入文本深处，也能培养他们的个性阅读、独立思考的能力。阅读可以丰富思想、增长才干，促进人的思想观念的现代化，但如果阅读仅仅读了文字却无思考，那么阅读就没有任何意义。学生通过批判性阅读的过程，能够有效筛选信息，“站出来”去分析思索深层意义，阅读才发挥了其真正的意义。所以，重要的不在于你“读了什么书”，而在于你“怎样把每本书读好”，有针对性地指导孩子阅读，让他们学会判断，在经典书籍（包括《水浒》）中吸取精华，才能真正让阅读为学生打好精神底色。 心随文动，相互映发，质疑思辨，提要钩沉……这些都会给阅读者带来愉悦舒畅的读书体验，“怎样把书读好”，是我们庄严而宝贵的生命赋予自身的重要使命。 最后，再次感谢您对中小学生成长的关爱！感谢您对教育的支持！ ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~~ 至少，点个赞再走吧~","link":"/kewenlu2023/posts/bfbb9271/"},{"title":"闲聊：画一个“五彩斑斓的黑”","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 今天 AI 主题拖更了，原因是程序没按预期跑起来，调了一会儿电脑直接死机重启了。 顿时兴趣全无。 突然想到了一句“五彩斑斓的黑”。 现在不是有 AIGC 吗，前面也推荐过一个小工具 👉AI：DALL·E Mini，从文本生成图像👈，就想看看 AI 是怎么理解这个命题作画的，结果如下👇感觉有点意思~ ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~","link":"/kewenlu2023/posts/37b90e06/"}],"tags":[{"name":"人文","slug":"人文","link":"/kewenlu2023/tags/%E4%BA%BA%E6%96%87/"},{"name":"时事","slug":"时事","link":"/kewenlu2023/tags/%E6%97%B6%E4%BA%8B/"},{"name":"一周速览","slug":"一周速览","link":"/kewenlu2023/tags/%E4%B8%80%E5%91%A8%E9%80%9F%E8%A7%88/"},{"name":"科技","slug":"科技","link":"/kewenlu2023/tags/%E7%A7%91%E6%8A%80/"},{"name":"AI","slug":"AI","link":"/kewenlu2023/tags/AI/"},{"name":"GNN","slug":"GNN","link":"/kewenlu2023/tags/GNN/"},{"name":"C++","slug":"C","link":"/kewenlu2023/tags/C/"},{"name":"MLIR","slug":"MLIR","link":"/kewenlu2023/tags/MLIR/"},{"name":"LLVM","slug":"LLVM","link":"/kewenlu2023/tags/LLVM/"},{"name":"python","slug":"python","link":"/kewenlu2023/tags/python/"},{"name":"大佬","slug":"大佬","link":"/kewenlu2023/tags/%E5%A4%A7%E4%BD%AC/"},{"name":"体育","slug":"体育","link":"/kewenlu2023/tags/%E4%BD%93%E8%82%B2/"},{"name":"足球","slug":"足球","link":"/kewenlu2023/tags/%E8%B6%B3%E7%90%83/"},{"name":"年度","slug":"年度","link":"/kewenlu2023/tags/%E5%B9%B4%E5%BA%A6/"},{"name":"百科","slug":"百科","link":"/kewenlu2023/tags/%E7%99%BE%E7%A7%91/"},{"name":"图灵奖","slug":"图灵奖","link":"/kewenlu2023/tags/%E5%9B%BE%E7%81%B5%E5%A5%96/"},{"name":"诺贝尔奖","slug":"诺贝尔奖","link":"/kewenlu2023/tags/%E8%AF%BA%E8%B4%9D%E5%B0%94%E5%A5%96/"},{"name":"尬聊","slug":"尬聊","link":"/kewenlu2023/tags/%E5%B0%AC%E8%81%8A/"},{"name":"电影","slug":"电影","link":"/kewenlu2023/tags/%E7%94%B5%E5%BD%B1/"},{"name":"旅行","slug":"旅行","link":"/kewenlu2023/tags/%E6%97%85%E8%A1%8C/"},{"name":"生活","slug":"生活","link":"/kewenlu2023/tags/%E7%94%9F%E6%B4%BB/"},{"name":"生物","slug":"生物","link":"/kewenlu2023/tags/%E7%94%9F%E7%89%A9/"},{"name":"文物","slug":"文物","link":"/kewenlu2023/tags/%E6%96%87%E7%89%A9/"},{"name":"省馆之宝","slug":"省馆之宝","link":"/kewenlu2023/tags/%E7%9C%81%E9%A6%86%E4%B9%8B%E5%AE%9D/"},{"name":"看球去了","slug":"看球去了","link":"/kewenlu2023/tags/%E7%9C%8B%E7%90%83%E5%8E%BB%E4%BA%86/"},{"name":"老外","slug":"老外","link":"/kewenlu2023/tags/%E8%80%81%E5%A4%96/"},{"name":"航天","slug":"航天","link":"/kewenlu2023/tags/%E8%88%AA%E5%A4%A9/"},{"name":"荐歌","slug":"荐歌","link":"/kewenlu2023/tags/%E8%8D%90%E6%AD%8C/"},{"name":"数学","slug":"数学","link":"/kewenlu2023/tags/%E6%95%B0%E5%AD%A6/"},{"name":"贝叶斯","slug":"贝叶斯","link":"/kewenlu2023/tags/%E8%B4%9D%E5%8F%B6%E6%96%AF/"},{"name":"趣闻","slug":"趣闻","link":"/kewenlu2023/tags/%E8%B6%A3%E9%97%BB/"},{"name":"通报","slug":"通报","link":"/kewenlu2023/tags/%E9%80%9A%E6%8A%A5/"},{"name":"Quora","slug":"Quora","link":"/kewenlu2023/tags/Quora/"},{"name":"逛知乎","slug":"逛知乎","link":"/kewenlu2023/tags/%E9%80%9B%E7%9F%A5%E4%B9%8E/"},{"name":"海外","slug":"海外","link":"/kewenlu2023/tags/%E6%B5%B7%E5%A4%96/"},{"name":"闲聊","slug":"闲聊","link":"/kewenlu2023/tags/%E9%97%B2%E8%81%8A/"}],"categories":[{"name":"人文","slug":"人文","link":"/kewenlu2023/categories/%E4%BA%BA%E6%96%87/"},{"name":"科技","slug":"科技","link":"/kewenlu2023/categories/%E7%A7%91%E6%8A%80/"}],"pages":[{"title":"关于&quot;科文路&quot;","text":"Tech_LA（科文路） exists at the intersection of Technology and Liberal Arts. 这个站点是微信公众号“科文路”的一个存档，扫下方二维码可以关注该公众号。 站在科技与人文的交叉路口，这个公众号分享一些号主茁壮二次生长的历程。内容上，科学技术方面侧重于人工智能（机器学习、深度学习、强化学习），统计，集成电路，计算机体系结构，科技新闻等等；人文方面很难保证质量，能邀到大佬朋友的文章就着重发，没有就只有看我写的口水文了。 能力一般，水平有限，希望能对读者有所帮助。有问题或建议可以直接在公众号内回复。 微信公众号：科文路 头条号：科文路 抖音号：看球去了","link":"/kewenlu2023/about/index.html"},{"title":"404","text":"公益404页面 // xlindo","link":"/kewenlu2023/images/404.html"}]}